Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_MEAR15" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000019C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="ERRADD" edc:nzwidth="0x20" edc:desc="Master Error Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x44" edc:_addr="0x400001A0"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn------n" edc:impl="0xFFFFFF81" edc:_addr="0x400001E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CFGFRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D4154"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400001E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400001EC"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40000200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="LAUSERH0" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH1" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH2" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH3" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH4" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH5" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH6" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="LAUSERH7" edc:nzwidth="0x1" edc:desc="Low Area USER in HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH0" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH1" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH2" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH3" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH4" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH5" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH6" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="RDUSERH7" edc:nzwidth="0x1" edc:desc="Read USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH0" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH1" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH2" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH3" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH4" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH5" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH6" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="WRUSERH7" edc:nzwidth="0x1" edc:desc="Write USER for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA0" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA1" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA2" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA3" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA4" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA5" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA6" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
            <edc:SFRFieldDef edc:cname="DPSOA7" edc:nzwidth="0x1" edc:desc="Downward Protection Split Address for HSELx Protected Region"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
