Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PRTSR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="PRTOP0" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP1" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP2" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP3" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP4" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP5" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP6" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
            <edc:SFRFieldDef edc:cname="PRTOP7" edc:nzwidth="0x4" edc:desc="HSELx Protected Region Top"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PPSELR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="USERP0" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP1" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP2" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP3" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP4" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP5" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP6" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP7" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP8" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP9" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP10" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP11" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP12" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP13" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP14" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP15" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP16" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP17" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP18" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP19" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP20" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP21" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP22" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP23" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP24" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP25" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP26" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP27" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP28" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP29" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP30" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP31" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PPSELR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="USERP0" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP1" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP2" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP3" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP4" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP5" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP6" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP7" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP8" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP9" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP10" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP11" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP12" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP13" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP14" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP15" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP16" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP17" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP18" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP19" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP20" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP21" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP22" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP23" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP24" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP25" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP26" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP27" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP28" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP29" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP30" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP31" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
