Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MATRIX0" edc:cname="MATRIX0_PPSELR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400002C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX0">
            <edc:SFRFieldDef edc:cname="USERP0" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP1" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP2" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP3" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP4" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP5" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP6" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP7" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP8" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP9" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP10" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP11" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP12" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP13" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP14" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP15" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP16" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP17" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP18" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP19" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP20" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP21" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP22" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP23" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP24" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP25" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP26" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP27" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP28" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP29" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP30" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
            <edc:SFRFieldDef edc:cname="USERP31" edc:nzwidth="0x1" edc:desc="User PSELy Peripheral"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3D34" edc:_addr="0x400002CC"/>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_FMR" edc:nzwidth="0x20" edc:access="---------------n--------------nn" edc:impl="0x10003" edc:_addr="0x40004000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FPSI" edc:nzwidth="0x1" edc:desc="Flash Power Status Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="Must be written to 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_FCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40004004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="FCMD" edc:nzwidth="0x8" edc:desc="Flash Command">
              <edc:SFRFieldSemantic edc:cname="GETD" edc:desc="Get Flash descriptor" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WP" edc:desc="Write page" edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WPL" edc:desc="Write page and lock" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EA" edc:desc="Erase all" edc:when="(field &amp; 0xFF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="EP" edc:desc="Erase page" edc:when="(field &amp; 0xFF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EPA" edc:desc="Erase pages" edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SLB" edc:desc="Set lock bit" edc:when="(field &amp; 0xFF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="CLB" edc:desc="Clear lock bit" edc:when="(field &amp; 0xFF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="GLB" edc:desc="Get lock bit" edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SGPB" edc:desc="Set GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="CGPB" edc:desc="Clear GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="GGPB" edc:desc="Get GPNVM bit" edc:when="(field &amp; 0xFF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="GCALB" edc:desc="Get CALIB bit" edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="WUS" edc:desc="Write user signature" edc:when="(field &amp; 0xFF) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="EUS" edc:desc="Erase user signature" edc:when="(field &amp; 0xFF) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="STUS" edc:desc="Start read user signature" edc:when="(field &amp; 0xFF) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="SPUS" edc:desc="Stop read user signature" edc:when="(field &amp; 0xFF) == 0x15"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FARG" edc:nzwidth="0x10" edc:desc="Flash Command Argument"/>
            <edc:SFRFieldDef edc:cname="FKEY" edc:nzwidth="0x8" edc:desc="Flash Writing Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started." edc:when="(field &amp; 0xFF) == 0x5A"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
