Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_FSR" edc:nzwidth="0x20" edc:access="---------------------------r-rrr" edc:impl="0x17" edc:_addr="0x40004008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="FRDY" edc:nzwidth="0x1" edc:desc="Flash Ready Status (cleared when Flash is busy)"/>
            <edc:SFRFieldDef edc:cname="FCMDE" edc:nzwidth="0x1" edc:desc="Flash Command Error Status (cleared on read or by writing HEFC_FCR)"/>
            <edc:SFRFieldDef edc:cname="FLOCKE" edc:nzwidth="0x1" edc:desc="Flash Lock Error Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WREER" edc:nzwidth="0x1" edc:desc="Write Register Error Status (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_FRR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000400C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="FVALUE" edc:nzwidth="0x20" edc:desc="Flash Result Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x40004010"/>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_FPMR" edc:nzwidth="0x20" edc:access="---------------n--nnnnnn----nnnn" edc:impl="0x13F0F" edc:_addr="0x40004040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="PWS_EN" edc:nzwidth="0x1" edc:desc="Power switch enable"/>
            <edc:SFRFieldDef edc:cname="PWS_STAT" edc:nzwidth="0x1" edc:desc="Power switch Status"/>
            <edc:SFRFieldDef edc:cname="PWS_DLY" edc:nzwidth="0x2" edc:desc="Power switch Delay">
              <edc:SFRFieldSemantic edc:cname="_75US" edc:desc="delay is set to 75 usec" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_150US" edc:desc="delay is set to 150 usec" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_300US" edc:desc="delay is set to 300 usec" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_600US" edc:desc="delay is set to 600 usec" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="VAR_FACTOR" edc:nzwidth="0x6" edc:desc="Variation Factor"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FUNC_ISOL_CTRL_N" edc:nzwidth="0x1" edc:desc="Flash insulated Control Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xA0" edc:_addr="0x40004044"/>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn---nnnnn" edc:impl="0xFFFFFF1F" edc:_addr="0x400040E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="GPNVMWP" edc:nzwidth="0x1" edc:desc="GPNVM Bit Write Protection"/>
            <edc:SFRFieldDef edc:cname="LOCKWP" edc:nzwidth="0x1" edc:desc="Lock Bit Write Protection"/>
            <edc:SFRFieldDef edc:cname="ERASEWP" edc:nzwidth="0x1" edc:desc="Page, Sector and Plane Write Protection"/>
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x1" edc:desc="User Signature Write Protection"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x454643"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x400040E8"/>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR0" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR1" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR2" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR3" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x4000410C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR4" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR5" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR6" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR7" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x4000411C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR8" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR9" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR10" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004128">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR11" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x4000412C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR12" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR13" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR14" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x40004138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_CR15" edc:nzwidth="0x20" edc:access="-------------------------nnn-nnn" edc:impl="0x77" edc:_addr="0x4000413C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
            <edc:SFRFieldDef edc:cname="ECC12_ENABLE" edc:nzwidth="0x1" edc:desc="BCH ECC enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB0" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB1" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004144">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB2" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004148">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB3" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4000414C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
