Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB4" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB5" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004154">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB6" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004158">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB7" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4000415C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB8" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB9" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB10" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004168">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB11" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4000416C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB12" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004170">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB13" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004174">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB14" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40004178">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_TESTCB15" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4000417C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="TCB" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_SR" edc:nzwidth="0x20" edc:access="--rrrrrr--------rrrrrr-rrrrrrr-r" edc:impl="0x3F00FDFD" edc:_addr="0x40004180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="Fixable error status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPT_FIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_FIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="Un-fixable error status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPT_NOFIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_NOFIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="HES" edc:nzwidth="0x3" edc:desc="Hardware Error Size"/>
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="write or read access"/>
            <edc:SFRFieldDef edc:cname="MEM_ID" edc:nzwidth="0x2" edc:desc="memory identification number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_IER" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40004184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="Fixable error"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="Un-fixable error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_IDR" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40004188">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="fixable error"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="un-fixable error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_IMR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x4000418C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="fixable error"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="un-fixable error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_FAILAR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40004190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="address of the error detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEFC" edc:cname="HEFC_HECC_FAILDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40004194">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEFC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="data of the error detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
