Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_PLLAR" edc:nzwidth="0x20" edc:access="--n--nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x27FFFFFF" edc:_addr="0x4000C028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="DIVA" edc:nzwidth="0x8" edc:desc="PLLA Front End Divider">
              <edc:SFRFieldSemantic edc:cname="_0" edc:desc="PLLA is disabled." edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="Divider is bypassed (divide by 1) and PLLA is enabled." edc:when="(field &amp; 0xFF) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PLLACOUNT" edc:nzwidth="0x6" edc:desc="PLLA Counter"/>
            <edc:SFRFieldDef edc:cname="FREQ_VCO" edc:nzwidth="0x2" edc:desc="VCO Frequency Configuratio">
              <edc:SFRFieldSemantic edc:cname="VCO0" edc:desc="Frequency range: 40-80 MHz" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VCO1" edc:desc="Frequency range: 70-150 MHz" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VCO2" edc:desc="Frequency range: 125-275 MHz" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="VCO3" edc:desc="Frequency range: 250-450 MHz" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MULA" edc:nzwidth="0xB" edc:desc="PLLA Multiplier"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="Must Be Set to 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_PLLBR" edc:nzwidth="0x20" edc:access="-nn--nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x67FFFFFF" edc:_addr="0x4000C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="DIVB" edc:nzwidth="0x8" edc:desc="PLLB Front End Divider">
              <edc:SFRFieldSemantic edc:cname="_0" edc:desc="PLLBis disabled." edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="Divider is bypassed (divide by 1) and PLLB is enabled." edc:when="(field &amp; 0xFF) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PLLBCOUNT" edc:nzwidth="0x6" edc:desc="PLLB Counter"/>
            <edc:SFRFieldDef edc:cname="FREQ_VCO" edc:nzwidth="0x2" edc:desc="VCO Frequency Configuration">
              <edc:SFRFieldSemantic edc:cname="VCO0" edc:desc="Frequency range: 40-80 MHz" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VCO1" edc:desc="Frequency range: 70-150 MHz" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VCO2" edc:desc="Frequency range: 125-275 MHz" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="VCO3" edc:desc="Frequency range: 250-450 MHz" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MULB" edc:nzwidth="0xB" edc:desc="PLLB Multiplier"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRCB" edc:nzwidth="0x2" edc:desc="PLLB Source Clock Selection">
              <edc:SFRFieldSemantic edc:cname="MAINCK" edc:desc="MAINCK is the source clock of PLLB." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RC2CK" edc:desc="RC2CK is the source clock of PLLB." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_MCKR" edc:nzwidth="0x20" edc:access="------------------n----n-nnn--nn" edc:impl="0x2173" edc:_addr="0x4000C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x2" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x3" edc:desc="Processor Clock Prescaler">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIV" edc:nzwidth="0x1" edc:desc="Master Clock Division">
              <edc:SFRFieldSemantic edc:cname="EQ_PCK" edc:desc="MCK is FCLK divided by 1." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV2" edc:desc="MCK is FCLK divided by 2." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="Shall be always write at '0'"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4000C034"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK0" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x4000C040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLBCKDIV is selected" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="MCK is selected" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK1" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x4000C044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLBCKDIV is selected" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="MCK is selected" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK2" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x4000C048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLBCKDIV is selected" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="MCK is selected" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCK3" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnn-nnn" edc:impl="0xFF7" edc:_addr="0x4000C04C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x3" edc:desc="Programmable Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLBCKDIV is selected" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="MCK is selected" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x8" edc:desc="Programmable Clock Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
