Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x4000C050"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IER" edc:nzwidth="0x20" edc:access="--------w-w--www----wwww----wwww" edc:impl="0xA70F0F" edc:_addr="0x4000C060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:nzwidth="0x1" edc:desc="PLLB Lock Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EXT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz external slow clock Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPUMON" edc:nzwidth="0x1" edc:desc="CPU Clock Monitor Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IDR" edc:nzwidth="0x20" edc:access="--------w-w--www----wwww----wwww" edc:impl="0xA70F0F" edc:_addr="0x4000C064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:nzwidth="0x1" edc:desc="PLLB Lock Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EXT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz external slow clock Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPUMON" edc:nzwidth="0x1" edc:desc="CPU Clock Monitor Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SR" edc:nzwidth="0x20" edc:access="--------r-rrrrrr----rrrrr---rrrr" edc:impl="0xBF0F8F" edc:_addr="0x4000C068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Status"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:nzwidth="0x1" edc:desc="PLLB Lock Status"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:nzwidth="0x1" edc:desc="Monitoring Domain Slow Clock Source Oscillator Selection"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Status"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Fault Output Status"/>
            <edc:SFRFieldDef edc:cname="EXT32KERR" edc:nzwidth="0x1" edc:desc="External Slow Clock Error"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPUMON" edc:nzwidth="0x1" edc:desc="CPU Clock Monitor Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IMR" edc:nzwidth="0x20" edc:access="--------r-r--rrr----rrrr----rrrr" edc:impl="0xA70F0F" edc:_addr="0x4000C06C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LOCKB" edc:nzwidth="0x1" edc:desc="PLLB Lock Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY3" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 3 Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Clock Source Oscillator Selection Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main RC Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EXT32KERR" edc:nzwidth="0x1" edc:desc="32.768 kHz Slow Clock Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPUMON" edc:nzwidth="0x1" edc:desc="CPU Clock Monitor Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4000C070"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FOCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x4000C078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:nzwidth="0x1" edc:desc="Fault Output Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4000C07C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PLL_CFG" edc:nzwidth="0x20" edc:access="nnnn--------nnnnnnnn--------nnnn" edc:impl="0xF00FF00F" edc:_addr="0x4000C080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="OUTCUR_PLLA" edc:nzwidth="0x4" edc:desc="PLLA Output Current">
              <edc:SFRFieldSemantic edc:cname="ICP0" edc:desc="0.5 mA" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ICP1" edc:desc="0.75 mA" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ICP2" edc:desc="1 mA" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ICP3" edc:desc="1.25 mA" edc:when="(field &amp; 0xF) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SCA" edc:nzwidth="0x2" edc:desc="Internal Filter PLL - Select Internal Capaticance Value">
              <edc:SFRFieldSemantic edc:cname="SC_VAL_20p" edc:desc="20 pF" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SC_VAL_40p" edc:desc="40 pF" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SC_VAL_30p" edc:desc="30 pF" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SC_VAL_60p" edc:desc="60 pF" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRA" edc:nzwidth="0x2" edc:desc="Internal Filter PLL - Select Internal Resistor Value">
              <edc:SFRFieldSemantic edc:cname="SR_VAL_24K" edc:desc="24 Ohms" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SR_VAL_6K" edc:desc="6 Ohms" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SR_VAL_3K" edc:desc="3 Ohms" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SR_VAL_12K" edc:desc="12 Ohms" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OUTCUR_PLLB" edc:nzwidth="0x4" edc:desc="PLLB Output Current">
              <edc:SFRFieldSemantic edc:cname="ICP0" edc:desc="0.5 mA" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ICP1" edc:desc="0.75 mA" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ICP2" edc:desc="1 mA" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ICP3" edc:desc="1.25 mA" edc:when="(field &amp; 0xF) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SCB" edc:nzwidth="0x2" edc:desc="Internal Filter PLL - Select Internal Capaticance Value">
              <edc:SFRFieldSemantic edc:cname="SC_VAL_20p" edc:desc="20 pF" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SC_VAL_40p" edc:desc="40 pF" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SC_VAL_30p" edc:desc="30 pF" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SC_VAL_60p" edc:desc="60 pF" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SRB" edc:nzwidth="0x2" edc:desc="Internal Filter PLL - Select Internal Resistor Value">
              <edc:SFRFieldSemantic edc:cname="SR_VAL_24K" edc:desc="24 Ohms" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SR_VAL_6K" edc:desc="6 Ohms" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SR_VAL_3K" edc:desc="3 Ohms" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SR_VAL_12K" edc:desc="12 Ohms" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x60" edc:_addr="0x4000C084"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn------nn" edc:impl="0xFFFFFF03" edc:_addr="0x4000C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x4000C0E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x4000C0EC"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnn-------n-nnn-nnnnnnn" edc:impl="0x3FF0177F" edc:_addr="0x4000C10C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID" edc:nzwidth="0x7" edc:desc="Peripheral ID"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLKCSS" edc:nzwidth="0x3" edc:desc="Generic Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="MD_SLCK is selected" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="PLLB_CLK" edc:desc="PLLBCK is selected" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="MCK_CLK" edc:desc="MCK is selected" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="MCK_RC2" edc:desc="RC2 is selected" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:nzwidth="0x1" edc:desc="Command"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="GCLKDIV" edc:nzwidth="0x8" edc:desc="Generic Clock Division Ratio"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="GCLKEN" edc:nzwidth="0x1" edc:desc="Generic Clock Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
