Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_OCR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4000C110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CAL4" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 4 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL4" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 4 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL8" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL8" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL12" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 12 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL10" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 10 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL10" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 10 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL12" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 12 MHz"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x4000C114"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PMMR" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:impl="0x7FF07FF" edc:_addr="0x4000C130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PLLA_MMAX" edc:nzwidth="0xB" edc:desc="PLLA Maximum Allowed Multiplier Value"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PLLB_MMAX" edc:nzwidth="0xB" edc:desc="PLLB Maximum Allowed Multiplier Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2C" edc:_addr="0x4000C134"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CPULIM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4000C160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CPU_LOW_IT" edc:nzwidth="0x8" edc:desc="CPU Monitoring Low IT Limit"/>
            <edc:SFRFieldDef edc:cname="CPU_HIGH_IT" edc:nzwidth="0x8" edc:desc="CPU Monitoring High IT Limit"/>
            <edc:SFRFieldDef edc:cname="CPU_LOW_RES" edc:nzwidth="0x8" edc:desc="CPU Monitoring Low RESET Limit"/>
            <edc:SFRFieldDef edc:cname="CPU_HIGH_RES" edc:nzwidth="0x8" edc:desc="CPU Monitoring High Reset Limit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4000C164"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrr-------rr--rrrr-------" edc:impl="0xFFC06780" edc:_addr="0x4000C170">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral Clock 7 Status"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral Clock 8 Status"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:nzwidth="0x1" edc:desc="Peripheral Clock 9 Status"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral Clock 10 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral Clock 13 Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral Clock 14 Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral Clock 22 Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral Clock 23 Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral Clock 24 Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral Clock 25 Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral Clock 26 Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral Clock 27 Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral Clock 28 Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral Clock 29 Status"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral Clock 30 Status"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral Clock 31 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR1" edc:nzwidth="0x20" edc:access="r---r---rrr--r----rr-----r-r--rr" edc:impl="0x88E43053" edc:_addr="0x4000C174">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral Clock 32 Status"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral Clock 33 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID36" edc:nzwidth="0x1" edc:desc="Peripheral Clock 36 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID38" edc:nzwidth="0x1" edc:desc="Peripheral Clock 38 Status"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral Clock 44 Status"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral Clock 45 Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral Clock 50 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral Clock 53 Status"/>
            <edc:SFRFieldDef edc:cname="PID54" edc:nzwidth="0x1" edc:desc="Peripheral Clock 54 Status"/>
            <edc:SFRFieldDef edc:cname="PID55" edc:nzwidth="0x1" edc:desc="Peripheral Clock 55 Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral Clock 59 Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PID63" edc:nzwidth="0x1" edc:desc="Peripheral Clock 63 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
