Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR2" edc:nzwidth="0x20" edc:access="---------------------------r-rrr" edc:impl="0x17" edc:_addr="0x4000C178">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID64" edc:nzwidth="0x1" edc:desc="Peripheral Clock 64 Status"/>
            <edc:SFRFieldDef edc:cname="PID65" edc:nzwidth="0x1" edc:desc="Peripheral Clock 65 Status"/>
            <edc:SFRFieldDef edc:cname="PID66" edc:nzwidth="0x1" edc:desc="Peripheral Clock 66 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID68" edc:nzwidth="0x1" edc:desc="Peripheral Clock 68 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_CSR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000C17C"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x4000C180"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR0" edc:nzwidth="0x20" edc:access="---r--r-r--------rr---rrr-------" edc:impl="0x12806380" edc:_addr="0x4000C190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="GPID7" edc:nzwidth="0x1" edc:desc="Generic Clock 7 Status"/>
            <edc:SFRFieldDef edc:cname="GPID8" edc:nzwidth="0x1" edc:desc="Generic Clock 8 Status"/>
            <edc:SFRFieldDef edc:cname="GPID9" edc:nzwidth="0x1" edc:desc="Generic Clock 9 Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GPID13" edc:nzwidth="0x1" edc:desc="Generic Clock 13 Status"/>
            <edc:SFRFieldDef edc:cname="GPID14" edc:nzwidth="0x1" edc:desc="Generic Clock 14 Status"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="GPID23" edc:nzwidth="0x1" edc:desc="Generic Clock 23 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GPID25" edc:nzwidth="0x1" edc:desc="Generic Clock 25 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GPID28" edc:nzwidth="0x1" edc:desc="Generic Clock 28 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR1" edc:nzwidth="0x20" edc:access="----------r--r-----------r-r----" edc:impl="0x240050" edc:_addr="0x4000C194">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="GPID36" edc:nzwidth="0x1" edc:desc="Generic Clock 36 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GPID38" edc:nzwidth="0x1" edc:desc="Generic Clock 38 Status"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="GPID50" edc:nzwidth="0x1" edc:desc="Generic Clock 50 Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GPID53" edc:nzwidth="0x1" edc:desc="Generic Clock 53 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR2" edc:nzwidth="0x20" edc:access="---------------------------r-rr-" edc:impl="0x16" edc:_addr="0x4000C198">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GPID65" edc:nzwidth="0x1" edc:desc="Generic Clock 65 Status"/>
            <edc:SFRFieldDef edc:cname="GPID66" edc:nzwidth="0x1" edc:desc="Generic Clock 66 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GPID68" edc:nzwidth="0x1" edc:desc="Generic Clock 68 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_GCSR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000C19C"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x4000C1A0"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_OSC2" edc:nzwidth="0x20" edc:access="--------nnnnnnnn-------n--nn---n" edc:impl="0xFF0131" edc:_addr="0x4000C1B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OSCRCF" edc:nzwidth="0x2" edc:desc="2nd Oscillator Frequency Selection">
              <edc:SFRFieldSemantic edc:cname="_4_MHz" edc:desc="The 2nd RC oscillator frequency is at 4 MHz" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_8_MHz" edc:desc="The 2nd RC oscillator frequency is at 8 MHz" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_10_MHz" edc:desc="The 2nd RC oscillator frequency is at 10 MHz" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_12_MHz" edc:desc="The 2nd RC oscillator frequency is at 12 MHz" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EN_WR_CALIB" edc:nzwidth="0x1" edc:desc="Enable Calibration Register Write"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Register Write Access Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x37"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_OCR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4000C1B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CAL4" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 4 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL4" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 4 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL8" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL8" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 8 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL12" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 12 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL12" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 12 MHz"/>
            <edc:SFRFieldDef edc:cname="CAL10" edc:nzwidth="0x7" edc:desc="Main RC Oscillator Calibration Bits for 10 MHz"/>
            <edc:SFRFieldDef edc:cname="SEL10" edc:nzwidth="0x1" edc:desc="Selection of Main RC Oscillator Calibration Bits for 10 MHz"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
