Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x7E48" edc:_addr="0x4000C1B8"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40014000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_MR" edc:nzwidth="0x20" edc:access="--nnnnnn-nnn--nn-------n---nnnnn" edc:impl="0x3F73011F" edc:_addr="0x40014004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="TRGEN" edc:nzwidth="0x1" edc:desc="Trigger Enable">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="External trigger mode disabled. DACC in free-running mode." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="External trigger mode enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:nzwidth="0x3" edc:desc="Trigger Selection">
              <edc:SFRFieldSemantic edc:cname="TRGSEL0" edc:desc="External trigger" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL1" edc:desc="TIOA Output of the Timer Counter Channel 0" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL2" edc:desc="TIOA Output of the Timer Counter Channel 1" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL3" edc:desc="TIOA Output of the Timer Counter Channel 2" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL4" edc:desc="PWM Event Line 0" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="TRGSEL5" edc:desc="PWM Event Line 1" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WORD" edc:nzwidth="0x1" edc:desc="Word Transfer">
              <edc:SFRFieldSemantic edc:cname="HALF" edc:desc="Half-word transfer" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="Word transfer" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="Must Be Set to 1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="USER_SEL" edc:nzwidth="0x2" edc:desc="User Channel Selection">
              <edc:SFRFieldSemantic edc:cname="CHANNEL0" edc:desc="Channel 0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CHANNEL1" edc:desc="Channel 1" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CHANNEL2" edc:desc="Channel 2" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TAG" edc:nzwidth="0x1" edc:desc="Tag Selection Mode">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Tag selection mode disabled. Using USER_SEL to select the channel for the conversion." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Tag selection mode enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXS" edc:nzwidth="0x1" edc:desc="Maximum Speed Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MAXIMUM" edc:desc="Maximum speed mode enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKDIV" edc:nzwidth="0x1" edc:desc="Shall be always write at '0'"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x6" edc:desc="Startup Time Selection">
              <edc:SFRFieldSemantic edc:cname="_0" edc:desc="0 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_8" edc:desc="8 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_16" edc:desc="16 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_24" edc:desc="24 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="64 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="_80" edc:desc="80 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="_96" edc:desc="96 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="_112" edc:desc="112 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="_512" edc:desc="512 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="_576" edc:desc="576 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="_640" edc:desc="640 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="_704" edc:desc="704 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="_768" edc:desc="768 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="_832" edc:desc="832 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="_896" edc:desc="896 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="_960" edc:desc="960 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="_1024" edc:desc="1024 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="_1088" edc:desc="1088 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="_1152" edc:desc="1152 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="_1216" edc:desc="1216 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="_1280" edc:desc="1280 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="_1344" edc:desc="1344 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="_1408" edc:desc="1408 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="_1472" edc:desc="1472 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="_1536" edc:desc="1536 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="_1600" edc:desc="1600 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="_1664" edc:desc="1664 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="_1728" edc:desc="1728 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="_1792" edc:desc="1792 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="_1856" edc:desc="1856 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="_1920" edc:desc="1920 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="_1984" edc:desc="1984 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="_2048" edc:desc="2048 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x20"/>
              <edc:SFRFieldSemantic edc:cname="_2112" edc:desc="2112 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x21"/>
              <edc:SFRFieldSemantic edc:cname="_2176" edc:desc="2176 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x22"/>
              <edc:SFRFieldSemantic edc:cname="_2240" edc:desc="2240 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x23"/>
              <edc:SFRFieldSemantic edc:cname="_2304" edc:desc="2304 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x24"/>
              <edc:SFRFieldSemantic edc:cname="_2368" edc:desc="2368 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x25"/>
              <edc:SFRFieldSemantic edc:cname="_2432" edc:desc="2432 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x26"/>
              <edc:SFRFieldSemantic edc:cname="_2496" edc:desc="2496 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x27"/>
              <edc:SFRFieldSemantic edc:cname="_2560" edc:desc="2560 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x28"/>
              <edc:SFRFieldSemantic edc:cname="_2624" edc:desc="2624 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x29"/>
              <edc:SFRFieldSemantic edc:cname="_2688" edc:desc="2688 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x2A"/>
              <edc:SFRFieldSemantic edc:cname="_2752" edc:desc="2752 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x2B"/>
              <edc:SFRFieldSemantic edc:cname="_2816" edc:desc="2816 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x2C"/>
              <edc:SFRFieldSemantic edc:cname="_2880" edc:desc="2880 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x2D"/>
              <edc:SFRFieldSemantic edc:cname="_2944" edc:desc="2944 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x2E"/>
              <edc:SFRFieldSemantic edc:cname="_3008" edc:desc="3008 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:SFRFieldSemantic edc:cname="_3072" edc:desc="3072 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x30"/>
              <edc:SFRFieldSemantic edc:cname="_3136" edc:desc="3136 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x31"/>
              <edc:SFRFieldSemantic edc:cname="_3200" edc:desc="3200 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x32"/>
              <edc:SFRFieldSemantic edc:cname="_3264" edc:desc="3264 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x33"/>
              <edc:SFRFieldSemantic edc:cname="_3328" edc:desc="3328 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x34"/>
              <edc:SFRFieldSemantic edc:cname="_3392" edc:desc="3392 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x35"/>
              <edc:SFRFieldSemantic edc:cname="_3456" edc:desc="3456 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x36"/>
              <edc:SFRFieldSemantic edc:cname="_3520" edc:desc="3520 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x37"/>
              <edc:SFRFieldSemantic edc:cname="_3584" edc:desc="3584 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x38"/>
              <edc:SFRFieldSemantic edc:cname="_3648" edc:desc="3648 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x39"/>
              <edc:SFRFieldSemantic edc:cname="_3712" edc:desc="3712 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x3A"/>
              <edc:SFRFieldSemantic edc:cname="_3776" edc:desc="3776 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x3B"/>
              <edc:SFRFieldSemantic edc:cname="_3840" edc:desc="3840 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x3C"/>
              <edc:SFRFieldSemantic edc:cname="_3904" edc:desc="3904 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x3D"/>
              <edc:SFRFieldSemantic edc:cname="_3968" edc:desc="3968 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x3E"/>
              <edc:SFRFieldSemantic edc:cname="_4032" edc:desc="4032 periods of peripheral clock" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40014008"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CHER" edc:nzwidth="0x20" edc:access="-----------------------------www" edc:impl="0x7" edc:_addr="0x40014010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CHDR" edc:nzwidth="0x20" edc:access="-----------------------------www" edc:impl="0x7" edc:_addr="0x40014014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Disable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Disable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CHSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0x40014018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Status"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Status"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4001401C"/>
      <edc:SFRDef ltx:memberofperipheral="DACC" edc:cname="DACC_CDR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40014020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DACC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Convert"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
