Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_IDR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40018018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIDR" edc:nzwidth="0x1" edc:desc="Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4001801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAIMR" edc:nzwidth="0x1" edc:desc="Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_DMA_ISR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40018020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="DMAISR" edc:nzwidth="0x1" edc:desc="Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40018024"/>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_CR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40018034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="RESET" edc:nzwidth="0x1" edc:desc="CRC Computation Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_MR" edc:nzwidth="0x20" edc:access="--------------n---------nnnnnnnn" edc:impl="0x200FF" edc:_addr="0x40018038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="CRC Enable"/>
            <edc:SFRFieldDef edc:cname="COMPARE" edc:nzwidth="0x1" edc:desc="CRC Compare"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Primitive Polynomial">
              <edc:SFRFieldSemantic edc:cname="CCITT8023" edc:desc="Polynom 0x04C11DB7" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CASTAGNOLI" edc:desc="Polynom 0x1EDC6F41" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CCITT16" edc:desc="Polynom 0x1021" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIVIDER" edc:nzwidth="0x4" edc:desc="Request Divider"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BITORDER" edc:nzwidth="0x1" edc:desc="Precomputation Bit Swap Operation of the CRC">
              <edc:SFRFieldSemantic edc:cname="MSBFIRST" edc:desc="CRC computation is performed from the most significant bit to the least significant bit" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LSBFIRST" edc:desc="CRC computation is performed from the least significant bit to the most significant bit" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_SR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4001803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="CRC" edc:nzwidth="0x20" edc:desc="Cyclic Redundancy Check Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_IER" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40018040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIER" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_IDR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x40018044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIDR" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_IMR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40018048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRIMR" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CRCCU" edc:cname="CRCCU_ISR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4001804C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CRCCU">
            <edc:SFRFieldDef edc:cname="ERRISR" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FB0" edc:_addr="0x40018050"/>
      <edc:SFRDef ltx:memberofperipheral="PCC" edc:cname="PCC_MR" edc:nzwidth="0x20" edc:access="nn-----------nnn----nnnn--nn---n" edc:impl="0xC0070F31" edc:_addr="0x4001C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCC">
            <edc:SFRFieldDef edc:cname="PCEN" edc:nzwidth="0x1" edc:desc="Parallele Capture Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DSIZE" edc:nzwidth="0x2" edc:desc="Data Size">
              <edc:SFRFieldSemantic edc:cname="1_DATA" edc:desc="1 data is read in the PCC_RHR" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="2_DATA" edc:desc="2 data are read in the PCC_RHR" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="4_DATA" edc:desc="4 data are read in the PCC_RHR (only for 8 bits data size, ISIZE = 0)" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCALE" edc:nzwidth="0x1" edc:desc="Scale Data"/>
            <edc:SFRFieldDef edc:cname="ALWYS" edc:nzwidth="0x1" edc:desc="Always Sampling"/>
            <edc:SFRFieldDef edc:cname="HALFS" edc:nzwidth="0x1" edc:desc="Half Sampling"/>
            <edc:SFRFieldDef edc:cname="FRSTS" edc:nzwidth="0x1" edc:desc="First Sample"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ISIZE" edc:nzwidth="0x3" edc:desc="Input Data Size">
              <edc:SFRFieldSemantic edc:cname="8_BITS" edc:desc="Input data bus size is 8 bits" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="10_BITS" edc:desc="Input data bus size is 10 bits" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="12_BITS" edc:desc="Input data bus size is 12 bits" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="14_BITS" edc:desc="Input data bus size is 14 bits" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="16_BITS" edc:desc="Input data bus size is 16 bits" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="CID" edc:nzwidth="0x2" edc:desc="Clear If Disabled">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Clear not enabled" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DEN1" edc:desc="Clear on falling edge on DEN1 enabled" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DEN2" edc:desc="Clear on falling edge on DEN2 enabled" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EITHER" edc:desc="Clear on falling edge on either DEN1 or DEN2 enabled" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PCC" edc:cname="PCC_IER" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x4001C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PCC">
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
