Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="FLEXCOM3" edc:cname="FLEX_TWI_WPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFFFF01" edc:_addr="0x4002C6E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXCOM3">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x18" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF914" edc:_addr="0x4002C6EC"/>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x4003C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="PT" edc:nzwidth="0x1" edc:desc="POTermConf"/>
            <edc:SFRFieldDef edc:cname="TA" edc:nzwidth="0x5" edc:desc="TermAddressConf"/>
            <edc:SFRFieldDef edc:cname="TC" edc:nzwidth="0x1" edc:desc="TRBitCmd"/>
            <edc:SFRFieldDef edc:cname="SC" edc:nzwidth="0x1" edc:desc="SSBitCmd"/>
            <edc:SFRFieldDef edc:cname="BC" edc:nzwidth="0x1" edc:desc="BusyBitCmd"/>
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x1" edc:desc="SREQBitCmd"/>
            <edc:SFRFieldDef edc:cname="BEC" edc:nzwidth="0x1" edc:desc="BCEnableCmd"/>
            <edc:SFRFieldDef edc:cname="RST" edc:nzwidth="0x1" edc:desc="Soft Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4003C004"/>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CMDR1" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4003C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="DATAWORDCOUNT" edc:nzwidth="0x5" edc:desc="DATA WORD COUNT"/>
            <edc:SFRFieldDef edc:cname="RTSUBADDRESS" edc:nzwidth="0x5" edc:desc="RT SUBADDRESS"/>
            <edc:SFRFieldDef edc:cname="T_R" edc:nzwidth="0x1" edc:desc="T/R"/>
            <edc:SFRFieldDef edc:cname="RTADDRESS" edc:nzwidth="0x5" edc:desc="RT ADDRESS"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CMDR2" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4003C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="DATAWORDCOUNT" edc:nzwidth="0x5" edc:desc="DATA WORD COUNT"/>
            <edc:SFRFieldDef edc:cname="RTSUBADDRESS" edc:nzwidth="0x5" edc:desc="RT SUBADDRESS"/>
            <edc:SFRFieldDef edc:cname="T_R" edc:nzwidth="0x1" edc:desc="R/T"/>
            <edc:SFRFieldDef edc:cname="RTADDRESS" edc:nzwidth="0x5" edc:desc="RT ADDRESS"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CMDR3" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x4003C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="BUS" edc:nzwidth="0x1" edc:desc="bus used"/>
            <edc:SFRFieldDef edc:cname="BCE" edc:nzwidth="0x1" edc:desc="1553 emitter"/>
            <edc:SFRFieldDef edc:cname="BCR" edc:nzwidth="0x1" edc:desc="1553 receiver"/>
            <edc:SFRFieldDef edc:cname="ER" edc:nzwidth="0x1" edc:desc="data or command transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_BITR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4003C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="TOBITWORD" edc:nzwidth="0x10" edc:desc="to bit word"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_VWR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x4003C01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="TOVECTORWORD" edc:nzwidth="0x10" edc:desc="to vector word"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_IER" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4003C020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="EMT" edc:nzwidth="0x1" edc:desc="EndMemTransfer"/>
            <edc:SFRFieldDef edc:cname="MTE" edc:nzwidth="0x1" edc:desc="MemTransferErr"/>
            <edc:SFRFieldDef edc:cname="ERX" edc:nzwidth="0x1" edc:desc="End reception"/>
            <edc:SFRFieldDef edc:cname="ETX" edc:nzwidth="0x1" edc:desc="EndTransmission"/>
            <edc:SFRFieldDef edc:cname="ETRANS" edc:nzwidth="0x2" edc:desc="EndTransfer"/>
            <edc:SFRFieldDef edc:cname="TE" edc:nzwidth="0x1" edc:desc="TransErr"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="TransCodingErr"/>
            <edc:SFRFieldDef edc:cname="TPE" edc:nzwidth="0x1" edc:desc="TransParityErr"/>
            <edc:SFRFieldDef edc:cname="TDE" edc:nzwidth="0x1" edc:desc="TransDataTypeErr"/>
            <edc:SFRFieldDef edc:cname="TTE" edc:nzwidth="0x1" edc:desc="TransTimeOutErr"/>
            <edc:SFRFieldDef edc:cname="TWE" edc:nzwidth="0x1" edc:desc="TransWordCounterErr"/>
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="BufIFErr"/>
            <edc:SFRFieldDef edc:cname="ITR" edc:nzwidth="0x1" edc:desc="IllegalTransferReq"/>
            <edc:SFRFieldDef edc:cname="TVR" edc:nzwidth="0x1" edc:desc="TransVecWordReq"/>
            <edc:SFRFieldDef edc:cname="DBR" edc:nzwidth="0x1" edc:desc="DynamicBusContReq"/>
            <edc:SFRFieldDef edc:cname="STR" edc:nzwidth="0x1" edc:desc="InitSelfTestReq"/>
            <edc:SFRFieldDef edc:cname="TSR" edc:nzwidth="0x1" edc:desc="TranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x1" edc:desc="OvTranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="SDR" edc:nzwidth="0x1" edc:desc="SyncWithDataReq"/>
            <edc:SFRFieldDef edc:cname="SWD" edc:nzwidth="0x1" edc:desc="SyncWithoutDataReq"/>
            <edc:SFRFieldDef edc:cname="RRT" edc:nzwidth="0x1" edc:desc="ResetRTReq"/>
            <edc:SFRFieldDef edc:cname="ITF" edc:nzwidth="0x1" edc:desc="InhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="OTF" edc:nzwidth="0x1" edc:desc="OvInhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="IPB" edc:nzwidth="0x1" edc:desc="IPBusy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_IDR" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4003C024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="EMT" edc:nzwidth="0x1" edc:desc="EndMemTransfer"/>
            <edc:SFRFieldDef edc:cname="MTE" edc:nzwidth="0x1" edc:desc="MemTransferErr"/>
            <edc:SFRFieldDef edc:cname="ERX" edc:nzwidth="0x1" edc:desc="End reception"/>
            <edc:SFRFieldDef edc:cname="ETX" edc:nzwidth="0x1" edc:desc="EndTransmission"/>
            <edc:SFRFieldDef edc:cname="ETRANS" edc:nzwidth="0x2" edc:desc="EndTransfer"/>
            <edc:SFRFieldDef edc:cname="TE" edc:nzwidth="0x1" edc:desc="TransErr"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="TransCodingErr"/>
            <edc:SFRFieldDef edc:cname="TPE" edc:nzwidth="0x1" edc:desc="TransParityErr"/>
            <edc:SFRFieldDef edc:cname="TDE" edc:nzwidth="0x1" edc:desc="TransDataTypeErr"/>
            <edc:SFRFieldDef edc:cname="TTE" edc:nzwidth="0x1" edc:desc="TransTimeOutErr"/>
            <edc:SFRFieldDef edc:cname="TWE" edc:nzwidth="0x1" edc:desc="TransWordCounterErr"/>
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="BufIFErr"/>
            <edc:SFRFieldDef edc:cname="ITR" edc:nzwidth="0x1" edc:desc="IllegalTransferReq"/>
            <edc:SFRFieldDef edc:cname="TVR" edc:nzwidth="0x1" edc:desc="TransVecWordReq"/>
            <edc:SFRFieldDef edc:cname="DBR" edc:nzwidth="0x1" edc:desc="DynamicBusContReq"/>
            <edc:SFRFieldDef edc:cname="STR" edc:nzwidth="0x1" edc:desc="InitSelfTestReq"/>
            <edc:SFRFieldDef edc:cname="TSR" edc:nzwidth="0x1" edc:desc="TranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x1" edc:desc="OvTranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="SDR" edc:nzwidth="0x1" edc:desc="SyncWithDataReq"/>
            <edc:SFRFieldDef edc:cname="SWD" edc:nzwidth="0x1" edc:desc="SyncWithoutDataReq"/>
            <edc:SFRFieldDef edc:cname="RRT" edc:nzwidth="0x1" edc:desc="ResetRTReq"/>
            <edc:SFRFieldDef edc:cname="ITF" edc:nzwidth="0x1" edc:desc="InhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="OTF" edc:nzwidth="0x1" edc:desc="OvInhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="IPB" edc:nzwidth="0x1" edc:desc="IPBusy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_IMR" edc:nzwidth="0x20" edc:access="-------rrrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x1FFFFFF" edc:_addr="0x4003C028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="EMT" edc:nzwidth="0x1" edc:desc="EndMemTransfer"/>
            <edc:SFRFieldDef edc:cname="MTE" edc:nzwidth="0x1" edc:desc="MemTransferErr"/>
            <edc:SFRFieldDef edc:cname="ERX" edc:nzwidth="0x1" edc:desc="End reception"/>
            <edc:SFRFieldDef edc:cname="ETX" edc:nzwidth="0x1" edc:desc="EndTransmission"/>
            <edc:SFRFieldDef edc:cname="ETRANS" edc:nzwidth="0x2" edc:desc="EndTransfer"/>
            <edc:SFRFieldDef edc:cname="TE" edc:nzwidth="0x1" edc:desc="TransErr"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="TransCodingErr"/>
            <edc:SFRFieldDef edc:cname="TPE" edc:nzwidth="0x1" edc:desc="TransParityErr"/>
            <edc:SFRFieldDef edc:cname="TDE" edc:nzwidth="0x1" edc:desc="TransDataTypeErr"/>
            <edc:SFRFieldDef edc:cname="TTE" edc:nzwidth="0x1" edc:desc="TransTimeOutErr"/>
            <edc:SFRFieldDef edc:cname="TWE" edc:nzwidth="0x1" edc:desc="TransWordCounterErr"/>
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="BufIFErr"/>
            <edc:SFRFieldDef edc:cname="ITR" edc:nzwidth="0x1" edc:desc="IllegalTransferReq"/>
            <edc:SFRFieldDef edc:cname="TVR" edc:nzwidth="0x1" edc:desc="TransVecWordReq"/>
            <edc:SFRFieldDef edc:cname="DBR" edc:nzwidth="0x1" edc:desc="DynamicBusContReq"/>
            <edc:SFRFieldDef edc:cname="STR" edc:nzwidth="0x1" edc:desc="InitSelfTestReq"/>
            <edc:SFRFieldDef edc:cname="TSR" edc:nzwidth="0x1" edc:desc="TranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x1" edc:desc="OvTranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="SDR" edc:nzwidth="0x1" edc:desc="SyncWithDataReq"/>
            <edc:SFRFieldDef edc:cname="SWD" edc:nzwidth="0x1" edc:desc="SyncWithoutDataReq"/>
            <edc:SFRFieldDef edc:cname="RRT" edc:nzwidth="0x1" edc:desc="ResetRTReq"/>
            <edc:SFRFieldDef edc:cname="ITF" edc:nzwidth="0x1" edc:desc="InhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="OTF" edc:nzwidth="0x1" edc:desc="OvInhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="IPB" edc:nzwidth="0x1" edc:desc="IPBusy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_ISR" edc:nzwidth="0x20" edc:access="------rrrrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x3FFFFFF" edc:_addr="0x4003C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="EMT" edc:nzwidth="0x1" edc:desc="EndMemTransfer"/>
            <edc:SFRFieldDef edc:cname="MTE" edc:nzwidth="0x1" edc:desc="MemTransferErr"/>
            <edc:SFRFieldDef edc:cname="ERX" edc:nzwidth="0x1" edc:desc="End reception"/>
            <edc:SFRFieldDef edc:cname="ETX" edc:nzwidth="0x1" edc:desc="EndTransmission"/>
            <edc:SFRFieldDef edc:cname="ETRANS" edc:nzwidth="0x2" edc:desc="EndTransfer"/>
            <edc:SFRFieldDef edc:cname="TE" edc:nzwidth="0x1" edc:desc="TransErr"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="TransCodingErr"/>
            <edc:SFRFieldDef edc:cname="TPE" edc:nzwidth="0x1" edc:desc="TransParityErr"/>
            <edc:SFRFieldDef edc:cname="TDE" edc:nzwidth="0x1" edc:desc="TransDataTypeErr"/>
            <edc:SFRFieldDef edc:cname="TTE" edc:nzwidth="0x1" edc:desc="TransTimeOutErr"/>
            <edc:SFRFieldDef edc:cname="TWE" edc:nzwidth="0x1" edc:desc="TransWordCounterErr"/>
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="BufIFErr"/>
            <edc:SFRFieldDef edc:cname="ITR" edc:nzwidth="0x1" edc:desc="IllegalTransferReq"/>
            <edc:SFRFieldDef edc:cname="TVR" edc:nzwidth="0x1" edc:desc="TransVecWordReq"/>
            <edc:SFRFieldDef edc:cname="DBR" edc:nzwidth="0x1" edc:desc="DynamicBusContReq"/>
            <edc:SFRFieldDef edc:cname="STR" edc:nzwidth="0x1" edc:desc="InitSelfTestReq"/>
            <edc:SFRFieldDef edc:cname="TSR" edc:nzwidth="0x1" edc:desc="TranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x1" edc:desc="OvTranShutdownReq"/>
            <edc:SFRFieldDef edc:cname="SDR" edc:nzwidth="0x1" edc:desc="SyncWithDataReq"/>
            <edc:SFRFieldDef edc:cname="SWD" edc:nzwidth="0x1" edc:desc="SyncWithoutDataReq"/>
            <edc:SFRFieldDef edc:cname="RRT" edc:nzwidth="0x1" edc:desc="ResetRTReq"/>
            <edc:SFRFieldDef edc:cname="ITF" edc:nzwidth="0x1" edc:desc="InhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="OTF" edc:nzwidth="0x1" edc:desc="OvInhibitTermFlagReq"/>
            <edc:SFRFieldDef edc:cname="IPB" edc:nzwidth="0x1" edc:desc="IPBusy"/>
            <edc:SFRFieldDef edc:cname="BUS" edc:nzwidth="0x1" edc:desc="BUS activated on last transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CTRL1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4003C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="IP1553DATA1" edc:nzwidth="0x10" edc:desc="IP1553 data value 1"/>
            <edc:SFRFieldDef edc:cname="IP1553DATA2" edc:nzwidth="0x10" edc:desc="IP1553 data value 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
