Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CTRL2" edc:nzwidth="0x20" edc:access="------------rrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFF" edc:_addr="0x4003C034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="FROMCOMMANDREG" edc:nzwidth="0x4" edc:desc="from command register"/>
            <edc:SFRFieldDef edc:cname="FROMVECTORWORD" edc:nzwidth="0x10" edc:desc="from vector register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_CTRL3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4003C038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="FROMSTATUSWORD" edc:nzwidth="0x10" edc:desc="content of status word register"/>
            <edc:SFRFieldDef edc:cname="FROMBITWORD" edc:nzwidth="0x10" edc:desc="content of bit word register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_ARW" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C03C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="REG_ADDR_APB_W" edc:nzwidth="0x20" edc:desc="TX base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_ARR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="REG_ADDR_APB_R" edc:nzwidth="0x20" edc:desc="RX base address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_RXBSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="RE0" edc:nzwidth="0x1" edc:desc="Receive Buffer, 0 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE1" edc:nzwidth="0x1" edc:desc="Receive Buffer, 1 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE2" edc:nzwidth="0x1" edc:desc="Receive Buffer, 2 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE3" edc:nzwidth="0x1" edc:desc="Receive Buffer, 3 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE4" edc:nzwidth="0x1" edc:desc="Receive Buffer, 4 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE5" edc:nzwidth="0x1" edc:desc="Receive Buffer, 5 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE6" edc:nzwidth="0x1" edc:desc="Receive Buffer, 6 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE7" edc:nzwidth="0x1" edc:desc="Receive Buffer, 7 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE8" edc:nzwidth="0x1" edc:desc="Receive Buffer, 8 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE9" edc:nzwidth="0x1" edc:desc="Receive Buffer, 9 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE10" edc:nzwidth="0x1" edc:desc="Receive Buffer, 10 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE11" edc:nzwidth="0x1" edc:desc="Receive Buffer, 11 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE12" edc:nzwidth="0x1" edc:desc="Receive Buffer, 12 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE13" edc:nzwidth="0x1" edc:desc="Receive Buffer, 13 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE14" edc:nzwidth="0x1" edc:desc="Receive Buffer, 14 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE15" edc:nzwidth="0x1" edc:desc="Receive Buffer, 15 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE16" edc:nzwidth="0x1" edc:desc="Receive Buffer, 16 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE17" edc:nzwidth="0x1" edc:desc="Receive Buffer, 17 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE18" edc:nzwidth="0x1" edc:desc="Receive Buffer, 18 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE19" edc:nzwidth="0x1" edc:desc="Receive Buffer, 19 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE20" edc:nzwidth="0x1" edc:desc="Receive Buffer, 20 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE21" edc:nzwidth="0x1" edc:desc="Receive Buffer, 21 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE22" edc:nzwidth="0x1" edc:desc="Receive Buffer, 22 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE23" edc:nzwidth="0x1" edc:desc="Receive Buffer, 23 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE24" edc:nzwidth="0x1" edc:desc="Receive Buffer, 24 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE25" edc:nzwidth="0x1" edc:desc="Receive Buffer, 25 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE26" edc:nzwidth="0x1" edc:desc="Receive Buffer, 26 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE27" edc:nzwidth="0x1" edc:desc="Receive Buffer, 27 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE28" edc:nzwidth="0x1" edc:desc="Receive Buffer, 28 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE29" edc:nzwidth="0x1" edc:desc="Receive Buffer, 29 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE30" edc:nzwidth="0x1" edc:desc="Receive Buffer, 30 with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RE31" edc:nzwidth="0x1" edc:desc="Receive Buffer, 31 with x=[0-31]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_RXBAER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="RER0" edc:nzwidth="0x1" edc:desc="Receive error 0, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER1" edc:nzwidth="0x1" edc:desc="Receive error 1, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER2" edc:nzwidth="0x1" edc:desc="Receive error 2, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER3" edc:nzwidth="0x1" edc:desc="Receive error 3, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER4" edc:nzwidth="0x1" edc:desc="Receive error 4, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER5" edc:nzwidth="0x1" edc:desc="Receive error 5, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER6" edc:nzwidth="0x1" edc:desc="Receive error 6, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER7" edc:nzwidth="0x1" edc:desc="Receive error 7, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER8" edc:nzwidth="0x1" edc:desc="Receive error 8, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER9" edc:nzwidth="0x1" edc:desc="Receive error 9, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER10" edc:nzwidth="0x1" edc:desc="Receive error 10, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER11" edc:nzwidth="0x1" edc:desc="Receive error 11, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER12" edc:nzwidth="0x1" edc:desc="Receive error 12, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER13" edc:nzwidth="0x1" edc:desc="Receive error 13, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER14" edc:nzwidth="0x1" edc:desc="Receive error 14, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER15" edc:nzwidth="0x1" edc:desc="Receive error 15, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER16" edc:nzwidth="0x1" edc:desc="Receive error 16, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER17" edc:nzwidth="0x1" edc:desc="Receive error 17, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER18" edc:nzwidth="0x1" edc:desc="Receive error 18, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER19" edc:nzwidth="0x1" edc:desc="Receive error 19, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER20" edc:nzwidth="0x1" edc:desc="Receive error 20, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER21" edc:nzwidth="0x1" edc:desc="Receive error 21, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER22" edc:nzwidth="0x1" edc:desc="Receive error 22, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER23" edc:nzwidth="0x1" edc:desc="Receive error 23, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER24" edc:nzwidth="0x1" edc:desc="Receive error 24, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER25" edc:nzwidth="0x1" edc:desc="Receive error 25, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER26" edc:nzwidth="0x1" edc:desc="Receive error 26, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER27" edc:nzwidth="0x1" edc:desc="Receive error 27, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER28" edc:nzwidth="0x1" edc:desc="Receive error 28, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER29" edc:nzwidth="0x1" edc:desc="Receive error 29, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER30" edc:nzwidth="0x1" edc:desc="Receive error 30, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="RER31" edc:nzwidth="0x1" edc:desc="Receive error 31, x with x=[0-31]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_TXBSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C04C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="TF0" edc:nzwidth="0x1" edc:desc="Transmit buffer 0, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF1" edc:nzwidth="0x1" edc:desc="Transmit buffer 1, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF2" edc:nzwidth="0x1" edc:desc="Transmit buffer 2, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF3" edc:nzwidth="0x1" edc:desc="Transmit buffer 3, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF4" edc:nzwidth="0x1" edc:desc="Transmit buffer 4, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF5" edc:nzwidth="0x1" edc:desc="Transmit buffer 5, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF6" edc:nzwidth="0x1" edc:desc="Transmit buffer 6, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF7" edc:nzwidth="0x1" edc:desc="Transmit buffer 7, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF8" edc:nzwidth="0x1" edc:desc="Transmit buffer 8, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF9" edc:nzwidth="0x1" edc:desc="Transmit buffer 9, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF10" edc:nzwidth="0x1" edc:desc="Transmit buffer 10, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF11" edc:nzwidth="0x1" edc:desc="Transmit buffer 11, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF12" edc:nzwidth="0x1" edc:desc="Transmit buffer 12, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF13" edc:nzwidth="0x1" edc:desc="Transmit buffer 13, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF14" edc:nzwidth="0x1" edc:desc="Transmit buffer 14, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF15" edc:nzwidth="0x1" edc:desc="Transmit buffer 15, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF16" edc:nzwidth="0x1" edc:desc="Transmit buffer 16, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF17" edc:nzwidth="0x1" edc:desc="Transmit buffer 17, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF18" edc:nzwidth="0x1" edc:desc="Transmit buffer 18, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF19" edc:nzwidth="0x1" edc:desc="Transmit buffer 19, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF20" edc:nzwidth="0x1" edc:desc="Transmit buffer 20, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF21" edc:nzwidth="0x1" edc:desc="Transmit buffer 21, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF22" edc:nzwidth="0x1" edc:desc="Transmit buffer 22, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF23" edc:nzwidth="0x1" edc:desc="Transmit buffer 23, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF24" edc:nzwidth="0x1" edc:desc="Transmit buffer 24, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF25" edc:nzwidth="0x1" edc:desc="Transmit buffer 25, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF26" edc:nzwidth="0x1" edc:desc="Transmit buffer 26, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF27" edc:nzwidth="0x1" edc:desc="Transmit buffer 27, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF28" edc:nzwidth="0x1" edc:desc="Transmit buffer 28, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF29" edc:nzwidth="0x1" edc:desc="Transmit buffer 29, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF30" edc:nzwidth="0x1" edc:desc="Transmit buffer 30, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TF31" edc:nzwidth="0x1" edc:desc="Transmit buffer 31, x with x=[0-31]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="IP1553" edc:cname="IP1553_TXBAER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003C050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="IP1553">
            <edc:SFRFieldDef edc:cname="TER0" edc:nzwidth="0x1" edc:desc="Transmit error 0, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER1" edc:nzwidth="0x1" edc:desc="Transmit error 1, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER2" edc:nzwidth="0x1" edc:desc="Transmit error 2, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER3" edc:nzwidth="0x1" edc:desc="Transmit error 3, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER4" edc:nzwidth="0x1" edc:desc="Transmit error 4, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER5" edc:nzwidth="0x1" edc:desc="Transmit error 5, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER6" edc:nzwidth="0x1" edc:desc="Transmit error 6, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER7" edc:nzwidth="0x1" edc:desc="Transmit error 7, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER8" edc:nzwidth="0x1" edc:desc="Transmit error 8, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER9" edc:nzwidth="0x1" edc:desc="Transmit error 9, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER10" edc:nzwidth="0x1" edc:desc="Transmit error 10, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER11" edc:nzwidth="0x1" edc:desc="Transmit error 11, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER12" edc:nzwidth="0x1" edc:desc="Transmit error 12, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER13" edc:nzwidth="0x1" edc:desc="Transmit error 13, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER14" edc:nzwidth="0x1" edc:desc="Transmit error 14, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER15" edc:nzwidth="0x1" edc:desc="Transmit error 15, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER16" edc:nzwidth="0x1" edc:desc="Transmit error 16, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER17" edc:nzwidth="0x1" edc:desc="Transmit error 17, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER18" edc:nzwidth="0x1" edc:desc="Transmit error 18, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER19" edc:nzwidth="0x1" edc:desc="Transmit error 19, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER20" edc:nzwidth="0x1" edc:desc="Transmit error 20, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER21" edc:nzwidth="0x1" edc:desc="Transmit error 21, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER22" edc:nzwidth="0x1" edc:desc="Transmit error 22, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER23" edc:nzwidth="0x1" edc:desc="Transmit error 23, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER24" edc:nzwidth="0x1" edc:desc="Transmit error 24, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER25" edc:nzwidth="0x1" edc:desc="Transmit error 25, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER26" edc:nzwidth="0x1" edc:desc="Transmit error 26, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER27" edc:nzwidth="0x1" edc:desc="Transmit error 27, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER28" edc:nzwidth="0x1" edc:desc="Transmit error 28, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER29" edc:nzwidth="0x1" edc:desc="Transmit error 29, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER30" edc:nzwidth="0x1" edc:desc="Transmit error 30, x with x=[0-31]"/>
            <edc:SFRFieldDef edc:cname="TER31" edc:nzwidth="0x1" edc:desc="Transmit error 31, x with x=[0-31]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FAC" edc:_addr="0x4003C054"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_STS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr---rrrrr---rrrrr" edc:impl="0xFFFF1F1F" edc:_addr="0x40040000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEST" edc:nzwidth="0x5" edc:desc="Destination addr"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SOURCE" edc:nzwidth="0x5" edc:desc="Source address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BYTE" edc:nzwidth="0x8" edc:desc="Router byte"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x8" edc:desc="Packet Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_CFG" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x40040004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LAENA" edc:nzwidth="0x1" edc:desc="LA Routing Enable"/>
            <edc:SFRFieldDef edc:cname="FALLBACK" edc:nzwidth="0x1" edc:desc="Fallback Routing"/>
            <edc:SFRFieldDef edc:cname="DISTIMEOUT" edc:nzwidth="0x1" edc:desc="Disable Timeout"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TIMEOUT" edc:nzwidth="0x20" edc:access="r--------------------------rrrrr" edc:impl="0x8000001F" edc:_addr="0x40040008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Physical Address"/>
            <edc:AdjustPoint edc:offset="0x1A"/>
            <edc:SFRFieldDef edc:cname="LOCKED" edc:nzwidth="0x1" edc:desc="Locked"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x74" edc:_addr="0x4004000C"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE0" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
