Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE71" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x4004019C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE72" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE73" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE74" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE75" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE76" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE77" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE78" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE79" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE80" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE81" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400401C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
