Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE186" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040368">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE187" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x4004036C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE188" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040370">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE189" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040374">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE190" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040378">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE191" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x4004037C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE192" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040380">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE193" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040384">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE194" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040388">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE195" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x4004038C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE196" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x40040390">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
