Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE211" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE212" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE213" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE214" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE215" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE216" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE217" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE218" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE219" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE220" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE221" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE222" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
