Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_ROUTER_TABLE223" edc:nzwidth="0x20" edc:access="-----------------------n---nnnnn" edc:impl="0x11F" edc:_addr="0x400403FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x5" edc:desc="Address"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DELHEAD" edc:nzwidth="0x1" edc:desc="Delete Header Byte"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_PI_RM" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x40040400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40040404"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_PI_R" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x40040408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_PI_RCS" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:impl="0x3FF" edc:_addr="0x4004040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_IM" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:impl="0x3FF" edc:_addr="0x40040410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_PI_C" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x40040414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_IM_S" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x40040418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
