Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_IM_C" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x4004041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_CFG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40040420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="COMMAND" edc:nzwidth="0x2" edc:desc="Command">
              <edc:SFRFieldSemantic edc:cname="LINK_DISABLE" edc:desc="The link proceeds directly to the ErrorReset state when reaching the Run state." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NO_COMMAND" edc:desc="State is not actively changed." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="The Codec will wait in state Ready until the first NULL character is received." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LINK_START" edc:desc="SpaceWire link can proceed to Started state." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_CLKDIV" edc:nzwidth="0x20" edc:access="-----------nnnnn-----------nnnnn" edc:impl="0x1F001F" edc:_addr="0x40040424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TXOPERDIV" edc:nzwidth="0x5" edc:desc="TxOperDiv"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="TXINITDIV" edc:nzwidth="0x5" edc:desc="TxInitDiv"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_STATUS" edc:nzwidth="0x20" edc:access="------rrrrrrrrrr-------rrrrr-rrr" edc:impl="0x3FF01F7" edc:_addr="0x40040428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LINKSTATE" edc:nzwidth="0x3" edc:desc="LinkState">
              <edc:SFRFieldSemantic edc:cname="ERRORRESET" edc:desc="CODEC link state machine in ErrorReset state" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERRORWAIT" edc:desc="CODEC link state machine in ErrorWait state" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="READY" edc:desc="CODEC link state machine in Ready state" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="STARTED" edc:desc="CODEC link state machine in Started state" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CONNECTING" edc:desc="CODEC link state machine in Connecting state" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RUN" edc:desc="CODEC link state machine in Run state" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDEFDIV" edc:nzwidth="0x5" edc:desc="TxDefDiv"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TxEmpty"/>
            <edc:SFRFieldDef edc:cname="GOTNULL" edc:nzwidth="0x1" edc:desc="GotNull"/>
            <edc:SFRFieldDef edc:cname="GOTFCT" edc:nzwidth="0x1" edc:desc="GotFCT"/>
            <edc:SFRFieldDef edc:cname="GOTNCHAR" edc:nzwidth="0x1" edc:desc="GotNChar"/>
            <edc:SFRFieldDef edc:cname="SEEN0" edc:nzwidth="0x1" edc:desc="SEEN0"/>
            <edc:SFRFieldDef edc:cname="SEEN1" edc:nzwidth="0x1" edc:desc="SEEN1"/>
            <edc:SFRFieldDef edc:cname="SEEN2" edc:nzwidth="0x1" edc:desc="SEEN2"/>
            <edc:SFRFieldDef edc:cname="SEEN3" edc:nzwidth="0x1" edc:desc="SEEN3"/>
            <edc:SFRFieldDef edc:cname="SEEN4" edc:nzwidth="0x1" edc:desc="SEEN4"/>
            <edc:SFRFieldDef edc:cname="SEEN5" edc:nzwidth="0x1" edc:desc="SEEN5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_SWRESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004042C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="PATTERN" edc:nzwidth="0x20" edc:desc="Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_ESCCHAREVENT0" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x40040430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x8" edc:desc="Value"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x8" edc:desc="Mask"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Active"/>
            <edc:SFRFieldDef edc:cname="HWEVENT" edc:nzwidth="0x1" edc:desc="HwEvent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
