Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_ESCCHAREVENT1" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x40040434">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x8" edc:desc="Value"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x8" edc:desc="Mask"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Active"/>
            <edc:SFRFieldDef edc:cname="HWEVENT" edc:nzwidth="0x1" edc:desc="HwEvent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_ESCCHARSTS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40040438">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="CHAR1" edc:nzwidth="0x8" edc:desc="Esc Char 1"/>
            <edc:SFRFieldDef edc:cname="CHAR2" edc:nzwidth="0x8" edc:desc="Esc Char 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_TRANSESC" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4004043C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="CHAR" edc:nzwidth="0x8" edc:desc="Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTPI_RM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040440">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTPI_RCM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040444">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTPI_R" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040448">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTPI_RCS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004044C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
