Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTIM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040450">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTPI_C" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40040454">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTIM_S" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40040458">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTINTIM_C" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4004045C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKPI_RM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040460">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKPI_RCM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040464">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
