Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKPI_R" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKPI_RCS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004046C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKIM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKPI_C" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40040474">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKIM_S" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40040478">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK1_DISTACKIM_C" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4004047C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_PI_RM" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x40040480">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
