Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40040484"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_PI_R" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x40040488">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_PI_RCS" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:impl="0x3FF" edc:_addr="0x4004048C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_IM" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:impl="0x3FF" edc:_addr="0x40040490">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_PI_C" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x40040494">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_IM_S" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x40040498">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_IM_C" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x4004049C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISERR" edc:nzwidth="0x1" edc:desc="DisErr"/>
            <edc:SFRFieldDef edc:cname="PARERR" edc:nzwidth="0x1" edc:desc="ParErr"/>
            <edc:SFRFieldDef edc:cname="ESCERR" edc:nzwidth="0x1" edc:desc="ESCErr"/>
            <edc:SFRFieldDef edc:cname="CRERR" edc:nzwidth="0x1" edc:desc="CrErr"/>
            <edc:SFRFieldDef edc:cname="LINKABORT" edc:nzwidth="0x1" edc:desc="LinkAbort"/>
            <edc:SFRFieldDef edc:cname="EEPTRANS" edc:nzwidth="0x1" edc:desc="EEP transmitted"/>
            <edc:SFRFieldDef edc:cname="EEPREC" edc:nzwidth="0x1" edc:desc="EEP received"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT2" edc:nzwidth="0x1" edc:desc="Escape Event 2"/>
            <edc:SFRFieldDef edc:cname="ESCEVENT1" edc:nzwidth="0x1" edc:desc="Escape Event 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_CFG" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x400404A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="COMMAND" edc:nzwidth="0x2" edc:desc="Command">
              <edc:SFRFieldSemantic edc:cname="LINK_DISABLE" edc:desc="The link proceeds directly to the ErrorReset state when reaching the Run state." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NO_COMMAND" edc:desc="State is not actively changed." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="The Codec will wait in state Ready until the first NULL character is received." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="LINK_START" edc:desc="SpaceWire link can proceed to Started state." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_CLKDIV" edc:nzwidth="0x20" edc:access="-----------nnnnn-----------nnnnn" edc:impl="0x1F001F" edc:_addr="0x400404A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TXOPERDIV" edc:nzwidth="0x5" edc:desc="TxOperDiv"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="TXINITDIV" edc:nzwidth="0x5" edc:desc="TxInitDiv"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
