Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_STATUS" edc:nzwidth="0x20" edc:access="------rrrrrrrrrr-------rrrrr-rrr" edc:impl="0x3FF01F7" edc:_addr="0x400404A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LINKSTATE" edc:nzwidth="0x3" edc:desc="LinkState">
              <edc:SFRFieldSemantic edc:cname="ERRORRESET" edc:desc="CODEC link state machine in ErrorReset state" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERRORWAIT" edc:desc="CODEC link state machine in ErrorWait state" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="READY" edc:desc="CODEC link state machine in Ready state" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="STARTED" edc:desc="CODEC link state machine in Started state" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CONNECTING" edc:desc="CODEC link state machine in Connecting state" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RUN" edc:desc="CODEC link state machine in Run state" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDEFDIV" edc:nzwidth="0x5" edc:desc="TxDefDiv"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TxEmpty"/>
            <edc:SFRFieldDef edc:cname="GOTNULL" edc:nzwidth="0x1" edc:desc="GotNull"/>
            <edc:SFRFieldDef edc:cname="GOTFCT" edc:nzwidth="0x1" edc:desc="GotFCT"/>
            <edc:SFRFieldDef edc:cname="GOTNCHAR" edc:nzwidth="0x1" edc:desc="GotNChar"/>
            <edc:SFRFieldDef edc:cname="SEEN0" edc:nzwidth="0x1" edc:desc="SEEN0"/>
            <edc:SFRFieldDef edc:cname="SEEN1" edc:nzwidth="0x1" edc:desc="SEEN1"/>
            <edc:SFRFieldDef edc:cname="SEEN2" edc:nzwidth="0x1" edc:desc="SEEN2"/>
            <edc:SFRFieldDef edc:cname="SEEN3" edc:nzwidth="0x1" edc:desc="SEEN3"/>
            <edc:SFRFieldDef edc:cname="SEEN4" edc:nzwidth="0x1" edc:desc="SEEN4"/>
            <edc:SFRFieldDef edc:cname="SEEN5" edc:nzwidth="0x1" edc:desc="SEEN5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_SWRESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400404AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="PATTERN" edc:nzwidth="0x20" edc:desc="Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_ESCCHAREVENT0" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x400404B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x8" edc:desc="Value"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x8" edc:desc="Mask"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Active"/>
            <edc:SFRFieldDef edc:cname="HWEVENT" edc:nzwidth="0x1" edc:desc="HwEvent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_ESCCHAREVENT1" edc:nzwidth="0x20" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFF" edc:_addr="0x400404B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x8" edc:desc="Value"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x8" edc:desc="Mask"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:nzwidth="0x1" edc:desc="Active"/>
            <edc:SFRFieldDef edc:cname="HWEVENT" edc:nzwidth="0x1" edc:desc="HwEvent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_ESCCHARSTS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x400404B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="CHAR1" edc:nzwidth="0x8" edc:desc="Esc Char 1"/>
            <edc:SFRFieldDef edc:cname="CHAR2" edc:nzwidth="0x8" edc:desc="Esc Char 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_TRANSESC" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x400404BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="CHAR" edc:nzwidth="0x8" edc:desc="Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTINTPI_RM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400404C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTINTPI_RCM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400404C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTINTPI_R" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400404C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="Distributed Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
