Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTACKPI_R" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400404E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTACKPI_RCS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400404EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTACKIM" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400404F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTACKPI_C" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400404F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTACKIM_S" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400404F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_LINK2_DISTACKIM_C" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400404FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DA0" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA1" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA2" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA3" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA4" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA5" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA6" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA7" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA8" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA9" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA10" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA11" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA12" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA13" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA14" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA15" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA16" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA17" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA18" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA19" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA20" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA21" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA22" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA23" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA24" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA25" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA26" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA27" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA28" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA29" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA30" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
            <edc:SFRFieldDef edc:cname="DA31" edc:nzwidth="0x1" edc:desc="Distributed Acknowledge mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
