Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x300" edc:_addr="0x40040500"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_PI_RM" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:impl="0x1F" edc:_addr="0x40040800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40040804"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_PI_R" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:impl="0x1F" edc:_addr="0x40040808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_PI_RCS" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x4004080C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_IM" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x40040810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_PI_C" edc:nzwidth="0x20" edc:access="---------------------------wwwww" edc:impl="0x1F" edc:_addr="0x40040814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_IM_S" edc:nzwidth="0x20" edc:access="---------------------------wwwww" edc:impl="0x1F" edc:_addr="0x40040818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_IM_C" edc:nzwidth="0x20" edc:access="---------------------------wwwww" edc:impl="0x1F" edc:_addr="0x4004081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP seen"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Packet Discard"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_CFG" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40040820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DISCARD" edc:nzwidth="0x1" edc:desc="Discard"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_STATUS" edc:nzwidth="0x20" edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x3FFFFF" edc:_addr="0x40040824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="COUNT" edc:nzwidth="0x10" edc:desc="Packet Count"/>
            <edc:SFRFieldDef edc:cname="PACKET" edc:nzwidth="0x1" edc:desc="Packet"/>
            <edc:SFRFieldDef edc:cname="LOCKED" edc:nzwidth="0x1" edc:desc="Locked"/>
            <edc:SFRFieldDef edc:cname="ARM" edc:nzwidth="0x1" edc:desc="Armed"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Active"/>
            <edc:SFRFieldDef edc:cname="PENDING" edc:nzwidth="0x1" edc:desc="Pending"/>
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivating"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40040828"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_NXTBUFDATAADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_NXTBUFDATALEN" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40040834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x18" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_NXTBUFPKTADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040838">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_NXTBUFCFG" edc:nzwidth="0x20" edc:access="-n-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x41FFFFFF" edc:_addr="0x4004083C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:nzwidth="0x10" edc:desc="Max Count"/>
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Start Value"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x3" edc:desc="Start Mode">
              <edc:SFRFieldSemantic edc:cname="STARTEVENT" edc:desc="Start if any bit in Start Value matches an incoming event" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STARTNOW" edc:desc="Start immediately. Request a deactivation on next packet boundary." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="STARTTCH1" edc:desc="Start if Start Value matches an incoming Time Code from Time Code Handler 1" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="STARTLATER" edc:desc="Start when Current Buffer is deactivated, e.g. by becoming full" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPLIT" edc:nzwidth="0x1" edc:desc="Split Pkt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_CURBUFDATAADDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
