Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_CURBUFDATALEN" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40040844">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x18" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_CURBUFPKTADDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040848">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_CURBUFCFG" edc:nzwidth="0x20" edc:access="nn--------------nnnnnnnnnnnnnnnn" edc:impl="0xC000FFFF" edc:_addr="0x4004084C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="MAXCNT" edc:nzwidth="0x10" edc:desc="Max Count"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="SPLIT" edc:nzwidth="0x1" edc:desc="Split"/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:nzwidth="0x1" edc:desc="Abort"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_PREVBUFDATALEN" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40040850">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x18" edc:desc="Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_PREVBUFSTS" edc:nzwidth="0x20" edc:access="r-----------rrrrrrrrrrrrrrrrrrrr" edc:impl="0x800FFFFF" edc:_addr="0x40040854">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x10" edc:desc="Count"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP seen"/>
            <edc:SFRFieldDef edc:cname="FULLI" edc:nzwidth="0x1" edc:desc="Buffer Info Full"/>
            <edc:SFRFieldDef edc:cname="FULLD" edc:nzwidth="0x1" edc:desc="Buffer Data Full"/>
            <edc:SFRFieldDef edc:cname="DMAERR" edc:nzwidth="0x1" edc:desc="DMA Error"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LOCKED" edc:nzwidth="0x1" edc:desc="Locked"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x40040858"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTRX1_SWRESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004087C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="PATTERN" edc:nzwidth="0x20" edc:desc="Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x380" edc:_addr="0x40040880"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_PI_RM" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x40040C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40040C04"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_PI_R" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x40040C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_PI_RCS" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40040C0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_IM" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40040C10">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_PI_C" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40040C14">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_IM_S" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40040C18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
