Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_IM_C" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40040C1C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivated"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Activated"/>
            <edc:SFRFieldDef edc:cname="EOP" edc:nzwidth="0x1" edc:desc="EOP sent"/>
            <edc:SFRFieldDef edc:cname="EEP" edc:nzwidth="0x1" edc:desc="EEP sent"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_STATUS" edc:nzwidth="0x20" edc:access="-------------nnn------------nnnn" edc:impl="0x7000F" edc:_addr="0x40040C20">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ARM" edc:nzwidth="0x1" edc:desc="Armed"/>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x1" edc:desc="Active"/>
            <edc:SFRFieldDef edc:cname="PENDING" edc:nzwidth="0x1" edc:desc="Pending"/>
            <edc:SFRFieldDef edc:cname="DEACT" edc:nzwidth="0x1" edc:desc="Deactivating"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="PREV" edc:nzwidth="0x3" edc:desc="Previous">
              <edc:SFRFieldSemantic edc:cname="NOINFO" edc:desc="No information. Field not locked." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LASTSENDLISTOK" edc:desc="Last send list fully done" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ABORTEDMEMERR" edc:desc="Aborted due to memory access error." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ABORTEDNEWSD" edc:desc="Aborted by new send list." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="ABORTEDUSERCMD" edc:desc="Aborted by direct user command." edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="ABORTEDTIMEOUT" edc:desc="Aborted by timeout." edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_NXTSENDROUT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040C24">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="BYTE4" edc:nzwidth="0x8" edc:desc="Byte4"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Byte3"/>
            <edc:SFRFieldDef edc:cname="BYTE2" edc:nzwidth="0x8" edc:desc="Byte2"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Byte1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_NXTSENDADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040C28">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_NXTSENDCFG" edc:nzwidth="0x20" edc:access="--n-----nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x20FFFFFF" edc:_addr="0x40040C2C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x10" edc:desc="Length"/>
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Start Value"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x2" edc:desc="Start Mode">
              <edc:SFRFieldSemantic edc:cname="STARTEVENT" edc:desc="Start if any bit in Start Value matches an incoming event" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STARTNOW" edc:desc="Start immediately, if possible" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="STARTTCH1" edc:desc="Start if Start Value matches an incoming Time Code from Time Code Handler 1" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:nzwidth="0x1" edc:desc="Abort"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_CURSENDROUT" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040C30">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="BYTE4" edc:nzwidth="0x8" edc:desc="Byte4"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Byte3"/>
            <edc:SFRFieldDef edc:cname="BYTE2" edc:nzwidth="0x8" edc:desc="Byte2"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Byte1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_CURSENDADDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40040C34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ADDR" edc:nzwidth="0x20" edc:desc="Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_CURSENDCFG" edc:nzwidth="0x20" edc:access="n---------------nnnnnnnnnnnnnnnn" edc:impl="0x8000FFFF" edc:_addr="0x40040C38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LEN" edc:nzwidth="0x10" edc:desc="Length"/>
            <edc:AdjustPoint edc:offset="0xF"/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:nzwidth="0x1" edc:desc="Abort"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
