Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_PKTTX1_SWRESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040C3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="PATTERN" edc:nzwidth="0x20" edc:desc="Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C0" edc:_addr="0x40040C40"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_RMAP1_CFG" edc:nzwidth="0x20" edc:access="---------------nnnnnnnnnnnnnnnnn" edc:impl="0x1FFFF" edc:_addr="0x40040E00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="DESTKEY" edc:nzwidth="0x8" edc:desc="DestKey"/>
            <edc:SFRFieldDef edc:cname="TLA" edc:nzwidth="0x8" edc:desc="Address"/>
            <edc:SFRFieldDef edc:cname="RMAPENA" edc:nzwidth="0x1" edc:desc="RMAP Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_RMAP1_STS_RC" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:impl="0x1FF" edc:_addr="0x40040E04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ERRCODE" edc:nzwidth="0x8" edc:desc="Error Code">
              <edc:SFRFieldSemantic edc:cname="NOERROR" edc:desc="No error detected" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DMAERROR" edc:desc="Error while DMA accessing the internal bus, e.g. illegal address." edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RMAPERROR" edc:desc="Unused RMAP command according to [RMAP]" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DESTKEYERROR" edc:desc="Destination key error" edc:when="(field &amp; 0xFF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DATACRCERROR" edc:desc="Data CRC error" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="EOPERROR" edc:desc="Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header." edc:when="(field &amp; 0xFF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CARGOERROR" edc:desc="Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header." edc:when="(field &amp; 0xFF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EEPERROR" edc:desc="Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header." edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="CMDERROR" edc:desc="Authorisation error: Invalid or unsupported command." edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TLAERROR" edc:desc="Non-matching Target Logical Address." edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="HEADERCRCERROR" edc:desc="Incorrect header CRC." edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="PROTOCOLIDERROR" edc:desc="Protocol Identifier not supported." edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="REPLYADDERROR" edc:desc="Unsupported reply address length" edc:when="(field &amp; 0xFF) == 0x12"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Valid"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_RMAP1_STS" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:impl="0x1FF" edc:_addr="0x40040E08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="ERRCODE" edc:nzwidth="0x8" edc:desc="Error Code">
              <edc:SFRFieldSemantic edc:cname="NOERROR" edc:desc="No error detected" edc:when="(field &amp; 0xFF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DMAERROR" edc:desc="Error while DMA accessing the internal bus, e.g. illegal address." edc:when="(field &amp; 0xFF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RMAPERROR" edc:desc="Unused RMAP command according to [RMAP]" edc:when="(field &amp; 0xFF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DESTKEYERROR" edc:desc="Destination key error" edc:when="(field &amp; 0xFF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DATACRCERROR" edc:desc="Data CRC error" edc:when="(field &amp; 0xFF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="EOPERROR" edc:desc="Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header." edc:when="(field &amp; 0xFF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CARGOERROR" edc:desc="Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header." edc:when="(field &amp; 0xFF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="EEPERROR" edc:desc="Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header." edc:when="(field &amp; 0xFF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="CMDERROR" edc:desc="Authorisation error: Invalid or unsupported command." edc:when="(field &amp; 0xFF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TLAERROR" edc:desc="Non-matching Target Logical Address." edc:when="(field &amp; 0xFF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="HEADERCRCERROR" edc:desc="Incorrect header CRC." edc:when="(field &amp; 0xFF) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="PROTOCOLIDERROR" edc:desc="Protocol Identifier not supported." edc:when="(field &amp; 0xFF) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="REPLYADDERROR" edc:desc="Unsupported reply address length" edc:when="(field &amp; 0xFF) == 0x12"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="VALID" edc:nzwidth="0x1" edc:desc="Valid"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x74" edc:_addr="0x40040E0C"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_PI_RM" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:impl="0x1F" edc:_addr="0x40040E80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
