Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40040E84"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_PI_R" edc:nzwidth="0x20" edc:access="---------------------------rrrrr" edc:impl="0x1F" edc:_addr="0x40040E88">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_PI_RCS" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x40040E8C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_IM" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x40040E90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_PI_C" edc:nzwidth="0x20" edc:access="---------------------------wwwww" edc:impl="0x1F" edc:_addr="0x40040E94">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_IM_S" edc:nzwidth="0x20" edc:access="---------------------------wwwww" edc:impl="0x1F" edc:_addr="0x40040E98">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_IM_C" edc:nzwidth="0x20" edc:access="---------------------------wwwww" edc:impl="0x1F" edc:_addr="0x40040E9C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="TCEVENT" edc:nzwidth="0x1" edc:desc="TcEvent"/>
            <edc:SFRFieldDef edc:cname="TIMECODE" edc:nzwidth="0x1" edc:desc="Time Code"/>
            <edc:SFRFieldDef edc:cname="ANYTIMECODE" edc:nzwidth="0x1" edc:desc="Any Time Code"/>
            <edc:SFRFieldDef edc:cname="LATEWD" edc:nzwidth="0x1" edc:desc="Late Watchdog"/>
            <edc:SFRFieldDef edc:cname="EARLYWD" edc:nzwidth="0x1" edc:desc="Early Watchdog"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_CFGLISTEN" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40040EA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="L1" edc:nzwidth="0x1" edc:desc="Listen link 1"/>
            <edc:SFRFieldDef edc:cname="L2" edc:nzwidth="0x1" edc:desc="Listen link 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_CFGSEND" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40040EA4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="S1" edc:nzwidth="0x1" edc:desc="Send link 1"/>
            <edc:SFRFieldDef edc:cname="S2" edc:nzwidth="0x1" edc:desc="Send link 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_CFG" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x40040EA8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="EVENT" edc:nzwidth="0x6" edc:desc="Event"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_CFGRESTART" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn--nnnnnn" edc:impl="0xFF3F" edc:_addr="0x40040EAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EVENT" edc:nzwidth="0x6" edc:desc="Event"/>
            <edc:SFRFieldDef edc:cname="PPS" edc:nzwidth="0x1" edc:desc="Pps"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:nzwidth="0x1" edc:desc="One Shot"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_CFGTCEVENT" edc:nzwidth="0x20" edc:access="------------------nnnnnn--nnnnnn" edc:impl="0x3F3F" edc:_addr="0x40040EB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x6" edc:desc="Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
