Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_CFGWD" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040EB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="LATE" edc:nzwidth="0x10" edc:desc="Late"/>
            <edc:SFRFieldDef edc:cname="EARLY" edc:nzwidth="0x10" edc:desc="Early"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_LASTTIMECODE" edc:nzwidth="0x20" edc:access="-----------------------n--nnnnnn" edc:impl="0x13F" edc:_addr="0x40040EB8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="VALUE" edc:nzwidth="0x6" edc:desc="Value"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SEND" edc:nzwidth="0x1" edc:desc="Send Now"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_TCH_SWRESET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40040EBC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="PATTERN" edc:nzwidth="0x20" edc:desc="Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x40" edc:_addr="0x40040EC0"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_GROUP_IRQSTS1" edc:nzwidth="0x20" edc:access="---------------rr-------r-------" edc:impl="0x18080" edc:_addr="0x40040F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TX1" edc:nzwidth="0x1" edc:desc="Tx 1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RX1" edc:nzwidth="0x1" edc:desc="Rx 1"/>
            <edc:SFRFieldDef edc:cname="TCH" edc:nzwidth="0x1" edc:desc="Time Code Handler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_GROUP_IRQSTS2" edc:nzwidth="0x20" edc:access="--------rrrrrr------------------" edc:impl="0xFC0000" edc:_addr="0x40040F04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="Link2" edc:nzwidth="0x1" edc:desc="Link 2"/>
            <edc:SFRFieldDef edc:cname="Dia2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt Acknowledge, Link 2"/>
            <edc:SFRFieldDef edc:cname="Di2" edc:nzwidth="0x1" edc:desc="Distributed Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="Link1" edc:nzwidth="0x1" edc:desc="Link 1"/>
            <edc:SFRFieldDef edc:cname="Dia1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt Acknowledge, Link 1"/>
            <edc:SFRFieldDef edc:cname="Di1" edc:nzwidth="0x1" edc:desc="Distributed Interrupt 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40040F08"/>
      <edc:SFRDef ltx:memberofperipheral="SPW" edc:cname="SPW_GROUP_EDACSTS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40040F0C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPW">
            <edc:SFRFieldDef edc:cname="CORR" edc:nzwidth="0x8" edc:desc="Correction Count"/>
            <edc:SFRFieldDef edc:cname="UNCORR" edc:nzwidth="0x8" edc:desc="Uncorrectable Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x170F0" edc:_addr="0x40040F10"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_CREL" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40058000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x8" edc:desc="Timestamp Day"/>
            <edc:SFRFieldDef edc:cname="MON" edc:nzwidth="0x8" edc:desc="Timestamp Month"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x4" edc:desc="Timestamp Year"/>
            <edc:SFRFieldDef edc:cname="SUBSTEP" edc:nzwidth="0x4" edc:desc="Sub-step of Core Release"/>
            <edc:SFRFieldDef edc:cname="STEP" edc:nzwidth="0x4" edc:desc="Step of Core Release"/>
            <edc:SFRFieldDef edc:cname="REL" edc:nzwidth="0x4" edc:desc="Core Release"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_ENDN" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40058004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ETV" edc:nzwidth="0x20" edc:desc="Endianness Test Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_CUST" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40058008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="CSV" edc:nzwidth="0x20" edc:desc="Customer-specific Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_DBTP" edc:nzwidth="0x20" edc:access="--------n--nnnnn---nnnnnnnnn-nnn" edc:impl="0x9F1FF7" edc:_addr="0x4005800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="DSJW" edc:nzwidth="0x3" edc:desc="Data (Re) Synchronization Jump Width"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DTSEG2" edc:nzwidth="0x4" edc:desc="Data Time Segment After Sample Point"/>
            <edc:SFRFieldDef edc:cname="DTSEG1" edc:nzwidth="0x5" edc:desc="Data Time Segment Before Sample Point"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DBRP" edc:nzwidth="0x5" edc:desc="Data Bit Rate Prescaler"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TDC" edc:nzwidth="0x1" edc:desc="Transmitter Delay Compensation">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Transmitter Delay Compensation disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Transmitter Delay Compensation enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
