Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TEST" edc:nzwidth="0x20" edc:access="------------------------nnnn----" edc:impl="0xF0" edc:_addr="0x40058010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LBCK" edc:nzwidth="0x1" edc:desc="Loop Back Mode (read/write)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Reset value. Loop Back mode is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Loop Back mode is enabled (see Section 1.5.1.9)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TX" edc:nzwidth="0x2" edc:desc="Control of Transmit Pin (read/write)">
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAMPLE_POINT_MONITORING" edc:desc="Sample Point can be monitored at pin CANTX." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DOMINANT" edc:desc="Dominant ('0') level at pin CANTX." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RECESSIVE" edc:desc="Recessive ('1') at pin CANTX." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RX" edc:nzwidth="0x1" edc:desc="Receive Pin (read-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_RWD" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40058014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="WDC" edc:nzwidth="0x8" edc:desc="Watchdog Configuration (read/write)"/>
            <edc:SFRFieldDef edc:cname="WDV" edc:nzwidth="0x8" edc:desc="Watchdog Value (read-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_CCCR" edc:nzwidth="0x20" edc:access="----------------nnnn--nnnnnnnnnn" edc:impl="0xF3FF" edc:_addr="0x40058018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="INIT" edc:nzwidth="0x1" edc:desc="Initialization (read/write)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Normal operation." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Initialization is started." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CCE" edc:nzwidth="0x1" edc:desc="Configuration Change Enable (read/write, write protection)">
              <edc:SFRFieldSemantic edc:cname="PROTECTED" edc:desc="The processor has no write access to the protected configuration registers." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CONFIGURABLE" edc:desc="The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1')." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASM" edc:nzwidth="0x1" edc:desc="Restricted Operation Mode (read/write, write protection against '1')">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal CAN operation." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RESTRICTED" edc:desc="Restricted Operation mode active." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSA" edc:nzwidth="0x1" edc:desc="Clock Stop Acknowledge (read-only)"/>
            <edc:SFRFieldDef edc:cname="CSR" edc:nzwidth="0x1" edc:desc="Clock Stop Request (read/write)">
              <edc:SFRFieldSemantic edc:cname="NO_CLOCK_STOP" edc:desc="No clock stop is requested." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CLOCK_STOP" edc:desc="Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MON" edc:nzwidth="0x1" edc:desc="Bus Monitoring Mode (read/write, write protection against '1')">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Bus Monitoring mode is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Bus Monitoring mode is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAR" edc:nzwidth="0x1" edc:desc="Disable Automatic Retransmission (read/write, write protection)">
              <edc:SFRFieldSemantic edc:cname="AUTO_RETX" edc:desc="Automatic retransmission of messages not transmitted successfully enabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NO_AUTO_RETX" edc:desc="Automatic retransmission disabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TEST" edc:nzwidth="0x1" edc:desc="Test Mode Enable (read/write, write protection against '1')">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Normal operation, MCAN_TEST register holds reset values." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Test mode, write access to MCAN_TEST register enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FDOE" edc:nzwidth="0x1" edc:desc="CAN FD Operation Enable (read/write, write protection)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="FD operation disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="FD operation enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRSE" edc:nzwidth="0x1" edc:desc="Bit Rate Switching Enable (read/write, write protection)">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Bit rate switching for transmissions disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Bit rate switching for transmissions enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PXHD" edc:nzwidth="0x1" edc:desc="Protocol Exception Event Handling (read/write, write protection)"/>
            <edc:SFRFieldDef edc:cname="EFBI" edc:nzwidth="0x1" edc:desc="Edge Filtering during Bus Integration (read/write, write protection)"/>
            <edc:SFRFieldDef edc:cname="TXP" edc:nzwidth="0x1" edc:desc="Transmit Pause (read/write, write protection)"/>
            <edc:SFRFieldDef edc:cname="NISO" edc:nzwidth="0x1" edc:desc="Non-ISO Operation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_NBTP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:impl="0xFFFFFF7F" edc:_addr="0x4005801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="NTSEG2" edc:nzwidth="0x7" edc:desc="Nominal Time Segment After Sample Point"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NTSEG1" edc:nzwidth="0x8" edc:desc="Nominal Time Segment Before Sample Point"/>
            <edc:SFRFieldDef edc:cname="NBRP" edc:nzwidth="0x9" edc:desc="Nominal Bit Rate Prescaler"/>
            <edc:SFRFieldDef edc:cname="NSJW" edc:nzwidth="0x7" edc:desc="Nominal (Re) Synchronization Jump Width"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TSCC" edc:nzwidth="0x20" edc:access="------------nnnn--------------nn" edc:impl="0xF0003" edc:_addr="0x40058020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TSS" edc:nzwidth="0x2" edc:desc="Timestamp Select">
              <edc:SFRFieldSemantic edc:cname="ALWAYS_0" edc:desc="Timestamp counter value always 0x0000" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TCP_INC" edc:desc="Timestamp counter value incremented according to TCP" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="EXT_TIMESTAMP" edc:desc="External timestamp counter value used" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="TCP" edc:nzwidth="0x4" edc:desc="Timestamp Counter Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TSCV" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40058024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TSC" edc:nzwidth="0x10" edc:desc="Timestamp Counter (cleared on write)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TOCC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn-------------nnn" edc:impl="0xFFFF0007" edc:_addr="0x40058028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ETOC" edc:nzwidth="0x1" edc:desc="Enable Timeout Counter">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEOUT" edc:desc="Timeout Counter disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TOS_CONTROLLED" edc:desc="Timeout Counter enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TOS" edc:nzwidth="0x2" edc:desc="Timeout Select">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous operation" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TX_EV_TIMEOUT" edc:desc="Timeout controlled by Tx Event FIFO" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RX0_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 0" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RX1_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 1" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="TOP" edc:nzwidth="0x10" edc:desc="Timeout Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TOCV" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4005802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TOC" edc:nzwidth="0x10" edc:desc="Timeout Counter (cleared on write)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40058030"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_ECR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40058040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TEC" edc:nzwidth="0x8" edc:desc="Transmit Error Counter"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x7" edc:desc="Receive Error Counter"/>
            <edc:SFRFieldDef edc:cname="RP" edc:nzwidth="0x1" edc:desc="Receive Error Passive"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:nzwidth="0x8" edc:desc="CAN Error Logging (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_PSR" edc:nzwidth="0x20" edc:access="---------rrrrrrr-rrrrrrrrrrrrrrr" edc:impl="0x7F7FFF" edc:_addr="0x40058044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="LEC" edc:nzwidth="0x3" edc:desc="Last Error Code (set to 111 on read)">
              <edc:SFRFieldSemantic edc:cname="NO_ERROR" edc:desc="No error occurred since LEC has been reset by successful reception or transmission." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="STUFF_ERROR" edc:desc="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FORM_ERROR" edc:desc="A fixed format part of a received frame has the wrong format." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ACK_ERROR" edc:desc="The message transmitted by the MCAN was not acknowledged by another node." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="BIT1_ERROR" edc:desc="During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="BIT0_ERROR" edc:desc="During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="CRC_ERROR" edc:desc="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data." edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="NO_CHANGE" edc:desc="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x2" edc:desc="Activity">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONIZING" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RECEIVER" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMITTER" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="DLEC" edc:nzwidth="0x3" edc:desc="Data Phase Last Error Code (set to 111 on read)"/>
            <edc:SFRFieldDef edc:cname="RESI" edc:nzwidth="0x1" edc:desc="ESI Flag of Last Received CAN FD Message (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:nzwidth="0x1" edc:desc="BRS Flag of Last Received CAN FD Message (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RFDF" edc:nzwidth="0x1" edc:desc="Received a CAN FD Message (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="PXE" edc:nzwidth="0x1" edc:desc="Protocol Exception Event (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TDCR" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:impl="0x7F7F" edc:_addr="0x40058048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TDCF" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Filter"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4005804C"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_IR" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x40058050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0N" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:nzwidth="0x1" edc:desc="High Priority Message"/>
            <edc:SFRFieldDef edc:cname="TC" edc:nzwidth="0x1" edc:desc="Transmission Completed"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:nzwidth="0x1" edc:desc="Timeout Occurred"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:nzwidth="0x1" edc:desc="Error Logging Overflow"/>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase"/>
            <edc:SFRFieldDef edc:cname="PED" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:nzwidth="0x1" edc:desc="Access to Reserved Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
