Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_IE" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x40058054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Event Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Enable"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Enable"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_ILS" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x40058058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Event Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Line"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Line"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Line"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Line"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
