Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TXBTIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400580E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TIE0" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 0"/>
            <edc:SFRFieldDef edc:cname="TIE1" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 1"/>
            <edc:SFRFieldDef edc:cname="TIE2" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 2"/>
            <edc:SFRFieldDef edc:cname="TIE3" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 3"/>
            <edc:SFRFieldDef edc:cname="TIE4" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 4"/>
            <edc:SFRFieldDef edc:cname="TIE5" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 5"/>
            <edc:SFRFieldDef edc:cname="TIE6" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 6"/>
            <edc:SFRFieldDef edc:cname="TIE7" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 7"/>
            <edc:SFRFieldDef edc:cname="TIE8" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 8"/>
            <edc:SFRFieldDef edc:cname="TIE9" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 9"/>
            <edc:SFRFieldDef edc:cname="TIE10" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 10"/>
            <edc:SFRFieldDef edc:cname="TIE11" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 11"/>
            <edc:SFRFieldDef edc:cname="TIE12" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 12"/>
            <edc:SFRFieldDef edc:cname="TIE13" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 13"/>
            <edc:SFRFieldDef edc:cname="TIE14" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 14"/>
            <edc:SFRFieldDef edc:cname="TIE15" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 15"/>
            <edc:SFRFieldDef edc:cname="TIE16" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 16"/>
            <edc:SFRFieldDef edc:cname="TIE17" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 17"/>
            <edc:SFRFieldDef edc:cname="TIE18" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 18"/>
            <edc:SFRFieldDef edc:cname="TIE19" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 19"/>
            <edc:SFRFieldDef edc:cname="TIE20" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 20"/>
            <edc:SFRFieldDef edc:cname="TIE21" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 21"/>
            <edc:SFRFieldDef edc:cname="TIE22" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 22"/>
            <edc:SFRFieldDef edc:cname="TIE23" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 23"/>
            <edc:SFRFieldDef edc:cname="TIE24" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 24"/>
            <edc:SFRFieldDef edc:cname="TIE25" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 25"/>
            <edc:SFRFieldDef edc:cname="TIE26" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 26"/>
            <edc:SFRFieldDef edc:cname="TIE27" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 27"/>
            <edc:SFRFieldDef edc:cname="TIE28" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 28"/>
            <edc:SFRFieldDef edc:cname="TIE29" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 29"/>
            <edc:SFRFieldDef edc:cname="TIE30" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 30"/>
            <edc:SFRFieldDef edc:cname="TIE31" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TXBCIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400580E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="CFIE0" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 0"/>
            <edc:SFRFieldDef edc:cname="CFIE1" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 1"/>
            <edc:SFRFieldDef edc:cname="CFIE2" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 2"/>
            <edc:SFRFieldDef edc:cname="CFIE3" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 3"/>
            <edc:SFRFieldDef edc:cname="CFIE4" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 4"/>
            <edc:SFRFieldDef edc:cname="CFIE5" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 5"/>
            <edc:SFRFieldDef edc:cname="CFIE6" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 6"/>
            <edc:SFRFieldDef edc:cname="CFIE7" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 7"/>
            <edc:SFRFieldDef edc:cname="CFIE8" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 8"/>
            <edc:SFRFieldDef edc:cname="CFIE9" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 9"/>
            <edc:SFRFieldDef edc:cname="CFIE10" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 10"/>
            <edc:SFRFieldDef edc:cname="CFIE11" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 11"/>
            <edc:SFRFieldDef edc:cname="CFIE12" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 12"/>
            <edc:SFRFieldDef edc:cname="CFIE13" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 13"/>
            <edc:SFRFieldDef edc:cname="CFIE14" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 14"/>
            <edc:SFRFieldDef edc:cname="CFIE15" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 15"/>
            <edc:SFRFieldDef edc:cname="CFIE16" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 16"/>
            <edc:SFRFieldDef edc:cname="CFIE17" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 17"/>
            <edc:SFRFieldDef edc:cname="CFIE18" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 18"/>
            <edc:SFRFieldDef edc:cname="CFIE19" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 19"/>
            <edc:SFRFieldDef edc:cname="CFIE20" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 20"/>
            <edc:SFRFieldDef edc:cname="CFIE21" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 21"/>
            <edc:SFRFieldDef edc:cname="CFIE22" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 22"/>
            <edc:SFRFieldDef edc:cname="CFIE23" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 23"/>
            <edc:SFRFieldDef edc:cname="CFIE24" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 24"/>
            <edc:SFRFieldDef edc:cname="CFIE25" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 25"/>
            <edc:SFRFieldDef edc:cname="CFIE26" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 26"/>
            <edc:SFRFieldDef edc:cname="CFIE27" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 27"/>
            <edc:SFRFieldDef edc:cname="CFIE28" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 28"/>
            <edc:SFRFieldDef edc:cname="CFIE29" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 29"/>
            <edc:SFRFieldDef edc:cname="CFIE30" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 30"/>
            <edc:SFRFieldDef edc:cname="CFIE31" edc:nzwidth="0x1" edc:desc="Cancellation Finished Interrupt Enable for Transmit Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400580E8"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TXEFC" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnnnnnnnnnnnnnnnn--" edc:impl="0x3F3FFFFC" edc:_addr="0x400580F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFSA" edc:nzwidth="0xE" edc:desc="Event FIFO Start Address"/>
            <edc:SFRFieldDef edc:cname="EFS" edc:nzwidth="0x6" edc:desc="Event FIFO Size"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EFWM" edc:nzwidth="0x6" edc:desc="Event FIFO Watermark"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
