Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TDCR" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:impl="0x7F7F" edc:_addr="0x4005C048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="TDCF" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Filter"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4005C04C"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_IR" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x4005C050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RF0N" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:nzwidth="0x1" edc:desc="High Priority Message"/>
            <edc:SFRFieldDef edc:cname="TC" edc:nzwidth="0x1" edc:desc="Transmission Completed"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:nzwidth="0x1" edc:desc="Timeout Occurred"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:nzwidth="0x1" edc:desc="Error Logging Overflow"/>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase"/>
            <edc:SFRFieldDef edc:cname="PED" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:nzwidth="0x1" edc:desc="Access to Reserved Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_IE" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x4005C054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Event Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Enable"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Enable"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
