Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_ILS" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x4005C058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Event Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Line"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Line"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Line"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Line"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_ILE" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x4005C05C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EINT0" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 0"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x4005C060"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_GFC" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x4005C080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RRFE" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Extended">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRFS" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Standard">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFE" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Extended">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Standard">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_SIDFC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFC" edc:_addr="0x4005C084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLSSA" edc:nzwidth="0xE" edc:desc="Filter List Standard Start Address"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:nzwidth="0x8" edc:desc="List Size Standard"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_XIDFC" edc:nzwidth="0x20" edc:access="---------nnnnnnnnnnnnnnnnnnnnn--" edc:impl="0x7FFFFC" edc:_addr="0x4005C088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLESA" edc:nzwidth="0xE" edc:desc="Filter List Extended Start Address"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:nzwidth="0x7" edc:desc="List Size Extended"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4005C08C"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_XIDAM" edc:nzwidth="0x20" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFFF" edc:_addr="0x4005C090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EIDM" edc:nzwidth="0x1D" edc:desc="Extended ID Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
