Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_HPMS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4005C094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="BIDX" edc:nzwidth="0x6" edc:desc="Buffer Index"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:nzwidth="0x2" edc:desc="Message Storage Indicator">
              <edc:SFRFieldSemantic edc:cname="NO_FIFO_SEL" edc:desc="No FIFO selected." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message lost." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_0" edc:desc="Message stored in FIFO 0." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_1" edc:desc="Message stored in FIFO 1." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:nzwidth="0x7" edc:desc="Filter Index"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:nzwidth="0x1" edc:desc="Filter List"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_NDAT1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4005C098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND0" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:nzwidth="0x1" edc:desc="New Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_NDAT2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4005C09C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND32" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:nzwidth="0x1" edc:desc="New Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF0C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFF7FFFFC" edc:_addr="0x4005C0A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0SA" edc:nzwidth="0xE" edc:desc="Receive FIFO 0 Start Address"/>
            <edc:SFRFieldDef edc:cname="F0S" edc:nzwidth="0x7" edc:desc="Receive FIFO 0 Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0WM" edc:nzwidth="0x7" edc:desc="Receive FIFO 0 Watermark"/>
            <edc:SFRFieldDef edc:cname="F0OM" edc:nzwidth="0x1" edc:desc="FIFO 0 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF0S" edc:nzwidth="0x20" edc:access="------rr--rrrrrr--rrrrrr-rrrrrrr" edc:impl="0x33F3F7F" edc:_addr="0x4005C0A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="F0FL" edc:nzwidth="0x7" edc:desc="Receive FIFO 0 Fill Level"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0GI" edc:nzwidth="0x6" edc:desc="Receive FIFO 0 Get Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0PI" edc:nzwidth="0x6" edc:desc="Receive FIFO 0 Put Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0F" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF0A" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x4005C0A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="F0AI" edc:nzwidth="0x6" edc:desc="Receive FIFO 0 Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXBC" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnn--" edc:impl="0xFFFC" edc:_addr="0x4005C0AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RBSA" edc:nzwidth="0xE" edc:desc="Receive Buffer Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF1C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFF7FFFFC" edc:_addr="0x4005C0B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F1SA" edc:nzwidth="0xE" edc:desc="Receive FIFO 1 Start Address"/>
            <edc:SFRFieldDef edc:cname="F1S" edc:nzwidth="0x7" edc:desc="Receive FIFO 1 Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F1WM" edc:nzwidth="0x7" edc:desc="Receive FIFO 1 Watermark"/>
            <edc:SFRFieldDef edc:cname="F1OM" edc:nzwidth="0x1" edc:desc="FIFO 1 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
