Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBC" edc:nzwidth="0x20" edc:access="-nnnnnnn--nnnnnnnnnnnnnnnnnnnn--" edc:impl="0x7F3FFFFC" edc:_addr="0x4005C0C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TBSA" edc:nzwidth="0xE" edc:desc="Tx Buffers Start Address"/>
            <edc:SFRFieldDef edc:cname="NDTB" edc:nzwidth="0x6" edc:desc="Number of Dedicated Transmit Buffers"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFQS" edc:nzwidth="0x6" edc:desc="Transmit FIFO/Queue Size"/>
            <edc:SFRFieldDef edc:cname="TFQM" edc:nzwidth="0x1" edc:desc="Tx FIFO/Queue Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXFQS" edc:nzwidth="0x20" edc:access="----------rrrrrr---rrrrr--rrrrrr" edc:impl="0x3F1F3F" edc:_addr="0x4005C0C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="TFFL" edc:nzwidth="0x6" edc:desc="Tx FIFO Free Level"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TFGI" edc:nzwidth="0x5" edc:desc="Tx FIFO Get Index"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TFQPI" edc:nzwidth="0x5" edc:desc="Tx FIFO/Queue Put Index"/>
            <edc:SFRFieldDef edc:cname="TFQF" edc:nzwidth="0x1" edc:desc="Tx FIFO/Queue Full"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXESC" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x4005C0C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="TBDS" edc:nzwidth="0x3" edc:desc="Tx Buffer Data Field Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8-byte data field" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_12_BYTE" edc:desc="12-byte data field" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16-byte data field" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_20_BYTE" edc:desc="20-byte data field" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_24_BYTE" edc:desc="24-byte data field" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32-byte data field" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="_48_BYTE" edc:desc="48- byte data field" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64-byte data field" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBRP" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4005C0CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="TRP0" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 0"/>
            <edc:SFRFieldDef edc:cname="TRP1" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 1"/>
            <edc:SFRFieldDef edc:cname="TRP2" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 2"/>
            <edc:SFRFieldDef edc:cname="TRP3" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 3"/>
            <edc:SFRFieldDef edc:cname="TRP4" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 4"/>
            <edc:SFRFieldDef edc:cname="TRP5" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 5"/>
            <edc:SFRFieldDef edc:cname="TRP6" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 6"/>
            <edc:SFRFieldDef edc:cname="TRP7" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 7"/>
            <edc:SFRFieldDef edc:cname="TRP8" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 8"/>
            <edc:SFRFieldDef edc:cname="TRP9" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 9"/>
            <edc:SFRFieldDef edc:cname="TRP10" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 10"/>
            <edc:SFRFieldDef edc:cname="TRP11" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 11"/>
            <edc:SFRFieldDef edc:cname="TRP12" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 12"/>
            <edc:SFRFieldDef edc:cname="TRP13" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 13"/>
            <edc:SFRFieldDef edc:cname="TRP14" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 14"/>
            <edc:SFRFieldDef edc:cname="TRP15" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 15"/>
            <edc:SFRFieldDef edc:cname="TRP16" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 16"/>
            <edc:SFRFieldDef edc:cname="TRP17" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 17"/>
            <edc:SFRFieldDef edc:cname="TRP18" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 18"/>
            <edc:SFRFieldDef edc:cname="TRP19" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 19"/>
            <edc:SFRFieldDef edc:cname="TRP20" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 20"/>
            <edc:SFRFieldDef edc:cname="TRP21" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 21"/>
            <edc:SFRFieldDef edc:cname="TRP22" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 22"/>
            <edc:SFRFieldDef edc:cname="TRP23" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 23"/>
            <edc:SFRFieldDef edc:cname="TRP24" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 24"/>
            <edc:SFRFieldDef edc:cname="TRP25" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 25"/>
            <edc:SFRFieldDef edc:cname="TRP26" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 26"/>
            <edc:SFRFieldDef edc:cname="TRP27" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 27"/>
            <edc:SFRFieldDef edc:cname="TRP28" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 28"/>
            <edc:SFRFieldDef edc:cname="TRP29" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 29"/>
            <edc:SFRFieldDef edc:cname="TRP30" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 30"/>
            <edc:SFRFieldDef edc:cname="TRP31" edc:nzwidth="0x1" edc:desc="Transmission Request Pending for Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4005C0D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="AR0" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 0"/>
            <edc:SFRFieldDef edc:cname="AR1" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 1"/>
            <edc:SFRFieldDef edc:cname="AR2" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 2"/>
            <edc:SFRFieldDef edc:cname="AR3" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 3"/>
            <edc:SFRFieldDef edc:cname="AR4" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 4"/>
            <edc:SFRFieldDef edc:cname="AR5" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 5"/>
            <edc:SFRFieldDef edc:cname="AR6" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 6"/>
            <edc:SFRFieldDef edc:cname="AR7" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 7"/>
            <edc:SFRFieldDef edc:cname="AR8" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 8"/>
            <edc:SFRFieldDef edc:cname="AR9" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 9"/>
            <edc:SFRFieldDef edc:cname="AR10" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 10"/>
            <edc:SFRFieldDef edc:cname="AR11" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 11"/>
            <edc:SFRFieldDef edc:cname="AR12" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 12"/>
            <edc:SFRFieldDef edc:cname="AR13" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 13"/>
            <edc:SFRFieldDef edc:cname="AR14" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 14"/>
            <edc:SFRFieldDef edc:cname="AR15" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 15"/>
            <edc:SFRFieldDef edc:cname="AR16" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 16"/>
            <edc:SFRFieldDef edc:cname="AR17" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 17"/>
            <edc:SFRFieldDef edc:cname="AR18" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 18"/>
            <edc:SFRFieldDef edc:cname="AR19" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 19"/>
            <edc:SFRFieldDef edc:cname="AR20" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 20"/>
            <edc:SFRFieldDef edc:cname="AR21" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 21"/>
            <edc:SFRFieldDef edc:cname="AR22" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 22"/>
            <edc:SFRFieldDef edc:cname="AR23" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 23"/>
            <edc:SFRFieldDef edc:cname="AR24" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 24"/>
            <edc:SFRFieldDef edc:cname="AR25" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 25"/>
            <edc:SFRFieldDef edc:cname="AR26" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 26"/>
            <edc:SFRFieldDef edc:cname="AR27" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 27"/>
            <edc:SFRFieldDef edc:cname="AR28" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 28"/>
            <edc:SFRFieldDef edc:cname="AR29" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 29"/>
            <edc:SFRFieldDef edc:cname="AR30" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 30"/>
            <edc:SFRFieldDef edc:cname="AR31" edc:nzwidth="0x1" edc:desc="Add Request for Transmit Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4005C0D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="CR0" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 0"/>
            <edc:SFRFieldDef edc:cname="CR1" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 1"/>
            <edc:SFRFieldDef edc:cname="CR2" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 2"/>
            <edc:SFRFieldDef edc:cname="CR3" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 3"/>
            <edc:SFRFieldDef edc:cname="CR4" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 4"/>
            <edc:SFRFieldDef edc:cname="CR5" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 5"/>
            <edc:SFRFieldDef edc:cname="CR6" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 6"/>
            <edc:SFRFieldDef edc:cname="CR7" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 7"/>
            <edc:SFRFieldDef edc:cname="CR8" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 8"/>
            <edc:SFRFieldDef edc:cname="CR9" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 9"/>
            <edc:SFRFieldDef edc:cname="CR10" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 10"/>
            <edc:SFRFieldDef edc:cname="CR11" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 11"/>
            <edc:SFRFieldDef edc:cname="CR12" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 12"/>
            <edc:SFRFieldDef edc:cname="CR13" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 13"/>
            <edc:SFRFieldDef edc:cname="CR14" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 14"/>
            <edc:SFRFieldDef edc:cname="CR15" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 15"/>
            <edc:SFRFieldDef edc:cname="CR16" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 16"/>
            <edc:SFRFieldDef edc:cname="CR17" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 17"/>
            <edc:SFRFieldDef edc:cname="CR18" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 18"/>
            <edc:SFRFieldDef edc:cname="CR19" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 19"/>
            <edc:SFRFieldDef edc:cname="CR20" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 20"/>
            <edc:SFRFieldDef edc:cname="CR21" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 21"/>
            <edc:SFRFieldDef edc:cname="CR22" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 22"/>
            <edc:SFRFieldDef edc:cname="CR23" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 23"/>
            <edc:SFRFieldDef edc:cname="CR24" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 24"/>
            <edc:SFRFieldDef edc:cname="CR25" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 25"/>
            <edc:SFRFieldDef edc:cname="CR26" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 26"/>
            <edc:SFRFieldDef edc:cname="CR27" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 27"/>
            <edc:SFRFieldDef edc:cname="CR28" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 28"/>
            <edc:SFRFieldDef edc:cname="CR29" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 29"/>
            <edc:SFRFieldDef edc:cname="CR30" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 30"/>
            <edc:SFRFieldDef edc:cname="CR31" edc:nzwidth="0x1" edc:desc="Cancellation Request for Transmit Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
