Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBTO" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4005C0D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="TO0" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 0"/>
            <edc:SFRFieldDef edc:cname="TO1" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 1"/>
            <edc:SFRFieldDef edc:cname="TO2" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 2"/>
            <edc:SFRFieldDef edc:cname="TO3" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 3"/>
            <edc:SFRFieldDef edc:cname="TO4" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 4"/>
            <edc:SFRFieldDef edc:cname="TO5" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 5"/>
            <edc:SFRFieldDef edc:cname="TO6" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 6"/>
            <edc:SFRFieldDef edc:cname="TO7" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 7"/>
            <edc:SFRFieldDef edc:cname="TO8" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 8"/>
            <edc:SFRFieldDef edc:cname="TO9" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 9"/>
            <edc:SFRFieldDef edc:cname="TO10" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 10"/>
            <edc:SFRFieldDef edc:cname="TO11" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 11"/>
            <edc:SFRFieldDef edc:cname="TO12" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 12"/>
            <edc:SFRFieldDef edc:cname="TO13" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 13"/>
            <edc:SFRFieldDef edc:cname="TO14" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 14"/>
            <edc:SFRFieldDef edc:cname="TO15" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 15"/>
            <edc:SFRFieldDef edc:cname="TO16" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 16"/>
            <edc:SFRFieldDef edc:cname="TO17" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 17"/>
            <edc:SFRFieldDef edc:cname="TO18" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 18"/>
            <edc:SFRFieldDef edc:cname="TO19" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 19"/>
            <edc:SFRFieldDef edc:cname="TO20" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 20"/>
            <edc:SFRFieldDef edc:cname="TO21" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 21"/>
            <edc:SFRFieldDef edc:cname="TO22" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 22"/>
            <edc:SFRFieldDef edc:cname="TO23" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 23"/>
            <edc:SFRFieldDef edc:cname="TO24" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 24"/>
            <edc:SFRFieldDef edc:cname="TO25" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 25"/>
            <edc:SFRFieldDef edc:cname="TO26" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 26"/>
            <edc:SFRFieldDef edc:cname="TO27" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 27"/>
            <edc:SFRFieldDef edc:cname="TO28" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 28"/>
            <edc:SFRFieldDef edc:cname="TO29" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 29"/>
            <edc:SFRFieldDef edc:cname="TO30" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 30"/>
            <edc:SFRFieldDef edc:cname="TO31" edc:nzwidth="0x1" edc:desc="Transmission Occurred for Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBCF" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4005C0DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="CF0" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 0"/>
            <edc:SFRFieldDef edc:cname="CF1" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 1"/>
            <edc:SFRFieldDef edc:cname="CF2" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 2"/>
            <edc:SFRFieldDef edc:cname="CF3" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 3"/>
            <edc:SFRFieldDef edc:cname="CF4" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 4"/>
            <edc:SFRFieldDef edc:cname="CF5" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 5"/>
            <edc:SFRFieldDef edc:cname="CF6" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 6"/>
            <edc:SFRFieldDef edc:cname="CF7" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 7"/>
            <edc:SFRFieldDef edc:cname="CF8" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 8"/>
            <edc:SFRFieldDef edc:cname="CF9" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 9"/>
            <edc:SFRFieldDef edc:cname="CF10" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 10"/>
            <edc:SFRFieldDef edc:cname="CF11" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 11"/>
            <edc:SFRFieldDef edc:cname="CF12" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 12"/>
            <edc:SFRFieldDef edc:cname="CF13" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 13"/>
            <edc:SFRFieldDef edc:cname="CF14" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 14"/>
            <edc:SFRFieldDef edc:cname="CF15" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 15"/>
            <edc:SFRFieldDef edc:cname="CF16" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 16"/>
            <edc:SFRFieldDef edc:cname="CF17" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 17"/>
            <edc:SFRFieldDef edc:cname="CF18" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 18"/>
            <edc:SFRFieldDef edc:cname="CF19" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 19"/>
            <edc:SFRFieldDef edc:cname="CF20" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 20"/>
            <edc:SFRFieldDef edc:cname="CF21" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 21"/>
            <edc:SFRFieldDef edc:cname="CF22" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 22"/>
            <edc:SFRFieldDef edc:cname="CF23" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 23"/>
            <edc:SFRFieldDef edc:cname="CF24" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 24"/>
            <edc:SFRFieldDef edc:cname="CF25" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 25"/>
            <edc:SFRFieldDef edc:cname="CF26" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 26"/>
            <edc:SFRFieldDef edc:cname="CF27" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 27"/>
            <edc:SFRFieldDef edc:cname="CF28" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 28"/>
            <edc:SFRFieldDef edc:cname="CF29" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 29"/>
            <edc:SFRFieldDef edc:cname="CF30" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 30"/>
            <edc:SFRFieldDef edc:cname="CF31" edc:nzwidth="0x1" edc:desc="Cancellation Finished for Transmit Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_TXBTIE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4005C0E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="TIE0" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 0"/>
            <edc:SFRFieldDef edc:cname="TIE1" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 1"/>
            <edc:SFRFieldDef edc:cname="TIE2" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 2"/>
            <edc:SFRFieldDef edc:cname="TIE3" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 3"/>
            <edc:SFRFieldDef edc:cname="TIE4" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 4"/>
            <edc:SFRFieldDef edc:cname="TIE5" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 5"/>
            <edc:SFRFieldDef edc:cname="TIE6" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 6"/>
            <edc:SFRFieldDef edc:cname="TIE7" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 7"/>
            <edc:SFRFieldDef edc:cname="TIE8" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 8"/>
            <edc:SFRFieldDef edc:cname="TIE9" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 9"/>
            <edc:SFRFieldDef edc:cname="TIE10" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 10"/>
            <edc:SFRFieldDef edc:cname="TIE11" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 11"/>
            <edc:SFRFieldDef edc:cname="TIE12" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 12"/>
            <edc:SFRFieldDef edc:cname="TIE13" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 13"/>
            <edc:SFRFieldDef edc:cname="TIE14" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 14"/>
            <edc:SFRFieldDef edc:cname="TIE15" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 15"/>
            <edc:SFRFieldDef edc:cname="TIE16" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 16"/>
            <edc:SFRFieldDef edc:cname="TIE17" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 17"/>
            <edc:SFRFieldDef edc:cname="TIE18" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 18"/>
            <edc:SFRFieldDef edc:cname="TIE19" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 19"/>
            <edc:SFRFieldDef edc:cname="TIE20" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 20"/>
            <edc:SFRFieldDef edc:cname="TIE21" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 21"/>
            <edc:SFRFieldDef edc:cname="TIE22" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 22"/>
            <edc:SFRFieldDef edc:cname="TIE23" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 23"/>
            <edc:SFRFieldDef edc:cname="TIE24" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 24"/>
            <edc:SFRFieldDef edc:cname="TIE25" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 25"/>
            <edc:SFRFieldDef edc:cname="TIE26" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 26"/>
            <edc:SFRFieldDef edc:cname="TIE27" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 27"/>
            <edc:SFRFieldDef edc:cname="TIE28" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 28"/>
            <edc:SFRFieldDef edc:cname="TIE29" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 29"/>
            <edc:SFRFieldDef edc:cname="TIE30" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 30"/>
            <edc:SFRFieldDef edc:cname="TIE31" edc:nzwidth="0x1" edc:desc="Transmission Interrupt Enable for Buffer 31"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
