Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_DMAR" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40068024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="DMADUTY" edc:nzwidth="0x18" edc:desc="Duty-Cycle Holding Register for DMA Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCUC" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40068028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="UPDULOCK" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Unlock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCUP" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4006802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="UPR" edc:nzwidth="0x4" edc:desc="Update Period"/>
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:nzwidth="0x4" edc:desc="Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SCUPUPD" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40068030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="UPRUPD" edc:nzwidth="0x4" edc:desc="Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_IER2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:impl="0xFFFF09" edc:_addr="0x40068034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_IDR2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:impl="0xFFFF09" edc:_addr="0x40068038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_IMR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:impl="0xFFFF09" edc:_addr="0x4006803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ISR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:impl="0xFFFF09" edc:_addr="0x40068040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OOV" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x40068044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OOVH0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVH1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVH2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OOVH3" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OOVL0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVL1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVL2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OOVL3" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OS" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x40068048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSH0" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSH1" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSH2" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSH3" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSL0" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSL1" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSL2" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSL3" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSS" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4006804C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSSH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSH3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSL3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSC" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x40068050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSCH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCH3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCL3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSSUPD" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x40068054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSUPH3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSUPL3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
