Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSCUPD" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x40068058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCUPH3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCUPL3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4006805C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPOL" edc:nzwidth="0x8" edc:desc="Fault Polarity"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:nzwidth="0x8" edc:desc="Fault Activation Mode"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:nzwidth="0x8" edc:desc="Fault Filtering"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40068060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FIV" edc:nzwidth="0x8" edc:desc="Fault Input Value"/>
            <edc:SFRFieldDef edc:cname="FS" edc:nzwidth="0x8" edc:desc="Fault Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FCR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x40068064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FCLR" edc:nzwidth="0x8" edc:desc="Fault Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FPV1" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x40068068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPVH0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVH1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVH2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPVH3" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPVL0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVL1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVL2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPVL3" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FPE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4006806C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPE0" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="FPE1" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="FPE2" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 2"/>
            <edc:SFRFieldDef edc:cname="FPE3" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40068070"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ELMR0" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4006807C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_ELMR1" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40068080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x40068084"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SSPR" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x400680A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="SPRD" edc:nzwidth="0x18" edc:desc="Spread Spectrum Limit Value"/>
            <edc:SFRFieldDef edc:cname="SPRDM" edc:nzwidth="0x1" edc:desc="Spread Spectrum Counter Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SSPUP" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x400680A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="SPRDUP" edc:nzwidth="0x18" edc:desc="Spread Spectrum Limit Value Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400680A8"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_SMMR" edc:nzwidth="0x20" edc:access="--------------nn--------------nn" edc:impl="0x30003" edc:_addr="0x400680B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="GCEN0" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:SFRFieldDef edc:cname="GCEN1" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="DOWN0" edc:nzwidth="0x1" edc:desc="Down Count"/>
            <edc:SFRFieldDef edc:cname="DOWN1" edc:nzwidth="0x1" edc:desc="Down Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x400680B4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_FPV2" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x400680C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPZH0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZH1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZH2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPZH3" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPZL0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZL1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZL2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPZL3" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x400680C4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_WPCR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x400680E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WPCMD" edc:nzwidth="0x2" edc:desc="Write Protection Command">
              <edc:SFRFieldSemantic edc:cname="DISABLE_SW_PROT" edc:desc="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_SW_PROT" edc:desc="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_HW_PROT" edc:desc="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WPRG0" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 0"/>
            <edc:SFRFieldDef edc:cname="WPRG1" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 1"/>
            <edc:SFRFieldDef edc:cname="WPRG2" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 2"/>
            <edc:SFRFieldDef edc:cname="WPRG3" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 3"/>
            <edc:SFRFieldDef edc:cname="WPRG4" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 4"/>
            <edc:SFRFieldDef edc:cname="WPRG5" edc:nzwidth="0x1" edc:desc="Write Protection Register Group 5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPCMD field. Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x50574D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_WPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrr--rrrrrrr-rrrrrr" edc:impl="0xFFFF3FBF" edc:_addr="0x400680E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WPSWS0" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS1" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS2" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS3" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS4" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:SFRFieldDef edc:cname="WPSWS5" edc:nzwidth="0x1" edc:desc="Write Protect SW Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protect Violation Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS0" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS1" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS2" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS3" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS4" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:SFRFieldDef edc:cname="WPHWS5" edc:nzwidth="0x1" edc:desc="Write Protect HW Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x44" edc:_addr="0x400680EC"/>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM_CMP0PWM0_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x40068130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
