Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IDR1" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4006C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3 Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IMR1" edc:nzwidth="0x20" edc:access="------------rrrr------------rrrr" edc:impl="0xF000F" edc:_addr="0x4006C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3 Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_ISR1" edc:nzwidth="0x20" edc:access="------------rrrr------------rrrr" edc:impl="0xF000F" edc:_addr="0x4006C01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SCM" edc:nzwidth="0x20" edc:access="--------nnnn--nn------------nnnn" edc:impl="0xF3000F" edc:_addr="0x4006C020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="SYNC0" edc:nzwidth="0x1" edc:desc="Synchronous Channel 0"/>
            <edc:SFRFieldDef edc:cname="SYNC1" edc:nzwidth="0x1" edc:desc="Synchronous Channel 1"/>
            <edc:SFRFieldDef edc:cname="SYNC2" edc:nzwidth="0x1" edc:desc="Synchronous Channel 2"/>
            <edc:SFRFieldDef edc:cname="SYNC3" edc:nzwidth="0x1" edc:desc="Synchronous Channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="UPDM" edc:nzwidth="0x2" edc:desc="Synchronous Channels Update Mode">
              <edc:SFRFieldSemantic edc:cname="MODE0" edc:desc="Manual write of double buffer registers and manual update of synchronous channels" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Manual write of double buffer registers and automatic update of synchronous channels" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="Automatic write of duty-cycle update registers by the DMA Controller and automatic update of synchronous channels" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PTRM" edc:nzwidth="0x1" edc:desc="DMA Controller Transfer Request Mode"/>
            <edc:SFRFieldDef edc:cname="PTRCS" edc:nzwidth="0x3" edc:desc="DMA Controller Transfer Request Comparison Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_DMAR" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4006C024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="DMADUTY" edc:nzwidth="0x18" edc:desc="Duty-Cycle Holding Register for DMA Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SCUC" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x4006C028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="UPDULOCK" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Unlock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SCUP" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4006C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="UPR" edc:nzwidth="0x4" edc:desc="Update Period"/>
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:nzwidth="0x4" edc:desc="Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SCUPUPD" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x4006C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="UPRUPD" edc:nzwidth="0x4" edc:desc="Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
