Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IER2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:impl="0xFFFF09" edc:_addr="0x4006C034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IDR2" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwww----w--w" edc:impl="0xFFFF09" edc:_addr="0x4006C038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IMR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:impl="0xFFFF09" edc:_addr="0x4006C03C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_ISR2" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr----r--r" edc:impl="0xFFFF09" edc:_addr="0x4006C040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Write Ready for Synchronous Channels Update"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Synchronous Channels Update Underrun Error"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPM0" edc:nzwidth="0x1" edc:desc="Comparison 0 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM1" edc:nzwidth="0x1" edc:desc="Comparison 1 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM2" edc:nzwidth="0x1" edc:desc="Comparison 2 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM3" edc:nzwidth="0x1" edc:desc="Comparison 3 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM4" edc:nzwidth="0x1" edc:desc="Comparison 4 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM5" edc:nzwidth="0x1" edc:desc="Comparison 5 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM6" edc:nzwidth="0x1" edc:desc="Comparison 6 Match"/>
            <edc:SFRFieldDef edc:cname="CMPM7" edc:nzwidth="0x1" edc:desc="Comparison 7 Match"/>
            <edc:SFRFieldDef edc:cname="CMPU0" edc:nzwidth="0x1" edc:desc="Comparison 0 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU1" edc:nzwidth="0x1" edc:desc="Comparison 1 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU2" edc:nzwidth="0x1" edc:desc="Comparison 2 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU3" edc:nzwidth="0x1" edc:desc="Comparison 3 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU4" edc:nzwidth="0x1" edc:desc="Comparison 4 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU5" edc:nzwidth="0x1" edc:desc="Comparison 5 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU6" edc:nzwidth="0x1" edc:desc="Comparison 6 Update"/>
            <edc:SFRFieldDef edc:cname="CMPU7" edc:nzwidth="0x1" edc:desc="Comparison 7 Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_OOV" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x4006C044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OOVH0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVH1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVH2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OOVH3" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OOVL0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVL1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVL2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OOVL3" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
