Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_OS" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x4006C048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSH0" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSH1" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSH2" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSH3" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSL0" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSL1" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSL2" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSL3" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_OSS" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4006C04C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSSH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSH3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSL3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_OSC" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4006C050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSCH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCH3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCL3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_OSSUPD" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4006C054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSUPH3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSUPL3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_OSCUPD" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4006C058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCUPH3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCUPL3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FMR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4006C05C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPOL" edc:nzwidth="0x8" edc:desc="Fault Polarity"/>
            <edc:SFRFieldDef edc:cname="FMOD" edc:nzwidth="0x8" edc:desc="Fault Activation Mode"/>
            <edc:SFRFieldDef edc:cname="FFIL" edc:nzwidth="0x8" edc:desc="Fault Filtering"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4006C060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FIV" edc:nzwidth="0x8" edc:desc="Fault Input Value"/>
            <edc:SFRFieldDef edc:cname="FS" edc:nzwidth="0x8" edc:desc="Fault Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FCR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4006C064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FCLR" edc:nzwidth="0x8" edc:desc="Fault Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
