Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FPV1" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x4006C068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPVH0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVH1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVH2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPVH3" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWMH output on channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPVL0" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPVL1" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPVL2" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPVL3" edc:nzwidth="0x1" edc:desc="Fault Protection Value for PWML output on channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FPE" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4006C06C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPE0" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="FPE1" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="FPE2" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 2"/>
            <edc:SFRFieldDef edc:cname="FPE3" edc:nzwidth="0x8" edc:desc="Fault Protection Enable for channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4006C070"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_ELMR0" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4006C07C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_ELMR1" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4006C080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:nzwidth="0x1" edc:desc="Comparison 0 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:nzwidth="0x1" edc:desc="Comparison 1 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:nzwidth="0x1" edc:desc="Comparison 2 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:nzwidth="0x1" edc:desc="Comparison 3 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:nzwidth="0x1" edc:desc="Comparison 4 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:nzwidth="0x1" edc:desc="Comparison 5 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:nzwidth="0x1" edc:desc="Comparison 6 Selection"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:nzwidth="0x1" edc:desc="Comparison 7 Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x4006C084"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SSPR" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4006C0A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="SPRD" edc:nzwidth="0x18" edc:desc="Spread Spectrum Limit Value"/>
            <edc:SFRFieldDef edc:cname="SPRDM" edc:nzwidth="0x1" edc:desc="Spread Spectrum Counter Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SSPUP" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4006C0A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="SPRDUP" edc:nzwidth="0x18" edc:desc="Spread Spectrum Limit Value Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4006C0A8"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SMMR" edc:nzwidth="0x20" edc:access="--------------nn--------------nn" edc:impl="0x30003" edc:_addr="0x4006C0B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="GCEN0" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:SFRFieldDef edc:cname="GCEN1" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="DOWN0" edc:nzwidth="0x1" edc:desc="Down Count"/>
            <edc:SFRFieldDef edc:cname="DOWN1" edc:nzwidth="0x1" edc:desc="Down Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4006C0B4"/>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_FPV2" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x4006C0C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="FPZH0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZH1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZH2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPZH3" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPZL0" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 0"/>
            <edc:SFRFieldDef edc:cname="FPZL1" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 1"/>
            <edc:SFRFieldDef edc:cname="FPZL2" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 2"/>
            <edc:SFRFieldDef edc:cname="FPZL3" edc:nzwidth="0x1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
