Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP0PWM1_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4006C13C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP1PWM1_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4006C140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP1PWM1_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4006C144">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP1PWM1_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4006C148">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP1PWM1_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4006C14C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP2PWM1_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4006C150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP2PWM1_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4006C154">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP2PWM1_CMPM" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:impl="0xFFFFF1" edc:_addr="0x4006C158">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:nzwidth="0x1" edc:desc="Comparison x Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:nzwidth="0x4" edc:desc="Comparison x Trigger"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:nzwidth="0x4" edc:desc="Comparison x Period"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Period Counter"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:nzwidth="0x4" edc:desc="Comparison x Update Period"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP2PWM1_CMPMUPD" edc:nzwidth="0x20" edc:access="------------wwww----wwwwwwww---w" edc:impl="0xF0FF1" edc:_addr="0x4006C15C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:nzwidth="0x1" edc:desc="Comparison x Enable Update"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Trigger Update"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Period Update"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:nzwidth="0x4" edc:desc="Comparison x Update Period Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP3PWM1_CMPV" edc:nzwidth="0x20" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFF" edc:_addr="0x4006C160">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x18" edc:desc="Comparison x Value"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM_CMP3PWM1_CMPVUPD" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4006C164">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:nzwidth="0x18" edc:desc="Comparison x Value Update"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:nzwidth="0x1" edc:desc="Comparison x Value Mode Update"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
