Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x7F18" edc:_addr="0x400780E8"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_CR_NCS0" edc:nzwidth="0x20" edc:access="-nn----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x61FFFFFF" edc:_addr="0x40080000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="fixed to 0"/>
            <edc:SFRFieldDef edc:cname="BANKSIZE" edc:nzwidth="0x5" edc:desc="Bank Size">
              <edc:SFRFieldSemantic edc:cname="_8KB" edc:desc="8Kbytes" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_16KB" edc:desc="16Kbytes" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_32KB" edc:desc="32Kbytes" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_64KB" edc:desc="64Kbytes" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_128KB" edc:desc="128Kbytes" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="_256KB" edc:desc="256Kbytes" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="_512KB" edc:desc="512Kbytes" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="_1MB" edc:desc="1Mbytes" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="_2MB" edc:desc="2Mbytes" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="NOT_USED" edc:desc="NOT_USED" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="type of memory used"/>
            <edc:SFRFieldDef edc:cname="ADDBASE" edc:nzwidth="0x12" edc:desc="relative base address of NCS area"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WRITE_ECC_CONF" edc:nzwidth="0x1" edc:desc="ECC Configuration Protection Enable"/>
            <edc:SFRFieldDef edc:cname="ECC_ENABLE" edc:nzwidth="0x1" edc:desc="ECC Protection Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_CR_NCS1" edc:nzwidth="0x20" edc:access="-n-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x41FFFFFF" edc:_addr="0x40080004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="fixed to 0"/>
            <edc:SFRFieldDef edc:cname="BANKSIZE" edc:nzwidth="0x5" edc:desc="Bank Size">
              <edc:SFRFieldSemantic edc:cname="_8KB" edc:desc="8Kbytes" edc:when="(field &amp; 0x1F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_16KB" edc:desc="16Kbytes" edc:when="(field &amp; 0x1F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_32KB" edc:desc="32Kbytes" edc:when="(field &amp; 0x1F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_64KB" edc:desc="64Kbytes" edc:when="(field &amp; 0x1F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_128KB" edc:desc="128Kbytes" edc:when="(field &amp; 0x1F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="_256KB" edc:desc="256Kbytes" edc:when="(field &amp; 0x1F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="_512KB" edc:desc="512Kbytes" edc:when="(field &amp; 0x1F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="_1MB" edc:desc="1Mbytes" edc:when="(field &amp; 0x1F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="_2MB" edc:desc="2Mbytes" edc:when="(field &amp; 0x1F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="NOT_USED" edc:desc="NOT_USED" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="type of memory used"/>
            <edc:SFRFieldDef edc:cname="ADDBASE" edc:nzwidth="0x12" edc:desc="relative base address of NCS area"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ECC_ENABLE" edc:nzwidth="0x1" edc:desc="ECC Protection Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40080008"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_CTRL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x40080018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="External control buffer active polarity"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4008001C"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_CRP_NCS0" edc:nzwidth="0x20" edc:access="------nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFFFF" edc:_addr="0x40080020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="MASTERNUMBER" edc:nzwidth="0x10" edc:desc="Master Number ID"/>
            <edc:SFRFieldDef edc:cname="SUPERUSER" edc:nzwidth="0x1" edc:desc="User or Superuser access"/>
            <edc:SFRFieldDef edc:cname="WR" edc:nzwidth="0x1" edc:desc="Write Access"/>
            <edc:SFRFieldDef edc:cname="RD" edc:nzwidth="0x1" edc:desc="Read Access"/>
            <edc:SFRFieldDef edc:cname="SPLITBANKSIZE" edc:nzwidth="0x5" edc:desc="bank size internal separation"/>
            <edc:SFRFieldDef edc:cname="PROTECTZONE" edc:nzwidth="0x1" edc:desc="select area protected"/>
            <edc:SFRFieldDef edc:cname="PROTECTON" edc:nzwidth="0x1" edc:desc="protection activation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_CRP_NCS1" edc:nzwidth="0x20" edc:access="------nnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FFFFFF" edc:_addr="0x40080024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="MASTERNUMBER" edc:nzwidth="0x10" edc:desc="Master Number ID"/>
            <edc:SFRFieldDef edc:cname="SUPERUSER" edc:nzwidth="0x1" edc:desc="User or Superuser access"/>
            <edc:SFRFieldDef edc:cname="WR" edc:nzwidth="0x1" edc:desc="Write Access"/>
            <edc:SFRFieldDef edc:cname="RD" edc:nzwidth="0x1" edc:desc="Read Access"/>
            <edc:SFRFieldDef edc:cname="SPLITBANKSIZE" edc:nzwidth="0x5" edc:desc="bank size internal separation"/>
            <edc:SFRFieldDef edc:cname="PROTECTZONE" edc:nzwidth="0x1" edc:desc="select area protected"/>
            <edc:SFRFieldDef edc:cname="PROTECTON" edc:nzwidth="0x1" edc:desc="protection activation"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
