Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40080028"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_IER" edc:nzwidth="0x20" edc:access="---------------------------wwww-" edc:impl="0x1E" edc:_addr="0x40080038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTOFRANGE" edc:nzwidth="0x1" edc:desc="out of range"/>
            <edc:SFRFieldDef edc:cname="RDERRORACCESS" edc:nzwidth="0x1" edc:desc="read access error"/>
            <edc:SFRFieldDef edc:cname="WRERRORACCESS" edc:nzwidth="0x1" edc:desc="write access error"/>
            <edc:SFRFieldDef edc:cname="USERERRORACCESS" edc:nzwidth="0x1" edc:desc="user or superuser access error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_IDR" edc:nzwidth="0x20" edc:access="---------------------------wwww-" edc:impl="0x1E" edc:_addr="0x4008003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTOFRANGE" edc:nzwidth="0x1" edc:desc="out of range"/>
            <edc:SFRFieldDef edc:cname="RDERRORACCESS" edc:nzwidth="0x1" edc:desc="read access error"/>
            <edc:SFRFieldDef edc:cname="WRERRORACCESS" edc:nzwidth="0x1" edc:desc="write access error"/>
            <edc:SFRFieldDef edc:cname="USERERRORACCESS" edc:nzwidth="0x1" edc:desc="user or superuser access error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_IMR" edc:nzwidth="0x20" edc:access="---------------------------rrrr-" edc:impl="0x1E" edc:_addr="0x40080040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTOFRANGE" edc:nzwidth="0x1" edc:desc="out of range"/>
            <edc:SFRFieldDef edc:cname="RDERRORACCESS" edc:nzwidth="0x1" edc:desc="read access error"/>
            <edc:SFRFieldDef edc:cname="WRERRORACCESS" edc:nzwidth="0x1" edc:desc="write access error"/>
            <edc:SFRFieldDef edc:cname="USERERRORACCESS" edc:nzwidth="0x1" edc:desc="user or superuser access error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_ISR" edc:nzwidth="0x20" edc:access="---------------------------rrrr-" edc:impl="0x1E" edc:_addr="0x40080044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTOFRANGE" edc:nzwidth="0x1" edc:desc="out of range"/>
            <edc:SFRFieldDef edc:cname="RDERRORACCESS" edc:nzwidth="0x1" edc:desc="read access error"/>
            <edc:SFRFieldDef edc:cname="WRERRORACCESS" edc:nzwidth="0x1" edc:desc="Write access error"/>
            <edc:SFRFieldDef edc:cname="USERERRORACCESS" edc:nzwidth="0x1" edc:desc="User or SuperUser Error Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_SR" edc:nzwidth="0x20" edc:access="---------------------------rrrr-" edc:impl="0x1E" edc:_addr="0x40080048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OUTOFRANGE" edc:nzwidth="0x1" edc:desc="out of range"/>
            <edc:SFRFieldDef edc:cname="RDERRORACCESS" edc:nzwidth="0x1" edc:desc="Read access error"/>
            <edc:SFRFieldDef edc:cname="WRERRORACCESS" edc:nzwidth="0x1" edc:desc="Write access error"/>
            <edc:SFRFieldDef edc:cname="USERERRORACCESS" edc:nzwidth="0x1" edc:desc="User or SuperUser Error Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xB4" edc:_addr="0x4008004C"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_CR" edc:nzwidth="0x20" edc:access="--------------------------nn-nn-" edc:impl="0x36" edc:_addr="0x40080100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0x40080104"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_TESTCB" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40080140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="TCB1" edc:nzwidth="0x10" edc:desc="test check bit (16 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0x40080144"/>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_SR" edc:nzwidth="0x20" edc:access="----rrrr--------rrrrrr-rrrrrrr-r" edc:impl="0xF00FDFD" edc:_addr="0x40080180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="Fixable error status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPT_FIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_FIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="Un-fixable error status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPT_NOFIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_NOFIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="HES" edc:nzwidth="0x3" edc:desc="Hardware Error Size"/>
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="write or read access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
