Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_IER" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40080184">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="Fixable error"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="Un-fixable error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_IDR" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x40080188">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="fixable error"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="un-fixable error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_IMR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x4008018C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="fixable error"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="un-fixable error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_FAILAR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40080190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="address of the error detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HEMC" edc:cname="HEMC_HECC_FAILDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40080194">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HEMC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data error detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xE68" edc:_addr="0x40080198"/>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS0HSMC_SETUP" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:impl="0x3F3F3F3F" edc:_addr="0x40081000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="NWE_SETUP" edc:nzwidth="0x6" edc:desc="NWE Setup Length"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NCS_WR_SETUP" edc:nzwidth="0x6" edc:desc="NCS Setup Length in WRITE Access"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NRD_SETUP" edc:nzwidth="0x6" edc:desc="NRD Setup Length"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NCS_RD_SETUP" edc:nzwidth="0x6" edc:desc="NCS Setup Length in READ Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS0HSMC_PULSE" edc:nzwidth="0x20" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x7F7F7F7F" edc:_addr="0x40081004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="NWE_PULSE" edc:nzwidth="0x7" edc:desc="NWE Pulse Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NCS_WR_PULSE" edc:nzwidth="0x7" edc:desc="NCS Pulse Length in WRITE Access"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NRD_PULSE" edc:nzwidth="0x7" edc:desc="NRD Pulse Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NCS_RD_PULSE" edc:nzwidth="0x7" edc:desc="NCS Pulse Length in READ Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS0HSMC_CYCLE" edc:nzwidth="0x20" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:impl="0x1FF01FF" edc:_addr="0x40081008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="NWE_CYCLE" edc:nzwidth="0x9" edc:desc="Total Write Cycle Length"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="NRD_CYCLE" edc:nzwidth="0x9" edc:desc="Total Read Cycle Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS0HSMC_MODE" edc:nzwidth="0x20" edc:access="----------------------nn--nn-nnn" edc:impl="0x337" edc:_addr="0x4008100C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="READ_MODE" edc:nzwidth="0x1" edc:desc="Read Mode"/>
            <edc:SFRFieldDef edc:cname="WRITE_MODE" edc:nzwidth="0x1" edc:desc="Write Mode"/>
            <edc:SFRFieldDef edc:cname="RMW_ENABLE" edc:nzwidth="0x1" edc:desc="Read-Modify Write enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXNW_MODE" edc:nzwidth="0x2" edc:desc="NWAIT Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled-The NWAIT input signal is ignored on the corresponding chip select." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FROZEN" edc:desc="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="READY" edc:desc="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DBW" edc:nzwidth="0x2" edc:desc="Data Bus Width">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8-bit Data Bus" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS1HSMC_SETUP" edc:nzwidth="0x20" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:impl="0x3F3F3F3F" edc:_addr="0x40081010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="NWE_SETUP" edc:nzwidth="0x6" edc:desc="NWE Setup Length"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NCS_WR_SETUP" edc:nzwidth="0x6" edc:desc="NCS Setup Length in WRITE Access"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NRD_SETUP" edc:nzwidth="0x6" edc:desc="NRD Setup Length"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NCS_RD_SETUP" edc:nzwidth="0x6" edc:desc="NCS Setup Length in READ Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS1HSMC_PULSE" edc:nzwidth="0x20" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x7F7F7F7F" edc:_addr="0x40081014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="NWE_PULSE" edc:nzwidth="0x7" edc:desc="NWE Pulse Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NCS_WR_PULSE" edc:nzwidth="0x7" edc:desc="NCS Pulse Length in WRITE Access"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NRD_PULSE" edc:nzwidth="0x7" edc:desc="NRD Pulse Length"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NCS_RD_PULSE" edc:nzwidth="0x7" edc:desc="NCS Pulse Length in READ Access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS1HSMC_CYCLE" edc:nzwidth="0x20" edc:access="-------nnnnnnnnn-------nnnnnnnnn" edc:impl="0x1FF01FF" edc:_addr="0x40081018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="NWE_CYCLE" edc:nzwidth="0x9" edc:desc="Total Write Cycle Length"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="NRD_CYCLE" edc:nzwidth="0x9" edc:desc="Total Read Cycle Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_CS1HSMC_MODE" edc:nzwidth="0x20" edc:access="----------------------nn--nn-nnn" edc:impl="0x337" edc:_addr="0x4008101C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="READ_MODE" edc:nzwidth="0x1" edc:desc="Read Mode"/>
            <edc:SFRFieldDef edc:cname="WRITE_MODE" edc:nzwidth="0x1" edc:desc="Write Mode"/>
            <edc:SFRFieldDef edc:cname="RMW_ENABLE" edc:nzwidth="0x1" edc:desc="Read-Modify Write enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXNW_MODE" edc:nzwidth="0x2" edc:desc="NWAIT Mode">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled-The NWAIT input signal is ignored on the corresponding chip select." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FROZEN" edc:desc="Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="READY" edc:desc="Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DBW" edc:nzwidth="0x2" edc:desc="Data Bus Width">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8-bit Data Bus" edc:when="(field &amp; 0x3) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x50" edc:_addr="0x40081020"/>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x40081070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMC" edc:cname="HSMC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x40081074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xAF88" edc:_addr="0x40081078"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_CFG" edc:nzwidth="0x20" edc:access="----------------nnnn--nnnnnn-nnn" edc:impl="0xF3F7" edc:_addr="0x4008C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="WBDIS" edc:nzwidth="0x1" edc:desc="Write Back Disable"/>
            <edc:SFRFieldDef edc:cname="EOMDIS" edc:nzwidth="0x1" edc:desc="End of Monitoring Disable"/>
            <edc:SFRFieldDef edc:cname="SLBDIS" edc:nzwidth="0x1" edc:desc="Secondary List Branching Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BBC" edc:nzwidth="0x4" edc:desc="Bus Burden Control"/>
            <edc:SFRFieldDef edc:cname="ASCD" edc:nzwidth="0x1" edc:desc="Automatic Switch To Compare Digest"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UIHASH" edc:nzwidth="0x1" edc:desc="User Initial Hash Value"/>
            <edc:SFRFieldDef edc:cname="UALGO" edc:nzwidth="0x3" edc:desc="User SHA Algorithm">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 algorithm processed" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 algorithm processed" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 algorithm processed" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_CTRL" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwww-www" edc:impl="0xFFF7" edc:_addr="0x4008C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ICM Enable"/>
            <edc:SFRFieldDef edc:cname="DISABLE" edc:nzwidth="0x1" edc:desc="ICM Disable Register"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="REHASH" edc:nzwidth="0x4" edc:desc="Recompute Internal Hash"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:nzwidth="0x4" edc:desc="Region Monitoring Disable"/>
            <edc:SFRFieldDef edc:cname="RMEN" edc:nzwidth="0x4" edc:desc="Region Monitoring Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_SR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0x4008C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ICM Enable Register"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="RAWRMDIS" edc:nzwidth="0x4" edc:desc="Region Monitoring Disabled Raw Status"/>
            <edc:SFRFieldDef edc:cname="RMDIS" edc:nzwidth="0x4" edc:desc="Region Monitoring Disabled Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4008C00C"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_IER" edc:nzwidth="0x20" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0x1FFFFFF" edc:_addr="0x4008C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="RHC" edc:nzwidth="0x4" edc:desc="Region Hash Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RDM" edc:nzwidth="0x4" edc:desc="Region Digest Mismatch Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RBE" edc:nzwidth="0x4" edc:desc="Region Bus Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RWC" edc:nzwidth="0x4" edc:desc="Region Wrap Condition detected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x4" edc:desc="Region End bit Condition Detected Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RSU" edc:nzwidth="0x4" edc:desc="Region Status Updated Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Undefined Register Access Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
