Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_ISR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x4009001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x40090020"/>
      <edc:SFRDef ltx:memberofperipheral="TRNG" edc:cname="TRNG_ODATA" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40090050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRNG">
            <edc:SFRFieldDef edc:cname="ODATA" edc:nzwidth="0x20" edc:desc="Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FAC" edc:_addr="0x40090054"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_CR" edc:nzwidth="0x20" edc:access="------------------ww---w---w---w" edc:impl="0x3111" edc:_addr="0x40094000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Processing"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FIRST" edc:nzwidth="0x1" edc:desc="First Block of a Message"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WUIHV" edc:nzwidth="0x1" edc:desc="Write User Initial Hash Values"/>
            <edc:SFRFieldDef edc:cname="WUIEHV" edc:nzwidth="0x1" edc:desc="Write User Initial or Expected Hash Values"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_MR" edc:nzwidth="0x20" edc:access="nnnn--nn-------n----nnnn-nn---nn" edc:impl="0xF3010F63" edc:_addr="0x40094004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="SMOD" edc:nzwidth="0x2" edc:desc="Start Mode">
              <edc:SFRFieldSemantic edc:cname="MANUAL_START" edc:desc="Manual mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTO_START" edc:desc="Auto mode" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IDATAR0_START" edc:desc="SHA_IDATAR0 access only mode (mandatory when DMA is used)" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="UIHV" edc:nzwidth="0x1" edc:desc="User Initial Hash Value Registers"/>
            <edc:SFRFieldDef edc:cname="UIEHV" edc:nzwidth="0x1" edc:desc="User Initial or Expected Hash Value Registers"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALGO" edc:nzwidth="0x4" edc:desc="SHA Algorithm">
              <edc:SFRFieldSemantic edc:cname="SHA1" edc:desc="SHA1 algorithm processed" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SHA256" edc:desc="SHA256 algorithm processed" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SHA384" edc:desc="SHA384 algorithm processed" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SHA512" edc:desc="SHA512 algorithm processed" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SHA224" edc:desc="SHA224 algorithm processed" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA1" edc:desc="HMAC algorithm with SHA1 Hash processed" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA256" edc:desc="HMAC algorithm with SHA256 Hash processed" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA384" edc:desc="HMAC algorithm with SHA384 Hash processed" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA512" edc:desc="HMAC algorithm with SHA512 Hash processed" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="HMAC_SHA224" edc:desc="HMAC algorithm with SHA224 Hash processed" edc:when="(field &amp; 0xF) == 0x0C"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DUALBUFF" edc:nzwidth="0x1" edc:desc="Dual Input Buffer">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="SHA_IDATARx and SHA_IODATARx cannot be written during processing of previous block." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="SHA_IDATARx and SHA_IODATARx can be written during processing of previous block when SMOD value = 2. It speeds up the overall runtime of large files." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CHECK" edc:nzwidth="0x2" edc:desc="Hash Check">
              <edc:SFRFieldSemantic edc:cname="NO_CHECK" edc:desc="No check is performed" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CHECK_EHV" edc:desc="Check is performed with expected hash stored in internal expected hash value registers." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CHECK_MESSAGE" edc:desc="Check is performed with expected hash provided after the message." edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHKCNT" edc:nzwidth="0x4" edc:desc="Check Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40094008"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IER" edc:nzwidth="0x20" edc:access="-------w-------w-------w-------w" edc:impl="0x1010101" edc:_addr="0x40094010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CHECKF" edc:nzwidth="0x1" edc:desc="Check Done Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Safety Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
