Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDR" edc:nzwidth="0x20" edc:access="-------w-------w-------w-------w" edc:impl="0x1010101" edc:_addr="0x40094014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CHECKF" edc:nzwidth="0x1" edc:desc="Check Done Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Safety Event Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IMR" edc:nzwidth="0x20" edc:access="-------r-------r-------r-------r" edc:impl="0x1010101" edc:_addr="0x40094018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="CHECKF" edc:nzwidth="0x1" edc:desc="Check Done Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Safety Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_ISR" edc:nzwidth="0x20" edc:access="-------rrrrr---r-rrr---r---r---r" edc:impl="0x1F17111" edc:_addr="0x4009401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="DATRDY" edc:nzwidth="0x1" edc:desc="Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WRDY" edc:nzwidth="0x1" edc:desc="Input Data Register Write Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAD" edc:nzwidth="0x1" edc:desc="Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="URAT" edc:nzwidth="0x3" edc:desc="Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CHECKF" edc:nzwidth="0x1" edc:desc="Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHKST" edc:nzwidth="0x4" edc:desc="Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)"/>
            <edc:SFRFieldDef edc:cname="SECE" edc:nzwidth="0x1" edc:desc="Security and/or Safety Event"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_MSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40094020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="MSGSIZE" edc:nzwidth="0x20" edc:desc="Message Size"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40094024"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_BCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40094030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="BYTCNT" edc:nzwidth="0x20" edc:desc="Remaining Byte Count Before Auto Padding"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40094034"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR1" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR2" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4009404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR4" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR5" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR6" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR7" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4009405C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IDATAR8" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40094060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IDATA" edc:nzwidth="0x20" edc:desc="Input Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
