Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940B8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_IODATAR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400940BC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="IODATA" edc:nzwidth="0x20" edc:desc="Input/Output Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x400940C0"/>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x400940E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Configuration Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interruption Enable"/>
            <edc:SFRFieldDef edc:cname="WPCREN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534841"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SHA" edc:cname="SHA_WPSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-------r" edc:impl="0xFF01" edc:_addr="0x400940E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SHA">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x8" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400940EC"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GTYPE" edc:nzwidth="0x20" edc:access="---------rrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x7FFFFF" edc:_addr="0x40098000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NB_CH" edc:nzwidth="0x5" edc:desc="Number of Channels Minus One"/>
            <edc:SFRFieldDef edc:cname="FIFO_SZ" edc:nzwidth="0xB" edc:desc="Number of Bytes"/>
            <edc:SFRFieldDef edc:cname="NB_REQ" edc:nzwidth="0x7" edc:desc="Number of Peripheral Requests Minus One"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GCFG" edc:nzwidth="0x20" edc:access="-----------------------n----nnnn" edc:impl="0x10F" edc:_addr="0x40098004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="CGDISREG" edc:nzwidth="0x1" edc:desc="Configuration Registers Clock Gating Disable"/>
            <edc:SFRFieldDef edc:cname="CGDISPIPE" edc:nzwidth="0x1" edc:desc="Pipeline Clock Gating Disable"/>
            <edc:SFRFieldDef edc:cname="CGDISFIFO" edc:nzwidth="0x1" edc:desc="FIFO Clock Gating Disable"/>
            <edc:SFRFieldDef edc:cname="CGDISIF" edc:nzwidth="0x1" edc:desc="Bus Interface Clock Gating Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="BXKBEN" edc:nzwidth="0x1" edc:desc="Boundary X Kilobyte Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GWAC" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40098008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="PW0" edc:nzwidth="0x4" edc:desc="Pool Weight 0"/>
            <edc:SFRFieldDef edc:cname="PW1" edc:nzwidth="0x4" edc:desc="Pool Weight 1"/>
            <edc:SFRFieldDef edc:cname="PW2" edc:nzwidth="0x4" edc:desc="Pool Weight 2"/>
            <edc:SFRFieldDef edc:cname="PW3" edc:nzwidth="0x4" edc:desc="Pool Weight 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GIE" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4009800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IE0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="IE31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
