Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GID" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40098010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ID0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ID31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Interrupt Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GIM" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40098014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IM0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="IM31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Interrupt Mask Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GIS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40098018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="IS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="IS31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Interrupt Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
