Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GE" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4009801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="EN0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GD" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40098020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40098024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ST0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GRS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40098028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Read Suspend Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GWS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4009802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="WS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Write Suspend Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GRWS" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40098030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RWS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Read Write Suspend Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
