Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GRWR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40098034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RWR0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Read Write Resume Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GSWR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40098038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWREQ0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Software Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWREQ31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Software Request Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GSWS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4009803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWRS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Software Request Status Bit"/>
            <edc:SFRFieldDef edc:cname="SWRS31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Software Request Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GSWF" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40098040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWF0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF24" edc:nzwidth="0x1" edc:desc="XDMAC Channel 24 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF25" edc:nzwidth="0x1" edc:desc="XDMAC Channel 25 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF26" edc:nzwidth="0x1" edc:desc="XDMAC Channel 26 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF27" edc:nzwidth="0x1" edc:desc="XDMAC Channel 27 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF28" edc:nzwidth="0x1" edc:desc="XDMAC Channel 28 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF29" edc:nzwidth="0x1" edc:desc="XDMAC Channel 29 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF30" edc:nzwidth="0x1" edc:desc="XDMAC Channel 30 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF31" edc:nzwidth="0x1" edc:desc="XDMAC Channel 31 Software Flush Request Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40098044"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CIE" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40098050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
