Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID3XDMAC_CC" edc:nzwidth="0x20" edc:access="-nnnnnnnnnn-nnnn-nnnnnnnnnnn-nnn" edc:impl="0x7FEF7FF7" edc:_addr="0x40098138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="Channel x Transfer Type">
              <edc:SFRFieldSemantic edc:cname="MEM_TRAN" edc:desc="Self-triggered mode (memory-to-memory transfer)." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PER_TRAN" edc:desc="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MBSIZE" edc:nzwidth="0x2" edc:desc="Channel x Memory Burst Size">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The memory burst size is set to one." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FOUR" edc:desc="The memory burst size is set to four." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT" edc:desc="The memory burst size is set to eight." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN" edc:desc="The memory burst size is set to sixteen." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSYNC" edc:nzwidth="0x1" edc:desc="Channel x Synchronization">
              <edc:SFRFieldSemantic edc:cname="PER2MEM" edc:desc="Peripheral-to-memory transfer." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="MEM2PER" edc:desc="Memory-to-peripheral transfer." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PROT" edc:nzwidth="0x1" edc:desc="Channel x Protection">
              <edc:SFRFieldSemantic edc:cname="PRIVILEGED" edc:desc="Channel uses Privileged mode." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="USER" edc:desc="Channel uses User mode." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SWREQ" edc:nzwidth="0x1" edc:desc="Channel x Software Request Trigger">
              <edc:SFRFieldSemantic edc:cname="HWR_CONNECTED" edc:desc="Hardware request line is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SWR_CONNECTED" edc:desc="Software request is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMSET" edc:nzwidth="0x1" edc:desc="Channel x Fill Block of Memory">
              <edc:SFRFieldSemantic edc:cname="NORMAL_MODE" edc:desc="Memset is not activated." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HW_MODE" edc:desc="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:nzwidth="0x3" edc:desc="Channel x Chunk Size">
              <edc:SFRFieldSemantic edc:cname="CHK_1" edc:desc="1 data transferred" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CHK_2" edc:desc="2 data transferred" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CHK_4" edc:desc="4 data transferred" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="CHK_8" edc:desc="8 data transferred" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="CHK_16" edc:desc="16 data transferred" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DWIDTH" edc:nzwidth="0x2" edc:desc="Channel x Data Width">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="The data size is set to 8 bits" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HALFWORD" edc:desc="The data size is set to 16 bits" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="The data size is set to 32 bits" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIF" edc:nzwidth="0x1" edc:desc="Channel x Source Interface Identifier">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is read through system bus interface 0." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is read through system bus interface 1." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIF" edc:nzwidth="0x1" edc:desc="Channel x Destination Interface Identifier">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is written through system bus interface 0." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is written though system bus interface 1." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:nzwidth="0x2" edc:desc="Channel x Source Addressing Mode">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAM" edc:nzwidth="0x2" edc:desc="Channel x Destination Addressing Mode">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INITD" edc:nzwidth="0x1" edc:desc="Channel Initialization Done (this bit is read-only)">
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="Channel initialization is in progress." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TERMINATED" edc:desc="Channel initialization is completed." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RDIP" edc:nzwidth="0x1" edc:desc="Read in Progress (this bit is read-only)">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active read transaction on the bus." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A read transaction is in progress." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRIP" edc:nzwidth="0x1" edc:desc="Write in Progress (this bit is read-only)">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active write transaction on the bus." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A write transaction is in progress." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x7" edc:desc="Channel x Peripheral Hardware Request Line Identifier">
              <edc:SFRFieldSemantic edc:cname="FLEXCOM0_TX" edc:desc="FLEXCOM0_TX" edc:when="(field &amp; 0x7F) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM0_RX" edc:desc="FLEXCOM0_RX" edc:when="(field &amp; 0x7F) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM1_TX" edc:desc="FLEXCOM1_TX" edc:when="(field &amp; 0x7F) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM1_RX" edc:desc="FLEXCOM1_RX" edc:when="(field &amp; 0x7F) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM2_TX" edc:desc="FLEXCOM2_TX" edc:when="(field &amp; 0x7F) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM2_RX" edc:desc="FLEXCOM2_RX" edc:when="(field &amp; 0x7F) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM3_TX" edc:desc="FLEXCOM3_TX" edc:when="(field &amp; 0x7F) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="FLEXCOM3_RX" edc:desc="FLEXCOM3_RX" edc:when="(field &amp; 0x7F) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="PWM0" edc:desc="PWM0" edc:when="(field &amp; 0x7F) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="PWM1" edc:desc="PWM1" edc:when="(field &amp; 0x7F) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="TC0" edc:desc="TC0" edc:when="(field &amp; 0x7F) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="TC1" edc:desc="TC1" edc:when="(field &amp; 0x7F) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="TC2" edc:desc="TC2" edc:when="(field &amp; 0x7F) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="SHA" edc:desc="SHA" edc:when="(field &amp; 0x7F) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="TC1_CPA" edc:desc="TC1_CPA" edc:when="(field &amp; 0x7F) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="TC4_CPA" edc:desc="TC4_CPA" edc:when="(field &amp; 0x7F) == 0x0F"/>
              <edc:SFRFieldSemantic edc:cname="TC7_CPA" edc:desc="TC7_CPA" edc:when="(field &amp; 0x7F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TC1_CPB" edc:desc="TC1_CPB" edc:when="(field &amp; 0x7F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC4_CPB" edc:desc="TC4_CPB" edc:when="(field &amp; 0x7F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="TC7_CPB" edc:desc="TC7_CPB" edc:when="(field &amp; 0x7F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="TC1_CPC" edc:desc="TC1_CPC" edc:when="(field &amp; 0x7F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="TC4_CPC" edc:desc="TC4_CPC" edc:when="(field &amp; 0x7F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="TC7_CPC" edc:desc="TC7_CPC" edc:when="(field &amp; 0x7F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="TC1_ETRG" edc:desc="TC1_ETRG" edc:when="(field &amp; 0x7F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="TC4_ETRG" edc:desc="TC4_ETRG" edc:when="(field &amp; 0x7F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="TC7_ETRG" edc:desc="TC7_ETRG" edc:when="(field &amp; 0x7F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="ADCC" edc:desc="ADCC" edc:when="(field &amp; 0x7F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="DACC" edc:desc="DACC" edc:when="(field &amp; 0x7F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="PCC" edc:desc="PCC" edc:when="(field &amp; 0x7F) == 0x1C"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID3XDMAC_CDS_MSP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4009813C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Source Data stride or Memory Set Pattern"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Destination Data Stride or Memory Set Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID3XDMAC_CSUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40098140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:nzwidth="0x18" edc:desc="Channel x Source Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID3XDMAC_CDUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40098144">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:nzwidth="0x18" edc:desc="Channel x Destination Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40098148"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID4XDMAC_CIE" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40098150">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
