Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CIM" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:impl="0x7F" edc:_addr="0x40098658">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIM" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="LIM" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="DIM" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="FIM" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="RBEIM" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="WBEIM" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="ROIM" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Mask Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CIS" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:impl="0x7F" edc:_addr="0x4009865C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIS" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="LIS" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="FIS" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="RBEIS" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="WBEIS" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="ROIS" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CSA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40098660">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SA" edc:nzwidth="0x20" edc:desc="Channel x Source Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CDA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40098664">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DA" edc:nzwidth="0x20" edc:desc="Channel x Destination Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CNDA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-n" edc:impl="0xFFFFFFFD" edc:_addr="0x40098668">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDAIF" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Interface"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NDA" edc:nzwidth="0x1E" edc:desc="Channel x Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CNDC" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x4009866C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDE" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Enable">
              <edc:SFRFieldSemantic edc:cname="DSCR_FETCH_DIS" edc:desc="Descriptor fetch is disabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DSCR_FETCH_EN" edc:desc="Descriptor fetch is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDSUP" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Source Update">
              <edc:SFRFieldSemantic edc:cname="SRC_PARAMS_UNCHANGED" edc:desc="Source parameters remain unchanged." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SRC_PARAMS_UPDATED" edc:desc="Source parameters are updated when the descriptor is retrieved." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDDUP" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Destination Update">
              <edc:SFRFieldSemantic edc:cname="DST_PARAMS_UNCHANGED" edc:desc="Destination parameters remain unchanged." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DST_PARAMS_UPDATED" edc:desc="Destination parameters are updated when the descriptor is retrieved." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDVIEW" edc:nzwidth="0x2" edc:desc="Channel x Next Descriptor View">
              <edc:SFRFieldSemantic edc:cname="NDV0" edc:desc="Next Descriptor View 0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="NDV1" edc:desc="Next Descriptor View 1" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="NDV2" edc:desc="Next Descriptor View 2" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="NDV3" edc:desc="Next Descriptor View 3" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CUBC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40098670">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="UBLEN" edc:nzwidth="0x18" edc:desc="Channel x Microblock Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID24XDMAC_CBC" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x40098674">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BLEN" edc:nzwidth="0xC" edc:desc="Channel x Block Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
