Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID31XDMAC_CDS_MSP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4009883C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Source Data stride or Memory Set Pattern"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Destination Data Stride or Memory Set Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID31XDMAC_CSUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40098840">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:nzwidth="0x18" edc:desc="Channel x Source Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID31XDMAC_CDUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40098844">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:nzwidth="0x18" edc:desc="Channel x Destination Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x77B8" edc:_addr="0x40098848"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
