Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG29" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG30" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG31" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A007C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG32" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG33" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG34" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG35" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A008C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG36" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG37" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG38" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A0098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_ROMCODE_DBG39" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400A009C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="ROM_CODE_DEBUG" edc:nzwidth="0x20" edc:desc="Rom code debug step"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_CAN0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:impl="0xFFFF0000" edc:_addr="0x400A00A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="EXT_MEM_ADDR" edc:nzwidth="0x10" edc:desc="MSB Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_CAN1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:impl="0xFFFF0000" edc:_addr="0x400A00A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="EXT_MEM_ADDR" edc:nzwidth="0x10" edc:desc="MSB Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400A00A8"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_BOOT_CFG" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x400A00B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="BOOT_SEL" edc:nzwidth="0x3" edc:desc="BOOT_MODE selected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x400A00B4"/>
      <edc:SFRDef ltx:memberofperipheral="SFR" edc:cname="SFR_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400A00E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SFR">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x534652"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
