Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x7F18" edc:_addr="0x400A00E8"/>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_IER" edc:nzwidth="0x20" edc:access="-----------------------wwwwwwwww" edc:impl="0x1FF" edc:_addr="0x400A8000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="NMI0" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 0 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI1" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 1 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI2" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 2 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI3" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 3 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI4" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 4 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI5" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 5 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI6" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 6 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI7" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 7 Enable"/>
            <edc:SFRFieldDef edc:cname="NMI8" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 8 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_IDR" edc:nzwidth="0x20" edc:access="-----------------------wwwwwwwww" edc:impl="0x1FF" edc:_addr="0x400A8004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="NMI0" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 0 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI1" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 1 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI2" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 2 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI3" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 3 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI4" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 4 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI5" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 5 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI6" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 6 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI7" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 7 Disable"/>
            <edc:SFRFieldDef edc:cname="NMI8" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt 8 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_IAR" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:impl="0x1FF" edc:_addr="0x400A8008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="NMI0" edc:nzwidth="0x1" edc:desc="Active Interrupt 0"/>
            <edc:SFRFieldDef edc:cname="NMI1" edc:nzwidth="0x1" edc:desc="Active Interrupt 1"/>
            <edc:SFRFieldDef edc:cname="NMI2" edc:nzwidth="0x1" edc:desc="Active Interrupt 2"/>
            <edc:SFRFieldDef edc:cname="NMI3" edc:nzwidth="0x1" edc:desc="Active Interrupt 3"/>
            <edc:SFRFieldDef edc:cname="NMI4" edc:nzwidth="0x1" edc:desc="Active Interrupt 4"/>
            <edc:SFRFieldDef edc:cname="NMI5" edc:nzwidth="0x1" edc:desc="Active Interrupt 5"/>
            <edc:SFRFieldDef edc:cname="NMI6" edc:nzwidth="0x1" edc:desc="Active Interrupt 6"/>
            <edc:SFRFieldDef edc:cname="NMI7" edc:nzwidth="0x1" edc:desc="Active Interrupt 7"/>
            <edc:SFRFieldDef edc:cname="NMI8" edc:nzwidth="0x1" edc:desc="Active Interrupt 8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_ISR" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:impl="0x1FF" edc:_addr="0x400A800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="NMI0" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 0 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI1" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 1 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI2" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 2 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI3" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 3 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI4" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 4 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI5" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 5 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI6" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 6 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI7" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 7 Pending (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NMI8" edc:nzwidth="0x1" edc:desc="Non-maskable Interrupt Source 8 Pending (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_GFCS" edc:nzwidth="0x20" edc:access="-----------------------rrrrrrrrr" edc:impl="0x1FF" edc:_addr="0x400A8010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="RDY0" edc:nzwidth="0x1" edc:desc="Filter 0 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY1" edc:nzwidth="0x1" edc:desc="Filter 1 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY2" edc:nzwidth="0x1" edc:desc="Filter 2 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY3" edc:nzwidth="0x1" edc:desc="Filter 3 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY4" edc:nzwidth="0x1" edc:desc="Filter 4 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY5" edc:nzwidth="0x1" edc:desc="Filter 5 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY6" edc:nzwidth="0x1" edc:desc="Filter 6 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY7" edc:nzwidth="0x1" edc:desc="Filter 7 Configuration Ready"/>
            <edc:SFRFieldDef edc:cname="RDY8" edc:nzwidth="0x1" edc:desc="Filter 8 Configuration Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG0R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A8014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG1R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A8018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
