Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG2R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG3R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A8020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG4R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A8024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG5R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A8028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG6R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="NMIC" edc:cname="NMIC_SCFG7R" edc:nzwidth="0x20" edc:access="n--------------n------nn---n--nn" edc:impl="0x80010313" edc:_addr="0x400A8030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NMIC">
            <edc:SFRFieldDef edc:cname="GFSEL" edc:nzwidth="0x2" edc:desc="Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GFEN" edc:nzwidth="0x1" edc:desc="Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="POL" edc:nzwidth="0x1" edc:desc="Polarity (POL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:SFRFieldDef edc:cname="LVL" edc:nzwidth="0x1" edc:desc="Level Detection (LVL bit is read-only in NMIC_SCFG1 to 8)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="EN" edc:nzwidth="0x1" edc:desc="Source Enable"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:nzwidth="0x1" edc:desc="Interrupt Line Freeze"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
