Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4010020C"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_CR" edc:nzwidth="0x20" edc:access="wwwwwwww------------------w-ww--" edc:impl="0xFF00002C" edc:_addr="0x40100210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="Shall be always write at '0'"/>
            <edc:SFRFieldDef edc:cname="TDXTALSEL" edc:nzwidth="0x1" edc:desc="Timing Domain Crystal Oscillator Select">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRYSTAL_SEL" edc:desc="If KEY is correct, XTALSEL switches the slow clock of the timing domain (TD_SLCK) on the 32.768 kHz crystal oscillator output." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDRCSEL" edc:nzwidth="0x1" edc:desc="Monitoring Domain RC Oscillator Select">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRYSTAL_SEL" edc:desc="If KEY is correct, XTALSEL switches the slow clock of the monitoring domain (MD_SLCK) on the slow RC oscillator output." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SMMR" edc:nzwidth="0x20" edc:access="--------n-----------------------" edc:impl="0x800000" edc:_addr="0x40100214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="CORESMUSEL" edc:nzwidth="0x1" edc:desc="Core Supply Monitor User Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn-n-n------nn------------" edc:impl="0xFF503000" edc:_addr="0x40100218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="CORSMRSTEN" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Reset Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a VDDCORE supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal, vddcore_nreset is asserted when a VDDCORE supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CORSMDIS" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Disable">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The VDDCORE supply monitor is enabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The VDDCORE supply monitor is disabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="Shall be always write at '0'"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FXTALSTUP" edc:nzwidth="0x1" edc:desc="Fast Startup 32.768 kHz Crystal Oscillator"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x4010021C"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SR" edc:nzwidth="0x20" edc:access="------------------------r---r---" edc:impl="0x88" edc:_addr="0x40100224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CORSMRSTS" edc:nzwidth="0x1" edc:desc="VDDCORE Supply Monitor Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one VDDCORE Supply Monitor reset event has been detected since the last read of the SUPC_SR." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TDOSCSEL" edc:nzwidth="0x1" edc:desc="32 kHz Oscillator Selection Status">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The timing domain slow clock, TD_SLCK, is generated by the slow RC oscillator." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The timing domain slow clock, TD_SLCK, is generated by the 32.768 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40100228"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_PWR" edc:nzwidth="0x20" edc:access="-------------n------------------" edc:impl="0x40000" edc:_addr="0x4010022C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="ZERO" edc:nzwidth="0x1" edc:desc="MD_SLCK always generated by the slow RC oscillator"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
