Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_VER" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x4010028C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="NVTIM" edc:nzwidth="0x1" edc:desc="Non-valid Time"/>
            <edc:SFRFieldDef edc:cname="NVCAL" edc:nzwidth="0x1" edc:desc="Non-valid Calendar"/>
            <edc:SFRFieldDef edc:cname="NVTIMALR" edc:nzwidth="0x1" edc:desc="Non-valid Time Alarm"/>
            <edc:SFRFieldDef edc:cname="NVCALALR" edc:nzwidth="0x1" edc:desc="Non-valid Calendar Alarm"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x54" edc:_addr="0x40100290"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SYSC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x401002E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key.">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x525443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x401002E8"/>
      <edc:SFRDef ltx:memberofperipheral="RSWDT" edc:cname="RSWDT_CR" edc:nzwidth="0x20" edc:access="wwwwwwww-----------------------w" edc:impl="0xFF000001" edc:_addr="0x40100300">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSWDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:nzwidth="0x1" edc:desc="Watchdog Restart"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xC4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSWDT" edc:cname="RSWDT_MR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnn-nnnnnnnnnnnnnn" edc:impl="0x3FFFBFFF" edc:_addr="0x40100304">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSWDT">
            <edc:SFRFieldDef edc:cname="WDV" edc:nzwidth="0xC" edc:desc="Watchdog Counter Value"/>
            <edc:SFRFieldDef edc:cname="WDFIEN" edc:nzwidth="0x1" edc:desc="Watchdog Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDRSTEN" edc:nzwidth="0x1" edc:desc="Watchdog Reset Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:nzwidth="0x1" edc:desc="Watchdog Disable"/>
            <edc:SFRFieldDef edc:cname="ALLONES" edc:nzwidth="0xC" edc:desc="Must Always Be Written with 0xFFF"/>
            <edc:SFRFieldDef edc:cname="WDDBGHLT" edc:nzwidth="0x1" edc:desc="Watchdog Debug Halt"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:nzwidth="0x1" edc:desc="Watchdog Idle Halt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSWDT" edc:cname="RSWDT_SR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x40100308">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSWDT">
            <edc:SFRFieldDef edc:cname="WDUNF" edc:nzwidth="0x1" edc:desc="Watchdog Underflow"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x24" edc:_addr="0x4010030C"/>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_MSR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x40100330">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="MS" edc:nzwidth="0xA" edc:desc="Number of 1/1024 seconds elapsed within 1 second"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xCC" edc:_addr="0x40100334"/>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_CR" edc:nzwidth="0x20" edc:access="--------------------------nn-nnn" edc:impl="0x37" edc:_addr="0x40100400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="ECC protection enable"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_TESTCB1" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40100404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="TCB1" edc:nzwidth="0x8" edc:desc="test check bit (8 bit)"/>
            <edc:SFRFieldDef edc:cname="TCB2" edc:nzwidth="0x8" edc:desc="test check bit (8 bit)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
