Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40100408"/>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_SR" edc:nzwidth="0x20" edc:access="--rrrrrr--------rrrrrrrrrrrrrrrr" edc:impl="0x3F00FFFF" edc:_addr="0x4010040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="MEM_FIX_I" edc:nzwidth="0x1" edc:desc="Fixable error status in instruction memory"/>
            <edc:SFRFieldDef edc:cname="MEM_FIX_D" edc:nzwidth="0x1" edc:desc="Fixable error status in data memory"/>
            <edc:SFRFieldDef edc:cname="CPT_FIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_FIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_I" edc:nzwidth="0x1" edc:desc="Un-fixable error status in instruction memory"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_D" edc:nzwidth="0x1" edc:desc="Un-fixable error status in data memory"/>
            <edc:SFRFieldDef edc:cname="CPT_NOFIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_NOFIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="HES" edc:nzwidth="0x3" edc:desc="Hardware Error Size"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="one"/>
            <edc:SFRFieldDef edc:cname="MEM_ID_I" edc:nzwidth="0x1" edc:desc="memory identification number"/>
            <edc:SFRFieldDef edc:cname="MEM_ID_D" edc:nzwidth="0x1" edc:desc="memory identification number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_IER" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40100410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="MEM_FIX_I" edc:nzwidth="0x1" edc:desc="Fixable error on instruction"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_I" edc:nzwidth="0x1" edc:desc="Un-fixable error on instruction"/>
            <edc:SFRFieldDef edc:cname="MEM_FIX_D" edc:nzwidth="0x1" edc:desc="Fixable error on data"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_D" edc:nzwidth="0x1" edc:desc="Un-fixable error on data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_IDR" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x40100414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="MEM_FIX_I" edc:nzwidth="0x1" edc:desc="fixable error on instruction"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_I" edc:nzwidth="0x1" edc:desc="un-fixable error on instruction"/>
            <edc:SFRFieldDef edc:cname="MEM_FIX_D" edc:nzwidth="0x1" edc:desc="fixable error on data"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_D" edc:nzwidth="0x1" edc:desc="un-fixable error on data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_IMR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x40100418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="MEM_FIX_I" edc:nzwidth="0x1" edc:desc="fixable error on instruction"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_I" edc:nzwidth="0x1" edc:desc="un-fixable error on instruction"/>
            <edc:SFRFieldDef edc:cname="MEM_FIX_D" edc:nzwidth="0x1" edc:desc="fixable error on data"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX_D" edc:nzwidth="0x1" edc:desc="un-fixable error on data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_FAILAR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4010041C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="address of the error detected (refers to instruction memory)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_FAILARD" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40100420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="address of the error detected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_FAILDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40100424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="data of the error detected (refers to instruction memory)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCMECC" edc:cname="TCMECC_FAILDRD" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40100428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCMECC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="data of the error detected (refers to instruction memory)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1D4" edc:_addr="0x4010042C"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXRAMECC" edc:cname="FLEXRAMECC_CR" edc:nzwidth="0x20" edc:access="--------------------------nn-nnn" edc:impl="0x37" edc:_addr="0x40100600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXRAMECC">
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="Shall be always write at '1'"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_RD" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - read mode"/>
            <edc:SFRFieldDef edc:cname="TEST_MODE_WR" edc:nzwidth="0x1" edc:desc="test mode of ECC protection - write mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RST_FIX_CPT" edc:nzwidth="0x1" edc:desc="reset the fixable error counter"/>
            <edc:SFRFieldDef edc:cname="RST_NOFIX_CPT" edc:nzwidth="0x1" edc:desc="reset the un-fixable error counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FLEXRAMECC" edc:cname="FLEXRAMECC_TESTCB1" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x40100604">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXRAMECC">
            <edc:SFRFieldDef edc:cname="TCB1" edc:nzwidth="0x8" edc:desc="Test Check Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40100608"/>
      <edc:SFRDef ltx:memberofperipheral="FLEXRAMECC" edc:cname="FLEXRAMECC_SR" edc:nzwidth="0x20" edc:access="----rrrr--------rrrrrr-rrrrrrr-r" edc:impl="0xF00FDFD" edc:_addr="0x4010060C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FLEXRAMECC">
            <edc:SFRFieldDef edc:cname="MEM_FIX" edc:nzwidth="0x1" edc:desc="Fixable error status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPT_FIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_FIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:SFRFieldDef edc:cname="MEM_NOFIX" edc:nzwidth="0x1" edc:desc="Un-fixable error status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CPT_NOFIX" edc:nzwidth="0x5" edc:desc="5 bits counter"/>
            <edc:SFRFieldDef edc:cname="OVER_NOFIX" edc:nzwidth="0x1" edc:desc="counter overflow"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="HES" edc:nzwidth="0x3" edc:desc="Hardware Error Size"/>
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="write or read access"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
