Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHER" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x40200010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Enable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Enable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Enable"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Enable"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Enable"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Enable"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Enable"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Enable"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:nzwidth="0x1" edc:desc="Channel 8 Enable"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:nzwidth="0x1" edc:desc="Channel 9 Enable"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:nzwidth="0x1" edc:desc="Channel 10 Enable"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:nzwidth="0x1" edc:desc="Channel 11 Enable"/>
            <edc:SFRFieldDef edc:cname="CH12" edc:nzwidth="0x1" edc:desc="Channel 12 Enable"/>
            <edc:SFRFieldDef edc:cname="CH13" edc:nzwidth="0x1" edc:desc="Channel 13 Enable"/>
            <edc:SFRFieldDef edc:cname="CH14" edc:nzwidth="0x1" edc:desc="Channel 14 Enable"/>
            <edc:SFRFieldDef edc:cname="CH15" edc:nzwidth="0x1" edc:desc="Channel 15 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwwwwwww" edc:impl="0xFFFF" edc:_addr="0x40200014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Disable"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Disable"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Disable"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Disable"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Disable"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Disable"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Disable"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Disable"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:nzwidth="0x1" edc:desc="Channel 8 Disable"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:nzwidth="0x1" edc:desc="Channel 9 Disable"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:nzwidth="0x1" edc:desc="Channel 10 Disable"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:nzwidth="0x1" edc:desc="Channel 11 Disable"/>
            <edc:SFRFieldDef edc:cname="CH12" edc:nzwidth="0x1" edc:desc="Channel 12 Disable"/>
            <edc:SFRFieldDef edc:cname="CH13" edc:nzwidth="0x1" edc:desc="Channel 13 Disable"/>
            <edc:SFRFieldDef edc:cname="CH14" edc:nzwidth="0x1" edc:desc="Channel 14 Disable"/>
            <edc:SFRFieldDef edc:cname="CH15" edc:nzwidth="0x1" edc:desc="Channel 15 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CHSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40200018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Status"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Status"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Status"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Status"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Status"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Status"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Status"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Status"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:nzwidth="0x1" edc:desc="Channel 8 Status"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:nzwidth="0x1" edc:desc="Channel 9 Status"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:nzwidth="0x1" edc:desc="Channel 10 Status"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:nzwidth="0x1" edc:desc="Channel 11 Status"/>
            <edc:SFRFieldDef edc:cname="CH12" edc:nzwidth="0x1" edc:desc="Channel 12 Status"/>
            <edc:SFRFieldDef edc:cname="CH13" edc:nzwidth="0x1" edc:desc="Channel 13 Status"/>
            <edc:SFRFieldDef edc:cname="CH14" edc:nzwidth="0x1" edc:desc="Channel 14 Status"/>
            <edc:SFRFieldDef edc:cname="CH15" edc:nzwidth="0x1" edc:desc="Channel 15 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4020001C"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_LCDR" edc:nzwidth="0x20" edc:access="---rrrrr--------rrrrrrrrrrrrrrrr" edc:impl="0x1F00FFFF" edc:_addr="0x40200020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LDATA" edc:nzwidth="0x10" edc:desc="Last Data Converted"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNBOSR" edc:nzwidth="0x5" edc:desc="Channel Number in Oversampling Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IER" edc:nzwidth="0x20" edc:access="-----www--------wwwwwwwwwwwwwwww" edc:impl="0x700FFFF" edc:_addr="0x40200024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 11"/>
            <edc:SFRFieldDef edc:cname="EOC12" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 12"/>
            <edc:SFRFieldDef edc:cname="EOC13" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 13"/>
            <edc:SFRFieldDef edc:cname="EOC14" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 14"/>
            <edc:SFRFieldDef edc:cname="EOC15" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 15"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IDR" edc:nzwidth="0x20" edc:access="-----www--------wwwwwwwwwwwwwwww" edc:impl="0x700FFFF" edc:_addr="0x40200028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 11"/>
            <edc:SFRFieldDef edc:cname="EOC12" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 12"/>
            <edc:SFRFieldDef edc:cname="EOC13" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 13"/>
            <edc:SFRFieldDef edc:cname="EOC14" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 14"/>
            <edc:SFRFieldDef edc:cname="EOC15" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 15"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
