Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_IMR" edc:nzwidth="0x20" edc:access="-----rrr--------rrrrrrrrrrrrrrrr" edc:impl="0x700FFFF" edc:_addr="0x4020002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 11"/>
            <edc:SFRFieldDef edc:cname="EOC12" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 12"/>
            <edc:SFRFieldDef edc:cname="EOC13" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 13"/>
            <edc:SFRFieldDef edc:cname="EOC14" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 14"/>
            <edc:SFRFieldDef edc:cname="EOC15" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 15"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_ISR" edc:nzwidth="0x20" edc:access="-----rrr--------rrrrrrrrrrrrrrrr" edc:impl="0x700FFFF" edc:_addr="0x40200030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion 0 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion 1 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion 2 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion 3 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion 4 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion 5 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion 6 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion 7 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion 8 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion 9 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion 10 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion 11 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC12" edc:nzwidth="0x1" edc:desc="End of Conversion 12 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC13" edc:nzwidth="0x1" edc:desc="End of Conversion 13 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC14" edc:nzwidth="0x1" edc:desc="End of Conversion 14 (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="EOC15" edc:nzwidth="0x1" edc:desc="End of Conversion 15 (automatically set / cleared)"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready (automatically set / cleared)"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40200034"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_OVER" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4020003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:nzwidth="0x1" edc:desc="Overrun Error 0"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:nzwidth="0x1" edc:desc="Overrun Error 1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:nzwidth="0x1" edc:desc="Overrun Error 2"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:nzwidth="0x1" edc:desc="Overrun Error 3"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:nzwidth="0x1" edc:desc="Overrun Error 4"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:nzwidth="0x1" edc:desc="Overrun Error 5"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:nzwidth="0x1" edc:desc="Overrun Error 6"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:nzwidth="0x1" edc:desc="Overrun Error 7"/>
            <edc:SFRFieldDef edc:cname="OVRE8" edc:nzwidth="0x1" edc:desc="Overrun Error 8"/>
            <edc:SFRFieldDef edc:cname="OVRE9" edc:nzwidth="0x1" edc:desc="Overrun Error 9"/>
            <edc:SFRFieldDef edc:cname="OVRE10" edc:nzwidth="0x1" edc:desc="Overrun Error 10"/>
            <edc:SFRFieldDef edc:cname="OVRE11" edc:nzwidth="0x1" edc:desc="Overrun Error 11"/>
            <edc:SFRFieldDef edc:cname="OVRE12" edc:nzwidth="0x1" edc:desc="Overrun Error 12"/>
            <edc:SFRFieldDef edc:cname="OVRE13" edc:nzwidth="0x1" edc:desc="Overrun Error 13"/>
            <edc:SFRFieldDef edc:cname="OVRE14" edc:nzwidth="0x1" edc:desc="Overrun Error 14"/>
            <edc:SFRFieldDef edc:cname="OVRE15" edc:nzwidth="0x1" edc:desc="Overrun Error 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_EMR" edc:nzwidth="0x20" edc:access="--nn---n-n-n-nnn--nn--n-nnnn-nnn" edc:impl="0x315732F7" edc:_addr="0x40200040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x2" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="When the converted data is lower than the low threshold of the window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="When the converted data is higher than the high threshold of the window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="When the converted data is in the comparison window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="When the converted data is out of the comparison window, generates the ADC_ISR.COMPE flag or, in Partial Wakeup mode, defines the conditions to exit system from Wait mode." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMPTYPE" edc:nzwidth="0x1" edc:desc="Comparison Type">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any conversion is performed and comparison function drives the ADC_ISR.COMPE flag." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison conditions must be met to start the storage of all conversions until the ADC_CR.CMPRST bit is set." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPSEL" edc:nzwidth="0x4" edc:desc="Comparison Selected Channel"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPALL" edc:nzwidth="0x1" edc:desc="Compare All Channels"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMPFILTER" edc:nzwidth="0x2" edc:desc="Compare Event Filtering"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x3" edc:desc="Over Sampling Rate">
              <edc:SFRFieldSemantic edc:cname="NO_AVERAGE" edc:desc="No averaging. ADC sample rate is maximum." edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OSR4" edc:desc="1-bit enhanced resolution by averaging. ADC sample rate divided by 4." edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="OSR16" edc:desc="2-bit enhanced resolution by averaging. ADC sample rate divided by 16." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="OSR64" edc:desc="3-bit enhanced resolution by averaging. ADC sample rate divided by 64." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="OSR256" edc:desc="4-bit enhanced resolution by averaging. ADC sample rate divided by 256." edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ASTE" edc:nzwidth="0x1" edc:desc="Averaging on Single Trigger Event">
              <edc:SFRFieldSemantic edc:cname="MULTI_TRIG_AVERAGE" edc:desc="The average requests several trigger events." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE_TRIG_AVERAGE" edc:desc="The average requests only one trigger event." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRACKX4" edc:nzwidth="0x1" edc:desc="Tracking time x4">
              <edc:SFRFieldSemantic edc:cname="TRACK1" edc:desc="The ADC_MR.TRACKTIM field effect is multiplied by 1." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TRACK4" edc:desc="The ADC_MR.TRACKTIM field effect is multiplied by 4." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TAG" edc:nzwidth="0x1" edc:desc="Tag of ADC_LCDR"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADCMODE" edc:nzwidth="0x2" edc:desc="ADC Running Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode of operation." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="OFFSET_ERROR" edc:desc="Offset Error mode to measure the offset error. See Table 7-6." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="GAIN_ERROR_HIGH" edc:desc="Gain Error mode to measure the gain error. See Table 7-6." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="GAIN_ERROR_LOW" edc:desc="Gain Error mode to measure the gain error. See Table 7-6." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40200044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:nzwidth="0x10" edc:desc="Low Threshold"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:nzwidth="0x10" edc:desc="High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
