Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CDR15" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x4020008C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40200090"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_ACR" edc:nzwidth="0x20" edc:access="----------------------nn--------" edc:impl="0x300" edc:_addr="0x40200094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:nzwidth="0x2" edc:desc="ADC Bias Current Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3C" edc:_addr="0x40200098"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CVR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x402000D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x10" edc:desc="Offset Correction"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x10" edc:desc="Gain Correction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CECR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x402000D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 2"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 3"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 4"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 5"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 6"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 7"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 8"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 9"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 10"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 11"/>
            <edc:SFRFieldDef edc:cname="ECORR12" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 12"/>
            <edc:SFRFieldDef edc:cname="ECORR13" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 13"/>
            <edc:SFRFieldDef edc:cname="ECORR14" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 14"/>
            <edc:SFRFieldDef edc:cname="ECORR15" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x402000DC"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-----nnn" edc:impl="0xFFFFFF07" edc:_addr="0x402000E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:SFRFieldDef edc:cname="WPITEN" edc:nzwidth="0x1" edc:desc="Write Protection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WPCTEN" edc:nzwidth="0x1" edc:desc="Write Protection Control Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x402000E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:regionid="SYSTEM" edc:beginaddr="0xE0000000" edc:endaddr="0xE0042000" edc:rw="rw">
      <edc:SFRDef ltx:memberofperipheral="ITM" edc:cname="PORT0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
