Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000200C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000201C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_COMP7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="BE" edc:nzwidth="0x1" edc:desc="Breakpoint enable"/>
            <edc:SFRFieldDef edc:cname="BPADDR" edc:nzwidth="0x1F" edc:desc="Breakpoint address"/>
            <edc:AdjustPoint edc:offset="-30"/>
            <edc:SFRFieldDef edc:cname="FPADDR" edc:nzwidth="0x1B" edc:desc="Flash Patch address"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Flash Patch enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF88" edc:_addr="0xE0002028"/>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_LAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0002FB0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x20" edc:desc="Lock access control">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_LSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE0002FB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="SLI" edc:nzwidth="0x1" edc:desc="Software Lock implemented"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:nzwidth="0x1" edc:desc="Software Lock status"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:nzwidth="0x1" edc:desc="Not thirty-two bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0xE0002FB8"/>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_PID4" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:impl="0xFF" edc:_addr="0xE0002FD0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="DES_2" edc:nzwidth="0x4" edc:desc="JEP106 continuation code"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x4" edc:desc="4KB count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002FD4"/>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002FD8"/>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0002FDC"/>
      <edc:SFRDef ltx:memberofperipheral="FPB" edc:cname="FP_PID0" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFF" edc:_addr="0xE0002FE0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPB">
            <edc:SFRFieldDef edc:cname="PART_0" edc:nzwidth="0x8" edc:desc="Part number bits[7:0]"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
