Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DCRSR" edc:nzwidth="0x20" edc:access="---------------w-----------wwwww" edc:impl="0x1001F" edc:_addr="0xE000EEE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="REGSEL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="REGWnR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DCRDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE000EEE8"/>
      <edc:SFRDef ltx:memberofperipheral="CoreDebug" edc:cname="DEMCR" edc:nzwidth="0x20" edc:access="-------n----nnnn-----nnnnnnn---n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x10F07F1" edc:_addr="0xE000EEEC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="VC_CORERESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VC_MMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_NOCPERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_CHKERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_STATERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_BUSERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_INTERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VC_HARDERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MON_EN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_PEND" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_STEP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MON_REQ" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TRCENA" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0xE000EEF0"/>
      <edc:SFRDef ltx:memberofperipheral="SCB NVIC" edc:cname="STIR" edc:nzwidth="0x20" edc:access="-----------------------wwwwwwwww" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1FF" edc:_addr="0xE000EF00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="INTID" edc:nzwidth="0x9" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="NVIC">
            <edc:SFRFieldDef edc:cname="INTID" edc:nzwidth="0x9" edc:desc="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0xE000EF04"/>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="FPCCR" edc:nzwidth="0x20" edc:access="nn---------------------n-nnnn-nn" edc:por="11000000000000000000000000000000" edc:mclr="11000000000000000000000000000000" edc:impl="0xC000017B" edc:_addr="0xE000EF34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="LSPACT" edc:nzwidth="0x1" edc:desc="Lazy state preservation is active. Floating-point stack frame has been allocated but saving state to it has been deferred."/>
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x1" edc:desc="Privilege level was user when the floating-point stack frame was allocated."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="THREAD" edc:nzwidth="0x1" edc:desc="Mode was Thread Mode when the floating-point stack frame was allocated."/>
            <edc:SFRFieldDef edc:cname="HFRDY" edc:nzwidth="0x1" edc:desc="Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated."/>
            <edc:SFRFieldDef edc:cname="MMRDY" edc:nzwidth="0x1" edc:desc="MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated."/>
            <edc:SFRFieldDef edc:cname="BFRDY" edc:nzwidth="0x1" edc:desc="BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated."/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MONRDY" edc:nzwidth="0x1" edc:desc="DebugMonitor is enabled and priority permits setting MON_PEND when the floating-point stack frame was allocated."/>
            <edc:AdjustPoint edc:offset="0x15"/>
            <edc:SFRFieldDef edc:cname="LSPEN" edc:nzwidth="0x1" edc:desc="Enable automatic lazy state preservation for floating-point context."/>
            <edc:SFRFieldDef edc:cname="ASPEN" edc:nzwidth="0x1" edc:desc="Enables CONTROL.FPCA setting on execution of a floating-point instruction. This results in automatic hardware state preservation and restoration, for floating-point context, on exception entry and exit."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="FPCAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn---" edc:impl="0xFFFFFFF8" edc:_addr="0xE000EF38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x1D" edc:desc="The location of the unpopulated floating-point register space allocated on an exception stack frame."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="FPU" edc:cname="FPDSCR" edc:nzwidth="0x20" edc:access="-----nnnnn----------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x7C00000" edc:_addr="0xE000EF3C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="RMode" edc:nzwidth="0x2" edc:desc="Default value for FPSCR.RMode."/>
            <edc:SFRFieldDef edc:cname="FZ" edc:nzwidth="0x1" edc:desc="Default value for FPSCR.FZ."/>
            <edc:SFRFieldDef edc:cname="DN" edc:nzwidth="0x1" edc:desc="Default value for FPSCR.DN."/>
            <edc:SFRFieldDef edc:cname="AHP" edc:nzwidth="0x1" edc:desc="Default value for FPSCR.AHP."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB FPU" edc:cname="MVFR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00010000000100010000000000100001" edc:mclr="00010000000100010000000000100001" edc:_addr="0xE000EF40">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="A_SIMD_registers" edc:nzwidth="0x4" edc:desc="Indicates the size of the FP register bank"/>
            <edc:SFRFieldDef edc:cname="Single_precision" edc:nzwidth="0x4" edc:desc="Indicates the hardware support for FP single-precision operations"/>
            <edc:SFRFieldDef edc:cname="Double_precision" edc:nzwidth="0x4" edc:desc="Indicates the hardware support for FP double-precision operations"/>
            <edc:SFRFieldDef edc:cname="FP_excep_trapping" edc:nzwidth="0x4" edc:desc="Indicates whether the FP hardware implementation supports exception trapping"/>
            <edc:SFRFieldDef edc:cname="Divide" edc:nzwidth="0x4" edc:desc="Indicates the hardware support for FP divide operations"/>
            <edc:SFRFieldDef edc:cname="Square_root" edc:nzwidth="0x4" edc:desc="Indicates the hardware support for FP square root operations"/>
            <edc:SFRFieldDef edc:cname="Short_vectors" edc:nzwidth="0x4" edc:desc="Indicates the hardware support for FP short vectors"/>
            <edc:SFRFieldDef edc:cname="FP_rounding_modes" edc:nzwidth="0x4" edc:desc="Indicates the rounding modes supported by the FP floating-point hardware"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB FPU" edc:cname="MVFR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00010001000100010000000000110001" edc:mclr="00010001000100010000000000110001" edc:_addr="0xE000EF44">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="FPU">
            <edc:SFRFieldDef edc:cname="FtZ_mode" edc:nzwidth="0x4" edc:desc="Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation"/>
            <edc:SFRFieldDef edc:cname="D_NaN_mode" edc:nzwidth="0x4" edc:desc="Indicates whether the FP hardware implementation supports only the Default NaN mode"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="FP_HPFP" edc:nzwidth="0x4" edc:desc="Floating Point Half-Precision and double-precision"/>
            <edc:SFRFieldDef edc:cname="FP_fused_MAC" edc:nzwidth="0x4" edc:desc="Indicates whether the FP supports fused multiply accumulate operations"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB FPU" edc:cname="MVFR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00010000000100010000000001100001" edc:mclr="00010000000100010000000001100001" edc:_addr="0xE000EF48">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0"/>
          <edc:SFRMode edc:id="DS.1" ltx:memberofperipheral="FPU">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="VFP_Misc" edc:nzwidth="0x4" edc:desc="Indicates the hardware support for FP miscellaneous features"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x310B4" edc:_addr="0xE000EF4C"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="SSPSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0040000"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="CSPSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0040004"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0040008"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="ACPR" edc:nzwidth="0x20" edc:access="-------------------nnnnnnnnnnnnn" edc:impl="0x1FFF" edc:_addr="0xE0040010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:nzwidth="0xD"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
