Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:AdjustPoint edc:offset="0xDC" edc:_addr="0xE0040014"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="SPPR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0xE00400F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="TXMODE" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20C" edc:_addr="0xE00400F4"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="FFSR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0xE0040300">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="FlInProg" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FtStopped" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCPresent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FtNonStop" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="FFCR" edc:nzwidth="0x20" edc:access="-----------------------n------n-" edc:impl="0x102" edc:_addr="0xE0040304">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EnFCont" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TrigIn" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="FSCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0040308"/>
      <edc:AdjustPoint edc:offset="0xBDC" edc:_addr="0xE004030C"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="TRIGGER" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0xE0040EE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="TRIGGER" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="FIFO0" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x3FFFFFFF" edc:_addr="0xE0040EEC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="ETM0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETM_ATVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ITM_ATVALID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="ITATBCTR2" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0xE0040EF0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="ATREADY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0040EF4"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="ITATBCTR0" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0xE0040EF8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="ATREADY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="FIFO1" edc:nzwidth="0x20" edc:access="--rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0x3FFFFFFF" edc:_addr="0xE0040EFC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="ITM0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ITM1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ITM2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ETM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETM_ATVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITM_bytecount" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ITM_ATVALID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0xE0040F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0040F04"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0040FA0"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0040FA4"/>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0xE0040FA8"/>
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="DEVID" edc:nzwidth="0x20" edc:access="--------------------rrrrrrr----r" edc:impl="0xFE1" edc:_addr="0xE0040FC8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="NrTraceInput" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="AsynClkIn" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MinBufSz" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="PTINVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MANCVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NRZVALID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
