Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
      <edc:SFRDef ltx:memberofperipheral="TPIU" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0xE0040FCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TPIU">
            <edc:SFRFieldDef edc:cname="SubType" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MajorType" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0xE0040FD0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CR" edc:nzwidth="0x20" edc:access="---n------n---nn--n-nnnnnnnn---n" edc:por="00000000000000000000010000010001" edc:mclr="00000000000000000000010000010001" edc:impl="0x10232FF1" edc:_addr="0xE0041000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="ETMPD" edc:nzwidth="0x1" edc:desc="ETM Power Down"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE" edc:nzwidth="0x3" edc:desc="Port Size bits 2:0"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:nzwidth="0x1" edc:desc="Stall Processor"/>
            <edc:SFRFieldDef edc:cname="BROUT" edc:nzwidth="0x1" edc:desc="Branch Output"/>
            <edc:SFRFieldDef edc:cname="DBGRQ" edc:nzwidth="0x1" edc:desc="Debug Request Control"/>
            <edc:SFRFieldDef edc:cname="PROG" edc:nzwidth="0x1" edc:desc="ETM Programming"/>
            <edc:SFRFieldDef edc:cname="PORTSEL" edc:nzwidth="0x1" edc:desc="ETM Port Select"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PORTMODE2" edc:nzwidth="0x1" edc:desc="Port Mode bit 2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTMODE" edc:nzwidth="0x2" edc:desc="Port Mode bits 1:0"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PORTSIZE3" edc:nzwidth="0x1" edc:desc="Port Size bit 3"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TSEN" edc:nzwidth="0x1" edc:desc="TimeStamp Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="10001100100000000010000000000000" edc:mclr="10001100100000000010000000000000" edc:_addr="0xE0041004"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TRIGGER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041008"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE004100C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041010"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SCR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000100000110100001001" edc:mclr="00000000000000100000110100001001" edc:_addr="0xE0041014"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0041018"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TEEVR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041020"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TECR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041024"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="FFLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041028"/>
      <edc:AdjustPoint edc:offset="0x114" edc:_addr="0xE004102C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CNTRLDVR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041140"/>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0041144"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="SYNCFR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000010000000000" edc:mclr="00000000000000000000010000000000" edc:_addr="0xE00411E0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="IDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="01000001000101001111001001010000" edc:mclr="01000001000101001111001001010000" edc:_addr="0xE00411E4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CCER" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00011000010101000001100000000000" edc:mclr="00011000010101000001100000000000" edc:_addr="0xE00411E8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411EC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TESSEICR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE00411F0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411F4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TSEVT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE00411F8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE00411FC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="TRACEIDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041200"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041204"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="IDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041208"/>
      <edc:AdjustPoint edc:offset="0x108" edc:_addr="0xE004120C"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PDSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:_addr="0xE0041314"/>
      <edc:AdjustPoint edc:offset="0xBC8" edc:_addr="0xE0041318"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITMISCIN" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041EE0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EE4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITTRIGOUT" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041EE8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EEC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITATBCTR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041EF0"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EF4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITATBCTR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041EF8"/>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE0041EFC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0xE0041F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="INTEGRATION" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0xE0041F04"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041FA0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0xE0041FA4"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE0041FA8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="LAR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0xE0041FB0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="LSR" edc:nzwidth="0x20" edc:access="-----------------------------rrr" edc:impl="0x7" edc:_addr="0xE0041FB4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ByteAcc" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0xE0041FB8"/>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0xE0041FBC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000010011" edc:mclr="00000000000000000000000000010011" edc:_addr="0xE0041FCC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:_addr="0xE0041FD0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FD4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FD8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FDC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000100101" edc:mclr="00000000000000000000000000100101" edc:_addr="0xE0041FE0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010111001" edc:mclr="00000000000000000000000010111001" edc:_addr="0xE0041FE4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000001011" edc:mclr="00000000000000000000000000001011" edc:_addr="0xE0041FE8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="PIDR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE0041FEC"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000001101" edc:mclr="00000000000000000000000000001101" edc:_addr="0xE0041FF0"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010010000" edc:mclr="00000000000000000000000010010000" edc:_addr="0xE0041FF4"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000101" edc:mclr="00000000000000000000000000000101" edc:_addr="0xE0041FF8"/>
      <edc:SFRDef ltx:memberofperipheral="ETM" edc:cname="CIDR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000010110001" edc:mclr="00000000000000000000000010110001" edc:_addr="0xE0041FFC"/>
    </edc:SFRDataSector>
    <edc:CodeSector edc:regionid="ITCM" edc:beginaddr="0x0" edc:endaddr="0x10000" edc:rw="rw" edc:isprogrammedatruntime="true"/>
    <edc:CodeSector edc:regionid="IFLASH" edc:beginaddr="0x10000000" edc:endaddr="0x10020000" atdf:pagesize="0x100" edc:rw="rw"/>
    <edc:BootConfigSector edc:regionid="IROM" edc:beginaddr="0x11000000" edc:endaddr="0x11020000" edc:rw="r"/>
    <edc:GPRDataSector edc:regionid="DTCM" edc:beginaddr="0x20000000" edc:endaddr="0x20020000" edc:isexecutable="true" edc:rw="rw" edc:isprogrammedatruntime="true"/>
    <edc:GPRDataSector edc:regionid="FLEXRAM" edc:beginaddr="0x21000000" edc:endaddr="0x21020000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:ExternalSector edc:regionid="EBI_CSHEMC" edc:beginaddr="0x60000000" edc:endaddr="0x60200000" edc:isexecutable="true" edc:rw="rw" edc:accessprotocol="ebi" edc:type="flash"/>
    <edc:DeviceIDSector edc:regionid="devid" edc:beginaddr="0x40100000" edc:endaddr="0x40100004" edc:value="0xB1770700" edc:mask="0xFFFFFFE0"/>
    <edc:EmulatorSector edc:beginaddr="0xE0001000" edc:endaddr="0xE000F000" edc:regionid="emulation"/>
  </edc:PhysicalSpace>
  <edc:FusesSpace edc:magicoffset="0xD0000000">
    <edc:ConfigFuseSector edc:regionid="FUSES" edc:beginaddr="0x0" edc:endaddr="0x10">
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_0" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x0">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="RC_TRIM_CRC" edc:nzwidth="0x20" edc:desc="RC Trim CRC"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
