Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB20" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB21" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO1" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM3_IO0" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="TMS" edc:ppsfunction="A" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDIO" edc:ppsfunction="A" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB24" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="TCK" edc:ppsfunction="A" ltx:memberofperipheral="ICE"/>
      <edc:VirtualPin edc:name="SWDCLK" edc:ppsfunction="A" ltx:memberofperipheral="ICE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB25" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="ATXOUTP" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB26" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="ATXOUTN" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB27" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="ARXINP" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB28" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="ARXINN" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BTXOUTP" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BTXOUTN" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BRXINP" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BRXINN" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NMIC_NMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWMFI0" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWMEXTRG0" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="A" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="NWE" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BTXOUTP" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BTXOUTN" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BRXINP" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
      <edc:VirtualPin edc:name="D2" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="BRXINN" edc:ppsfunction="A" ltx:memberofperipheral="IP1553"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH0" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWML0" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWML1" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC8" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH2" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TIOA6" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC9" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWML2" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TIOB6" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC10" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWMH3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="A2" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TCLK7" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PWMC1_PWML3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="A3" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TCLK6" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO0" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="B" ltx:memberofperipheral="RTC"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO1" edc:ppsfunction="C" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="A" ltx:memberofperipheral="MCAN1"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="A" ltx:memberofperipheral="MCAN1"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TIOA7" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC15" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC16" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO2" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="PWMC1_PWMFI1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC17" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO3" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO4" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="A10" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="PWMC1_PWMFI2" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO5" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="PWMC1_PWMEXTRG1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC20" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO6" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM2"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC21" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC23" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC24" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC25" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC26" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TCLK8" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC27" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A19" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TIOA8" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC28" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="A20" edc:ppsfunction="B" ltx:memberofperipheral="HEMC"/>
      <edc:VirtualPin edc:name="TIOB8" edc:ppsfunction="C" ltx:memberofperipheral="TC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDINP0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDINN0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO4" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDOUTP0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDOUTN0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO2" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SPWREF0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSOUTP0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSOUTN0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO6" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD16" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSINP0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD17" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSINN0" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
      <edc:VirtualPin edc:name="FLEXCOM2_IO3" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD18" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDINP1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD19" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDINN1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD20" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDOUTP1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWDOUTN1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="SPWREF1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD22" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSOUTP1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD23" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSOUTN1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD24" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSINP1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD25" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="SPWSINN1" edc:ppsfunction="A" ltx:memberofperipheral="SPW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD28" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="DAC2" edc:ppsfunction="X1" ltx:memberofperipheral="DACC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD29" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="DAC1P" edc:ppsfunction="X1" ltx:memberofperipheral="DACC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD30" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="DAC1N" edc:ppsfunction="X1" ltx:memberofperipheral="DACC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="DAC0" edc:ppsfunction="X1" ltx:memberofperipheral="DACC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO_DAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO_DAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AD_DAC_GNDREF"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AD_DAC_VREFIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA_GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ANA_3V3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO_ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO_ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA0" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA1" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA2" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA3" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA4" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD4" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA5" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA6" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA7" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA8" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA9" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
