Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH707_DFP/1.2.156/edc/ATSAMRH707F18A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA10" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA11" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD11" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA12" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD12" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCCDATA13" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD13" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO6" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
      <edc:VirtualPin edc:name="PCCDATA14" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD14" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO5" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
      <edc:VirtualPin edc:name="PCCDATA15" edc:ppsfunction="D" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="AD15" edc:ppsfunction="X1" ltx:memberofperipheral="ADC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM1_IO5" edc:ppsfunction="B" ltx:memberofperipheral="FLEXCOM1"/>
      <edc:VirtualPin edc:name="PWMC0_PWMFI2" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="XIN32"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC29" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="DATRG" edc:ppsfunction="A" ltx:memberofperipheral="DACC"/>
      <edc:VirtualPin edc:name="BOOT_MODE1" edc:ppsfunction="X1" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC30" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="A" ltx:memberofperipheral="ADC"/>
      <edc:VirtualPin edc:name="BOOT_MODE0" edc:ppsfunction="X1" ltx:memberofperipheral="HEMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO2" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="FLEXCOM0_IO3" edc:ppsfunction="A" ltx:memberofperipheral="FLEXCOM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default" ltx:memberofperipheral="PIO"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="A" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMC0_PWMEXTRG0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDCORE"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
